/*
 * Copyright Mazaffaka Project (c) 2013.
 */

package handler.items;

import l2p.commons.util.Rnd;
import l2p.gameserver.cache.Msg;
import l2p.gameserver.model.Player;
import l2p.gameserver.model.items.ItemInstance;
import l2p.gameserver.network.serverpackets.SystemMessage;
import l2p.gameserver.scripts.Functions;
import org.apache.commons.lang3.ArrayUtils;

import java.util.ArrayList;
import java.util.List;

public class Extractable extends SimpleItemHandler {
    private static final int[] ITEM_IDS = new int[]{
            8534,
            8535,
            8536,
            8537,
            8538,
            8539,
            8540,
            5916,
            5944,
            14841,
            5955,
            14847,
            5966,
            5967,
            5968,
            5969,
            6007,
            6008,
            6009,
            6010,
            7725,
            7637,
            7636,
            7629,
            7630,
            7631,
            7632,
            7633,
            7634,
            7635,
            10408,
            10473,
            9599,
            20069,
            20070,
            20071,
            20072,
            20073,
            20074,
            20210,
            20211,
            20215,
            20216,
            20217,
            20218,
            20219,
            20220,
            20227,
            20228,
            20229,
            20233,
            20234,
            20235,
            20239,
            20240,
            20241,
            20242,
            20243,
            20244,
            20251,
            20254,
            20278,
            20279,
            20041,
            20042,
            20043,
            20044,
            20035,
            20036,
            20037,
            20038,
            20039,
            20040,
            20060,
            20061,
            22000,
            22001,
            22002,
            22003,
            22004,
            22005,
            20326,
            20327,
            20329,
            20330,
            20059,
            20494,
            20493,
            20395,
            13281,
            13282,
            13283,
            13284,
            13285,
            13286,
            13287,
            13288,
            13289,
            13290,
            14267,
            14268,
            14269,
            13280,
            22087,
            22088,
            13713,
            13714,
            13715,
            13716,
            13717,
            13718,
            13719,
            13720,
            13721,
            14549,
            14550,
            14551,
            14552,
            14553,
            14554,
            14555,
            14556,
            14557,
            13695,
            13696,
            13697,
            13698,
            13699,
            13700,
            13701,
            13702,
            13703,
            14531,
            14532,
            14533,
            14534,
            14535,
            14536,
            14537,
            14538,
            14539,
            13704,
            13705,
            13706,
            13707,
            13708,
            13709,
            13710,
            13711,
            13712,
            14540,
            14541,
            14542,
            14543,
            14544,
            14545,
            14546,
            14547,
            14548,
            14884,
            14885,
            14886,
            14887,
            14888,
            14889,
            14890,
            14891,
            14892,
            14893,
            14894,
            14895,
            14896,
            14897,
            14898,
            14899,
            14900,
            14901,
            14616,
            20575,
            20804,
            20807,
            20805,
            20808,
            20806,
            20809,
            20842,
            20843,
            20844,
            20845,
            20846,
            20847,
            20848,
            20849,
            20850,
            20851,
            20852,
            20853,
            20854,
            20855,
            20856,
            20857,
            20858,
            20859,
            20860,
            20861,
            20862,
            20863,
            20864,
            20811,
            20812,
            20813,
            20814,
            20815,
            20816,
            20817,
            20810,
            20865,
            20748,
            20749,
            20750,
            20751,
            20752,
            20195,
            20196,
            20197,
            20198,
            13777,
            13778,
            13779,
            13780,
            13781,
            13782,
            13783,
            13784,
            13785,
            13786,
            14849,
            14834,
            14833,
            13988,
            13989,
            13003,
            13004,
            13005,
            13006,
            13007,
            13990,
            13991,
            13992,
            14850,
            14713,
            14714,
            14715,
            14716,
            14717,
            14718,
            17138,
            15482,
            15483,
            13270,
            13271,
            13272,
            14231,
            14232,
            21747,
            21748,
            21749,
            17169,
            21753,
            21752,
            30281,  // Blessed Spiritshot Large Pack (R-Grade)
            30282,  // Orichalcum Quiver
            30283,  // Orichalcum Bolt Container
            30284,  // Requiem Weapon Box
            30285,  // Immortal Heavy Armor Box
            30286,  // Immortal Light Armor Box
            30287,  // Immortal Robe Armor Box
            30288,  // Apocalypse Weapon Box
            30289,  // Twilight Heavy Armor Box
            30290,  // Twilight Light Armor Box
            30291,  // Twilight Robe Armor Box
            30292,  // Immortal Accessory Box
            30293, // Twilight Accessory Box
            33465,
            20102,
            20101,
            53, //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Гнева
            54, //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости.
            55, //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости (7 дней)
            56,
            136,
            137,
            138,
            139,
            140,
            141,
            163,
            170,
            5906, //Красный Кристалл Души: Уровень 11
            5907, //Красный Кристалл Души: Уровень 11
            5909, //Красный Кристалл Души: Уровень 11
            5910, //Красный Кристалл Души: Уровень 11
            5912, //Красный Кристалл Души: Уровень 11
            5913, //Синий Кристалл Души: Уровень 12
            13079, //Упаковка: Книга Телепорта к Флагу (1 шт.)
            13080, //Упаковка: Книга Телепорта к Флагу (30 шт.)
            13082, //Упаковка: Благословенные Перья (3 шт.)
            13083, //Упаковка: Агатион Любви (30 дней)
            13084, //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
            13085, //Упаковка: Билет в Камалоку (3 шт.)
            13086, //Упаковка: Шляпа Кошки Кэт (30 дней)
            13087, //Упаковка: Шляпа Королевы Кошек (30 дней)
            13088, //Упаковка: Шляпа Монстроглаза (30 дней)
            13089, //Упаковка: Шляпа Бурого Медведя (30 дней)
            13090, //Упаковка: Шляпа Горного Гриба (30 дней)
            13091, //Упаковка: Маска Черепа (30 дней)
            13092, //Упаковка: Шляпа Орнитомима (30 дней)
            13093, //Упаковка: Шляпа Короля Кошек (30 дней)
            13094, //Упаковка: Шляпа Кота Кая (30 дней)
            13095, //Упаковка: Крестик/Нолик (30 дней)
            13096, //Упаковка: Камень/Ножницы/Бумага (30 дней)
            13097, //Упаковка: Браслет Сиреневого Коня
            13098, //Упаковка: Изменение Цвета Титула (3 шт.)
            13103, //Упаковка: Книга Телепорта к Флагу (1 шт.)
            13105, //Упаковка: Билет в Камалоку (3 шт.)
            13104, //Упаковка: Свиток Телепорта к Флагу (30 шт.)
            13106, //Упаковка: Благословенные Перья (3 шт.)
            13107, //Упаковка: Агатион Любви (30 дней)
            13108, //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
            13109, //Упаковка: Билет в Камалоку (3 шт.)
            13110, //Упаковка: Шляпа Кошки Кэт (30 дней)
            13111, //Упаковка: Шляпа Королевы Кошек (30 дней)
            13112, //Упаковка: Шляпа Монстроглаза (30 дней)
            13113, //Упаковка: Шляпа Бурого Медведя (30 дней)
            13114, //Упаковка: Шляпа Горного Гриба (30 дней)
            13115,
            13116, //Упаковка: Шляпа Орнитомима (30 дней)">
            13117, //Упаковка: Шляпа Короля Кошек (30 дней)">
            13118, //Упаковка: Шляпа Кота Кая (30 дней)">
            13119, //Упаковка: Крестик/Нолик (30 дней)">
            13120, //Упаковка: Камень/Ножницы/Бумага (30 дней)">
            13121, //Упаковка: Браслет Сиреневого Коня (7 дней)">
            13122, //Упаковка: Изменение Цвета Титула (3 шт.)">
            13124, //Упаковка: Изменение Цвета Титула (1 шт.)">
            13125, //Упаковка: Свиток Телепорта к Флагу (10 шт.)">
            13126, //Упаковка: Витамин - Ивент">
            13225, //Коробка: Билет в Камалоку (Зал Бездны) 15 шт.">
            13226, //Коробка: Билет в Земли Камалоки 15 шт.">
            13227, //Коробка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
            13228, //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт.">
            13229, //Упаковка: Билет в Земли Камалоки 15 шт.">
            13230, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
            13231, //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
            13232, //Упаковка: Билет в Земли Камалоки 5 шт.">
            13233, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
            13256, //Упаковка: Подарок Гран Каина">
            13257, //Упаковка: Подарок Гран Каина - Ивент">
            13275, //Упаковка: Купон на Ожерелье Питомца (3 шт.)">
            13276, //Упаковка: Купон на Ожерелье Питомца (1 шт.)">
            13279, //Упаковка: Благословенное Перо (1 шт.)">
            13291, //Упаковка: Крестик/Нолик (7 дней)">
            13292, //Упаковка: Камень/Ножницы/Бумага (7 дней)">
            13341, //Упаковка: Книга Телепорта к Флагу (1 шт.) - Ивент">
            13342, //Упаковка: Свиток Телепорта к Флагу (30 шт.) - Ивент">
            13343, //Упаковка: Благословенное Перо (3 шт.) - Ивент">
            13344, //Упаковка: Агатион Любви (30 дней) - Ивент">
            13345, //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дн.) - Ивент">
            13346, //Упаковка: Билет в Камалоку (3 шт.) - Ивент">
            13347, //Упаковка: Шляпа Кошки Кэт (30 дней) - Ивент">
            13348, //Упаковка: Шляпа Королевы Кошек (30 дней) - Ивент">
            13349, //Упаковка: Шляпа Монстроглаза (30 дней) - Ивент">
            13350, //Упаковка: Шляпа Бурого Медведя (30 дней) - Ивент">
            13351, //Упаковка: Шляпа Горного Гриба (30 дней) - Ивент">
            13352, //Упаковка: Маска Черепа (30 дней) - Ивент">
            13353, //Упаковка: Шляпа Орнитомима (30 дней) - Ивент">
            13354, //Упаковка: Шляпа Короля Кошек (30 дней) - Ивент">
            13355, //Упаковка: Шляпа Кота Кая (30 дней) - Ивент">
            13356, //Упаковка: Крестик/Нолик (30 дней) - Ивент">
            13357, //Упаковка: Камень/Ножницы/Бумага (30 дней) - Ивент">
            13358, //Упаковка: Сиреневый Конь (30 дней) - Ивент">
            13359, //Упаковка: Изменение Цвета Титула (3 шт.) - Ивент">
            13360, //Упаковка: Изменение Цвета Титула (1 шт.) - Ивент">
            13361, //Упаковка: Свиток Телепорта к Флагу (10 шт.) - Ивент">
            13362, //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт. - Ивент">
            13363, //Упаковка: Билет в Земли Камалоки 15 шт. - Ивент">
            13364, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт. - Ивент">
            13365, //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт. - Ивент">
            13366, //Упаковка: Билет в Земли Камалоки 5 шт. - Ивент">
            13367, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт. - Ивент">
            13368, //Упаковка: Благословенное Перо (1 шт.) - Ивент">
            13369, //Упаковка: Агатион Любви (7 дней) - Ивент">
            13370, //Упаковка: Жезл Трансформации в Праздничную Тыкву (7 дн.) - Ивент">
            13371, //Упаковка: Шляпа Кошки Кэт (7 дней) - Ивент">
            13372, //Упаковка: Шляпа Королевы Кошек (7 дней) - Ивент">
            13373, //Упаковка: Шляпа Монстроглаза (7 дней) - Ивент">
            13374, //Упаковка: Шляпа Бурого Медведя (7 дней) - Ивент">
            13375, //Упаковка: Шляпа Горного Гриба (7 дней) - Ивент">
            13376, //Упаковка: Маска Черепа (7 дней) - Ивент">
            13377, //Упаковка: Шляпа Орнитомима (7 дней) - Ивент">
            13378, //Упаковка: Шляпа Короля Кошек (7 дней) - Ивент">
            13379, //Упаковка: Шляпа Кота Кая (7 дней) - Ивент">
            13380, //Упаковка: Крестик, Нолик (7 дней) - Ивент">
            13381, //Упаковка: Камень/Ножницы/Бумага (7 дней) - Ивент">
            13384, //Упаковка: Купон на Ожерелье Питомца (3 шт.) - Ивент">
            13385, //Упаковка: Купон на Ожерелье Питомца (1 шт.) - Ивент">
            13799, //Мешок Древних Ценностей
            14228, //Упаковка: Агатион Гнева (30 дней)">
            14229, //Упаковка: Агатион Радости (30 дней)">
            14230, //Упаковка: Агатион Печали (30 дней)">
            14233, //Упаковка: Напиток Всплеска Энергии">
            14234, //Упаковка: Жезл Трансформации в Снеговика (30 дней)">
            14235, //Упаковка: Жезл Трансформации в Пугало (30 дней)">
            14236, //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней)">
            14237, //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней)">
            14238, //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней)">
            14239, //Упаковка: Купоны Обмена на Особого Питомца (2 шт.)">
            14240, //Упаковка: Браслет Златогривого Льва (7 дней) - Ивент">
            14241, //Упаковка: Браслет Парового Жука (7 дней) - Ивент">
            14242, //Упаковка: Напиток Всплеска Энергии - Ивент">
            14243, //Упаковка: Жезл Трансформации в Снеговика (30 дней) - Ивент">
            14244, //Упаковка: Жезл Трансформации в Пугало (30 дней) - Ивент">
            14245, //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней) - Ивент">
            14246, //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней) - Ивент">
            14247, //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней) - Ивент">
            14248, //Упаковка: Купон Обмена на Особого Питомца">
            14249, //Упаковка: Агатион Гнева (30 дней) - Ивент">
            14250, //Упаковка: Агатион Радости (30 дней) - Ивент">
            14251, //Упаковка: Агатион Печали (30 дней) - Ивент">
            14252, //Упаковка: Камень: Модифицировать Оружие (D) - Ивент">
            14253, //Упаковка: Камень: Модифицировать Оружие (С) - Ивент">
            14254, //Упаковка: Камень: Модифицировать Оружие (В) - Ивент">
            14255, //Упаковка: Камень: Модифицировать Оружие (А) - Ивент">
            14256, //Упаковка: Камень: Модифицировать Оружие (S) - Ивент">
            14257, //Упаковка: Камень: Модифицировать Доспех (D) - Ивент">
            14258, //Упаковка: Камень: Модифицировать Доспех (С) - Ивент">
            14259, //Упаковка: Камень: Модифицировать Доспех (В) - Ивент">
            14260, //Упаковка: Камень: Модифицировать Доспех (А) - Ивент">
            14261, //Упаковка: Камень: Модифицировать Доспех (S) - Ивент">
            14262, //Упаковка: Жезл Трансформации в Снеговика (7 дней)">
            14263, //Упаковка: Жезл Трансформации в Пугало (7 дней)">
            14264, //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней)">
            14265, //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней)">
            14266, //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней)">
            14270, //Упаковка: Жезл Трансформации в Снеговика (7 дней) - Ивент">
            14271, //Упаковка: Жезл Трансформации в Пугало (7 дней) - Ивент">
            14272, //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней) - Ивент">
            14273, //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней) - Ивент">
            14274, //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней) - Ивент">
            14275, //Упаковка: Агатион Гнева (7 дней) - Ивент">
            14276, //Упаковка: Агатион Радости (7 дней) - Ивент">
            14277, //Упаковка: Агатион Печали (7 дней) - Ивент">
            14278, //Упаковка: Камень: Модифицировать Оружие (D)">
            14279, //Упаковка: Камень: Модифицировать Оружие (С)">
            14280, //Упаковка: Камень: Модифицировать Оружие (В)">
            14281, //Упаковка: Камень: Модифицировать Оружие (А)">
            14282, //Упаковка: Камень: Модифицировать Оружие (S)">
            14283, //Упаковка: Камень: Модифицировать Доспех (D)">
            14284, //Упаковка: Камень: Модифицировать Доспех (С)">
            14285, //Упаковка: Камень: Модифицировать Доспех (В)">
            14286, //Упаковка: Камень: Модифицировать Доспех (А)">
            14287, //Упаковка: Камень: Модифицировать Доспех (S)">
            14288, //Упаковка: Напиток Всплеска Энергии (3 шт.)">
            14289, //Упаковка: Напиток Всплеска Энергии (3 шт.) - Ивент">
            14290, //Упаковка: Купоны Обмена на Особого Питомца (2 шт.) - Ивент">
            14291, //Упаковка: Купон Обмена на Особого Питомца - Ивент">
            14530, //Упаковка: Максвелл Хаус
            14639, //Ивент - Клеймор
            14640, //Ивент - Костолом
            14641, //Ивент - Молот Атубы
            14642, //Ивент - Посох Призрака
            14643, //Ивент - Посох Жизни
            14644, //Ивент - Булава Атубы
            14645, //Ивент - Мифриловый Кинжал
            14646, //Ивент - Шипованный Джамадхар
            14647, //Ивент - Легкий Лук
            14648, //Ивент - Глефа
            14649, //Ивент - Длинный Меч Эльфов
            14650, //Ивент - Длинный Меч Самурая
            14651, //Ивент - Посох Мертвеца
            14652, //Ивент - Посох Вурдалака
            14653, //Ивент - Посох Демона
            14654, //Ивент - Кристальный Кинжал
            14655, //Ивент - Большая Пата
            14656, //Ивент - Лук Превосходства
            14657, //Ивент - Секира Орков
            14658, //Ивент - Булава Якса
            14659, //Ивент - Клинок Берсерка
            14660, //Ивент - Меч Затмения
            14661, //Ивент - Топор Затмения
            14662, //Ивент - Молот Гномов
            14663, //Ивент - Катана*Катана
            14719, //Упаковка Энергии - Ивент
            14740, //Ивент - Упаковка Сохранения Коровы
            14768, //Подарочный Пакет для Одиноких
            15194, //Комплект Снаряжения Рыцаря - 10 дней
            15195, //Комплект Снаряжения Мага - 10 дней
            15196, //Комплект Снаряжения Воина - 10 дней
            15197, //Комплект Снаряжения Разбойника - 10 дней
            15198, //Комплект Снаряжения Камаэль - 10 дней
            15199, //Комплект Снаряжения Орка Воина - 10 дней
            15200, //Комплект Снаряжения Орка Шамана - 10 дней
            15201, //Комплект Снаряжения Рыцаря - 30 дней
            15202, //Комплект Снаряжения Мага - 30 дней
            15203, //Комплект Снаряжения Воина - 30 дней
            15204, //Комплект Снаряжения Разбойника - 30 дней
            15205, //Комплект Снаряжения Камаэль - 30 дней
            15206, //Комплект Снаряжения Орка Воина - 30 дней
            15207, //Комплект Снаряжения Орка Шамана - 30 дней
            15209, //Купон на Комплект Снаряжения (10 дн.)
            15212, //Купон на 1-ю Награду за Приглашение Друзей - Рекомендатель
            15213, //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
            15214, //Купон на 2-ю Награда за Приглашение Друзей - Рекомендатель
            15215, //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
            15216, //Купон на 1-ю Награду за Приглашение Друзей - Новичок
            15217, //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
            15218, //Купон на 2-ю Награду за Приглашение Друзей - Новичок
            15219, //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
            15222, //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 10 дней
            15223, //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы - 10 дней
            15224, //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 10 дней
            15225, //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 10 дней
            15226, //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 10 дней
            15227, //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 10 дней
            15228, //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 10 дней
            15229, //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 10 дней
            15230, //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 10 дней
            15231, //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 10 дней
            15232, //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 10 дней
            15233, //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 10 дней
            15234, //Комплект Магического Оружия - Артефакт Дружбы - 10 дней
            15235, //Комплект Кинжалов - Артефакт Дружбы - 10 дней
            15236, //Комплект Луков - Артефакт Дружбы - 10 дней
            15237, //Комплект Булав - Артефакт Дружбы - 10 дней
            15238, //Комплект Одноручными Мечами - Артефакт Дружбы - 10 дней
            15239, //Комплект Двуручных Мечей - Артефакт Дружбы - 10 дней
            15240, //Комплект Кастетов - Артефакт Дружбы - 10 дней
            15241, //Комплект Парных Мечей - Артефакт Дружбы - 10 дней
            15242, //Комплект Копий - Артефакт Дружбы - 10 дней
            15243, //Комплект Древних Мечей - Артефакт Дружбы - 10 дней
            15244, //Комплект Рапир - Артефакт Дружбы - 10 дней
            15245, //Комплект Арбалетов - Артефакт Дружбы - 10 дней
            15246, //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 30 дней
            15247, //Упаковка: Комплект Латных Доспехов - Артефакт Дружбы - 30 дней
            15248, //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 30 дней
            15249, //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 30 дней
            15250, //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 30 дней
            15251, //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 30 дней
            15252, //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 30 дней
            15253, //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 30 дней
            15254, //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 30 дней
            15255, //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 30 дней
            15256, //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 30 дней
            15257, //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 30 дней
            15258, //Комплект Магического Оружия - Артефакт Дружбы - 30 дней
            15259, //Комплект Кинжалов - Артефакт Дружбы - 30 дней
            15260, //Комплект Луков - Артефакт Дружбы - 30 дней
            15261, //Комплект Булав - Артефакт Дружбы - 30 дней
            15262, //Комплект Одноручных Мечей - Артефакт Дружбы - 30 дней
            15263, //Комплект Двуручных Мечей - Артефакт Дружбы - 30 дней
            15264, //Комплект Кастетов - Артефакт Дружбы - 30 дней
            15265, //Комплект Парных Мечей - Артефакт Дружбы - 30 дней
            15266, //Комплект Копий - Артефакт Дружбы - 30 дней
            15267, //Комплект Древних Мечей - Артефакт Дружбы - 30 дней
            15268, //Комплект Рапир - Артефакт Дружбы - 30 дней
            15269, //Комплект Арбалетов - Артефакт Дружбы - 30 дней
            15270, //Комплект Величия - Артефакт Дружбы - 10 дней
            15271, //Комплект Черного Снаряжения - Артефакт Дружбы - 10 дней
            15272, //Комплект Печати - Артефакт Дружбы - 10 дней
            15273, //Комплект Эльфов - Артефакт Дружбы - 10 дней
            15274, //Комплект Величия - Артефакт Дружбы - 30 дней
            15275, //Комплект Черного Снаряжения - Артефакт Дружбы - 30 дней
            15276, //Комплект Печати - Артефакт Дружбы - 30 дней
            15277, //Комплект Эльфов - Артефакт Дружбы - 30 дней
            15278, //Подарок Менеджера Витаминов
            15343, //Упаковка: Арфа перевоплощения в Морского Эльфа (60 Дн.)
            15345, //Упаковка: Арфа Перевоплощения в Морского Эльфа (60 Дн.) - Ивент
            15370, //Особый Подарочный Пакет на Праздник Ткачихи
            15371, //Подарочный Пакет на Праздник Ткачихи
            15373, //Подарочный Сверток на Праздник Ткачихи
            15374, //Особый Подарочный Пакет на Праздник Ткачихи - Ивент
            15375, //Подарочный Пакет на Праздник Ткачихи - Ивент
            15377, //Подарочный Сверток на Праздник Ткачихи - Ивент
            15378, //Подарочная Коробка на Праздник Ткачихи
            15404, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2003) - Ивент
            15405, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2004) - Ивент
            15406, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2005) - Ивент
            15407, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2006) - Ивент
            15408, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2007) - Ивент
            15409, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2008) - Ивент
            15410, //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2009) - Ивент
            15411, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2003) - Ивент
            15412, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2004) - Ивент
            15413, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2005) - Ивент
            15414, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2006) - Ивент
            15415, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2007) - Ивент
            15416, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2008) - Ивент
            15417, //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2009) - Ивент
            15425, //Сундук Сокровищ Героя - Ивент
            15454, //Упаковка: Блестящая Маска Инопланетянина X235 - Ивент
            15455, //Упаковка: Блестящая Маска Гиганта - Ивент
            15456, //Упаковка: Блестящая Маска Беззвучного Крика - Ивент
            15457, //Упаковка: Блестящая Маска Разгневанного Духа - Ивент
            15458, //Упаковка: Блестящая Маска Нетленного Трупа - Ивент
            15459, //Упаковка: Медовая Тыква Хэллоуина - Ивент
            15460, //Упаковка: Большая Тыква Хэллоуина - Ивент
            15462, //Большая Тыква Хэллоуина - Ивент
            15465, //Упаковка: Медовая Тыква Хэллоуина - Ивент - Ивент
            15466, //Упаковка: Большая Тыква Хэллоуина - Ивент - Ивент
            15468, //Большая Тыква Хэллоуина - Ивент - Ивент
            16383, //Упаковка: Новогодний Торт
            16384, //Упаковка: Большой Новогодний Торт
            16385, //Упаковка: Подарочная Коробка Плюшевого Медведя
            16386, //Упаковка: Подарочная Коробка Плюшевой Медведицы
            16387, //Упаковка: Новогодний Торт - Ивент
            16388, //Упаковка: Большой Новогодний Торт - Ивент
            16389, //Упаковка: Подарочная Коробка Плюшевого Медведя - Ивент
            16390, //Упаковка: Подарочная Коробка Плюшевой Медведицы - Ивент
            16391, //Коробка с Новогодним Тортом
            16392, //Коробка с Большим Новогодним Тортом
            16393, //Коробка с Новогодним Тортом - Ивент
            16394, //Коробка с Большим Новогодним Тортом - Ивент
            16395, //Подарочная Коробка Плюшевого Медведя
            16396, //Подарочная Коробка Плюшевой Медведицы
            16397, //Подарочная Коробка Плюшевого Медведя - Ивент
            16398, //Подарочная Коробка Плюшевой Медведицы - Ивент
            16852, //Коробка Сокровищ Героя
            16968, //Комплект Снаряжения Рыцаря - 90 дней
            16969, //Комплект Снаряжения Мага - 90 дней
            16970, //Комплект Снаряжения Воина - 90 дней
            16971, //Комплект Снаряжения Разбойника - 90 дней
            16972, //Комплект Снаряжения Камаэль - 90 дней
            16973, //Комплект Снаряжения Орка Воина - 90 дней
            16974, //Комплект Снаряжения Орка Шамана - 90 дней
            16975, //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы(Ранг A) - 90 дней
            16976, //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
            16977, //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
            16978, //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы(Ранг D) - 90 дней
            16979, //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
            16980, //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
            16981, //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
            16982, //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы(Ранг D) - 90 дней
            16983, //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
            16984, //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы(Ранг B) - 90 дней
            16985, //Упаковка: Комплект Туники Кармиана (Ранг C) - Артефакт Дружбы - 90 дней
            16986, //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы(Ранг D) - 90 дней
            16987, //Упаковка с Магическим Оружием - Артефакт Дружбы - 90 дней
            16988, //Упаковка с Кинжалом - Артефакт Дружбы - 90 дней
            16989, //Упаковка с Луком - Артефакт Дружбы - 90 дней
            16990, //Упаковка с Булавой - Артефакт Дружбы - 90 дней
            16991, //Упаковка с Одноручным Мечом - Артефакт Дружбы - 90 дней
            16992, //Упаковка с Двуручным Мечом - Артефакт Дружбы - 90 дней
            16993, //Упаковка с Кастетом - Артефакт Дружбы - 90 дней
            16994, //Упаковка с Парными Мечами - Артефакт Дружбы - 90 дней
            16995, //Упаковка с Копьем - Артефакт Дружбы - 90 дней
            16996, //Упаковка с Древним Мечом - Артефакт Дружбы - 90 дней
            16997, //Упаковка с Рапирой - Артефакт Дружбы - 90 дней
            16998, //Упаковка с Арбалетом - Артефакт Дружбы - 90 дней
            16999, //Комплект Величия (Ранг A) - Артефакт Дружбы - 90 дней
            17000, //Комплект Черного Снаряжения (Ранг B) - Артефакт Дружбы - 90 дней
            17001, //Комплект Печати (Ранг C) - Артефакт Дружбы - 90 дней
            17002, //Комплект Эльфов (Ранг D) - Артефакт Дружбы - 90 дней
            17019, //Упаковк: Браслеты Ездовых Питомцев 3 шт.
            17020, //Упаковка: Парное Молоко - Ивент
            17021, //Упаковка: Опыт Витаминов 30 - Ивент
            17022, //Упаковка: Знак Варка - Ивент
            17023, //Упаковка: Знак Кетра - Ивент
            17024, //Упаковка: Зелье Поддержания Энергии - Ивент
            17025, //Упаковка: Очки ПА (7000) - Ивент
            17026, //Упаковка: Шляпа Старшего Помощника - Ивент
            17027, //Упаковка: Соломенная Шляпа - Ивент
            17028, //Упаковка: Маска Фантома - Ивент
            17029, //Упаковка: Черная Маска Фантома - Ивент
            17031, //Упаковка: Белая Фрея
            17032, //Упаковка: Сундук с Сокровищами Героя
            17040, //Упаковка: Сундук Любви
            17041, //Упаковка: Сундук Сердцебиения
            17042, //Упаковка: Сундук Признания
            17043, //Упаковка: Сундук Радости
            17044, //Сундук Любви
            17045, //Сундук Сердцебиения
            17046, //Сундук Признания
            17047, //Сундук Радости
            17048, //Упаковка: Блестящий Браслет
            17066, //Ивент - Упаковка: Спаси Белого Тигра
            17082, //Упаковка: Книга Трансформации в Анаким
            17083, //Упаковка: Птичье Гнездо - Ивент
            17084, //Упаковка: Теневой Предмет - Шляпа Чародея - Телепорт
            17085, //Упаковка: Теневой Предмет - Шляпа Чародея - Большая Голова
            17086, //Упаковка: Теневой Предмет - Шляпа Чародея - Фейерверк
            17164, //Ивент - Упаковка: Энергия Ростка
            17165, //Ивент - Упаковка: Настойка Всплеска Энергии: 30 минут
            17166, //Упаковка: Усиливающий Камень Венеры (10 штук)
            17167, //Упаковка: Свиток: Модифицировать Оружие (S)
            17168, //Упаковка: Кодекс Гигантов - Мастерство
            17232, //Упаковка: Гасион с Мячом
            17233, //Упаковка: Родриэль с Мячом
            17234, //Упаковка: Пенальти
            17272, //Упаковка: Агатион Антарас
            17273, //Упаковка: Агатион Герольд Невитта Канна
            17274, //Упаковка: Агатион Хранитель Рассвета Калесин
            20045, //Упаковка: Очки в Роговой Оправе - Проворство
            20046, //Упаковка: Афроамериканский Парик
            20047, //Упаковка: Афроамериканский Парик - Большая Голова, Фейерверк
            20048, //Упаковка: Афроамериканский Парик - Легкая походка
            20049, //Упаковка: Форменнй Головной Убор
            20050, //Упаковка: Бамбуковая Шляпа
            20051, //Упаковка: Маска Мародеров
            20052, //Упаковка: Бантик
            20053, //Упаковка: Визоры
            20054, //Упаковка: Свиток Возвращения к Флагу
            20055, //Упаковка: Билет в Камалоку (Зал Бездны) 1 шт.
            20056, //Упаковка: Билет в Земли Камалоки 1 шт.
            20057, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 1 шт.
            20058, //Упаковка: Браслет Сиреневого Коня
            20062, //Упаковка: Флаг
            20079, //Упаковка: Мешки Удачи
            20080, //Упаковка: Четырехлистный Клевер
            20092, //Упаковка: Рождественские Чудеса
            20096, //Упаковка: Волшебные Одеяния - Ивент
            20179, //Упаковка: Билет в Земли Камалоки 5 шт.">
            20180, //Упаковка: Билет в Земли Камалоки 10 шт.">
            20181, //Упаковка: Свитки Возвращения к Флагу 5 шт.">
            20182, //Упаковка: Свитки Возвращения к Флагу 10ед.">
            20183, //Упаковка: Флаги 5ед.">
            20184, //Упаковка: Флаги 10ед.">
            20185, //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
            20186, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
            20187, //Упаковка: Билет в Камалоку (Зал Бездны) 10 шт.">
            20188, //Упаковка: Билет в Камалоку (Лабиринт Бездны) 10 шт.">
            20189, //Упаковка: Декорации Валентина - Премиум">
            20280, //Упаковка: Агатион Красный Сумоист">
            20281, //Упаковка: Агатион Красный Сумоист (7дн.) - Шепот Смерти">
            20282, //Упаковка: Агатион Синий Сумоист">
            20283, //Упаковка: Агатион Синий Сумоист (7дн.) - Дикая Магия">
            20284, //Упаковка: Агатион Сумоист Чемпион">
            20285, //Упаковка: Агатион Сумоист Чемпион (7дн.) - Большая Голова/Фейерверк">
            20286, //Упаковка: Агатион Плюшевый Медведь">
            20287, //Упаковка: Агатион Плюшевый Медведь (7 дн.) - Телепорт">
            20288, //Упаковка: Агатион Плюшевый Медведь (7дн.) - Воскрешение">
            20289, //Упаковка: Агатион Плюшевый Медведь (7дн.) - Энергия">
            20290, //Упаковка: Агатион Бог Богатства">
            20291, //Упаковка: Агатион Бог Богатства (7дн.) - Бог Богатства">
            20292, //Упаковка: Агатион Дриада">
            20293, //Упаковка: Агатион Священная Корова">
            20294, //Упаковка: Агатион Священная Корова (7дн.) - Священная Корова">
            20295, //Упаковка: Агатион Счастливая Корова">
            20296, //Упаковка: Агатион Счастливая Корова (7дн.) - Счастливая Корова">
            20314, //Упаковка: Праздничный Торт - Энергия">
            20315, //Упаковка: Очки">
            20316, //Упаковка: Шляпа Наполеона">
            20317, //Упаковка: Рожки">
            20318, //Упаковка: Маска из Черных Камней">
            20319, //Упаковка: Пластиковый Парик">
            20328, //Упаковка: Благословенные Заряды Духа Зверя">
            20331, //Большая Упаковка: Благословенные Заряды Духа Зверя">
            20397, //Упаковка Развития Новичка">
            20398, //Упаковка Быстрого Развития">
            20402, //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Тела">
            20403, //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Души">
            20404, //Упаковка: Шляпа Лэй Фэна">
            20450, //Упаковка: Агатион Майо (7 дн.)">
            20451, //Упаковка: Золотой Агатион (7 дн.)">
            20452, //Упаковка: Черный Агатион (7 дн.)">
            20453, //Упаковка: Агатион Питак (7 дн.)">
            20454, //Упаковка: Агатион Питак (7 дн.)">
            20455, //Упаковка: Агатион Питак (7 дн.)">
            20456, //Упаковка: Агатион Детеныш Панды (7дн.)">
            20457, //Упаковка: Агатион Панда Папа (7дн.)">
            20458, //Упаковка: Агатион Панда Мама (7дн.)">
            20459, //Упаковка: Очки в Роговой Оправе (7 дн.)">
            20460, //Упаковка: Афроамериканский Парик (7 дн.)">
            20461, //Упаковка: Афроамериканский Парик (7 дн.)">
            20462, //Упаковка: Форменный Головной Убор (7 дн.)">
            20463, //Упаковка: Бамбуковая Шляпа (7 дн.)">
            20464, //Упаковка: Маска Мародеров (7 дн.)">
            20465, //Упаковка: Бантик (7 дн.)">
            20466, //Упаковка: Визоры (7 дн.)">
            20467, //Упаковка: Шляпа Кошки Кэт (7 дн.)">
            20468, //Упаковка: Маска Черепа (7 дн.)">
            20469, //Упаковка: Афроамериканский Парик - Золотой (7 дн.)">
            20470, //Упаковка: Афроамериканский Парик - Розовый (7 дн.)">
            20471, //Упаковка: Очки (7 дн.)">
            20472, //Упаковка: Шляпа Наполеона (7 дн.)">
            20473, //Упаковка: Рожки (7 дн.)">
            20474, //Упаковка: Маска из Черных Камней (7 дн.)">
            20475, //Упаковка: Пластиковый Парик (7 дн.)">
            20476, //Упаковка: Заколка Маргаритка (7 дн.)">
            20477, //Упаковка: Заколка Незабудка (7 дн.)">
            20478, //Упаковка: Глазная Повязка Бандита (7 дн.)">
            20479, //Упаковка: Глазная Повязка Пирата (7 дн.)">
            20480, //Упаковка: Монокль (7 дн.)">
            20481, //Упаковка: Маска Духов (7 дн.)">
            20482, //Упаковка: Рога Демона (7 дн.)">
            20483, //Упаковка: Карнавальная Маска (7 дн.)">
            20484, //Упаковка: Красная Карнавальная Маска (7 дн.)">
            20485, //Упаковка: Кошачьи Ушки (7 дн.)">
            20486, //Упаковка: Заколка Леди (7 дн.)">
            20487, //Упаковка: Ушки Енота (7 дн.)">
            20488, //Упаковка: Ушки Кролика (7 дн.)">
            20489, //Упаковка: Крылышко Ангела (7 дн.)">
            20490, //Упаковка: Антенки Феи (7 дн.)">
            20491, //Упаковка: Украшенная Перьями Шляпа (7 дн.)">
            20492, //Упаковка: Защитные Очки Ремесленника (7 дн.)">
            20505, //Упаковка: Агатион Фомона">
            20506, //Упаковка: Агатион Фомона (7 дн.)">
            20507, //Упаковка: Почтение к Матери (24 ч.) - Ивент">
            20508, //Упаковка: Почтение к Матери (3 дн.)">
            20509, //Упаковка: Шляпа Королевы Кошек">
            20510, //Упаковка: Шляпа Короля Кошек">
            20511, //Упаковка: Шляпа Кота Кая">
            20512, //Упаковка: Браслет Златогривого Льва">
            20513, //Упаковка: Браслет Златогривого Льва - 30 дней">
            20514, //Упаковка: Браслет Парового Жука - 30 дней">
            20540, //Упаковка: Браслет Парового Жука (30дн.)">
            20541, //Упаковка: Браслет Златогривого Льва (30 дн.)">
            20542, //Упаковка: Афроамериканский Парик (7 дн.)">
            20543, //Упаковка: Очки в Роговой Оправе (7 дн.)">
            20544, //Упаковка: Бамбуковая Шляпа (7 дн.)">
            20548, //Упаковка: Руна Опыта 30% (5 ч.)">
            20549, //Упаковка: Руна Опыта 50% (5 ч.)">
            20550, //Упаковка: Руна Опыта 30% (10 ч.)">
            20551, //Упаковка: Руна Опыта 50% (10 ч.)">
            20552, //Упаковка: Руна Опыта 30% (7 дн.)">
            20553, //Упаковка: Руна Опыта 50% (7 дн.)">
            20554, //Упаковка: Руна SP 30% (5 ч.)">
            20555, //Упаковка: Руна SP 50% (5 ч.)">
            20556, //Упаковка: Руна SP 30% (10 ч.)">
            20557, //Упаковка: Руна SP 50% (10 ч.)">
            20558, //Упаковка: Руна SP 30% (7 дн.)">
            20559, //Упаковка: Руна SP 50% (7 дн.)">
            20560, //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
            20561, //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
            20562, //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
            20563, //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
            20564, //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
            20565, //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
            20566, //Упаковка: Руна Пера (24 ч.)">
            20574, //Свиток Мастера 2 - Ивент">
            20576, //Упаковка: Диадема Евы (3 дн.) - Ивент">
            20577, //Упаковка: Диадема Евы (7 дн.) - Ивент">
            20578, //Упаковка: Диадема Евы - Ивент">
            20579, //Упаковка: Руна Евы (5 ч.) - Ивент">
            20580, //Упаковка: Руна Евы (3 ч.) - Ивент">
            20581, //Упаковка: Руна Опыта 30% (3 ч.)">
            20587, //Упаковка: Агатион Вега">
            20588, //Упаковка: Агатион Вега (24 ч.) - Ужасающая Мощь">
            20589, //Упаковка: Агатион Вега (3 дн.) - Ужасающая Мощь">
            20590, //Упаковка: Браслет Любви (24 ч.) - Ивент">
            20598, //Упаковка: Посох Душ (7 дн.) - Танец Тени">
            20599, //Упаковка: Шляпа Серой Души (7 дн.) - Душа Феникса">
            20607, //Упаковка: Гарнитура - Тема: Город">
            20608, //Упаковка: Гарнитура - Тема: Герой">
            20609, //Упаковка: Гарнитура - Тема: Парк">
            20610, //Упаковка: Гарнитура (7 дн.) - Тема: Город. Сила души бессмертного Путешественника">
            20611, //Упаковка: Гарнитура (7 дн.) - Тема: Герой. Сила души могучего Воина">
            20612, //Упаковка: Гарнитура (7 дн.) - Тема: Парк. Сила мудрейшего Мистика">
            20619, //Упаковка: Агатион Вега (24 ч.) - Звук Свистка">
            20620, //Упаковка: Агатион Вега (3 дн.) - Звук Свистка">
            20623, //Упаковка: Благодать - Благовоние">
            20624, //Упаковка: Благовоние 100 ед.">
            20625, //Упаковка: Шляпа Серой Души (7 дн.) - Воскрешение">
            20627, //Упаковка: Браслет Любви (7 дн.)">
            20631, //Упаковка: Шляпа Арбуз (7 дн.)">
            20632, //Упаковка: Шляпа Арбуз">
            20635, //Упаковка: Снаряжение для Новичков (Без ранга)">
            20636, //Упаковка: Снаряжение для Воинов (Ранг D)">
            20637, //Упаковка: Снаряжение для Магов (Ранг D)">
            20638, //Упаковка: Поддержка Новичков">
            20680, //Упаковка: Агатион Чончон">
            20681, //Упаковка: Агатион Чончон на 7 дн. - Сила души отважного Воина">
            20682, //Упаковка: Агатион Бум">
            20683, //Упаковка: Агатион Бум на 7 дн. - Сила души великого Мистика">
            20684, //Упаковка: Агатион Танцующий ребенок">
            20685, //Упаковка: Агатион Танцующий ребенок на 7 дн. - Сила души выдающегося Путешественника">
            20686, //Упаковка: Агатион Древнего Героя">
            20687, //Упаковка: Агатион Древнего Героя на 7 дн. - Сила души великого Мистика">
            20688, //Упаковка: Агатион Утанка ">
            20689, //Упаковка: Агатион Утанка на 7 дн. - Сила души отважного Воина">
            20690, //Упаковка: Агатион Бонус В">
            20691, //Упаковка: Агатион Бонус В на 7 дн. - Сила души выдающегося Путешественника">
            20692, //Упаковка: Головной Убор Валькирии ">
            20693, //Упаковка: Головной Убор Валькирии 7 дн. - Сила души выдающегося Путешественника">
            20694, //Упаковка: Маска Тигра">
            20695, //Упаковка: Маска Тигра 7 дн. - Сила души отважного Воина">
            20696, //Упаковка: Ободок">
            20697, //Упаковка: Ободок на 7 дн. - Сила души великого Мистика">
            20698, //Упаковка: Шапка Детеныша Панды ">
            20699, //Упаковка: Шапка Детеныша Панды 7 дн. - Благ. Телепорт">
            20700, //Упаковка: Шапка Панды Папы ">
            20701, //Упаковка: Шапка Панды Папы 7дн. - Сила души выдающегося Путешественника">
            20702, //Упаковка: Шапка Панды Мамы ">
            20703, //Упаковка: Шапка Панды Мамы 7 дн. - Благ. Воскрешение">
            20704, //Упаковка: Головной Убор Стражника">
            20705, //Упаковка: Головной Убор Стражника 7 дн. - Инстинкт разрушения">
            20734, //Golden Jack O'Lantern Mask 7-Day Pack - Authority of Golden Jack O'Lantern Mask.">
            20735, //Упаковка: Агатион Мертвец">
            20736, //Упаковка: Агатион Мертвец (7 дн.) - Риск для Жизни">
            20737, //Упаковка: Агатион Синяя Птица">
            20738, //Упаковка: Агатион Птица">
            20740, //Упаковка: Коктейли">
            20753, //Коробка с Подарками Седобородого Деда Мороза">
            20754, //Коробка с Подарками Седобородого Деда Мороза - Большая">
            20773, //Подарок Рудольфа">
            20796, //Упаковка: Агатион Бог Войны (7 дн.) - Аура гнева">
            20797, //Упаковка: Агатион Богиня Милосердия (7 дн.) - Благословение Милосердия">
            20798, //Упаковка: Агатион Китайский Актер (7 дн.) - Меч Восстановления">
            20799, //Упаковка: Агатион Китайский Актер (7 дн.) - Водяной Меч">
            20800, //Упаковка: Агатион Китайская Актриса (7 дн.) - Копье Пламени">
            20801, //Упаковка: Агатион Китайские Актеры (7 дн.)">
            20802, //Упаковка: Агатион Китайские Актеры (7 дн.) - Меч Жизни">
            20803, //Упаковка: Агатион Чипао (7 дн.) - Легкость">
            20866, //Комплект Духовных Аватаров">
            20869, //Подарок к Новому Году">
            20898, //Упаковка: Фиолетовая Маска (7 дн.) - Благословение Души">
            20901, //Комплект Седобородого Деда Мороза">
            20902, //Упаковка: Кольцо Королевы Муравьев (7 дн.)">
            20946, //Упаковка: Реактивный Мотоцикл - 7 дн.">
            20947, //Упаковка: Реактивный Мотоцикл - 30 дн.">
            20948, //Упаковка: Агатион Феникс - 7 дн. - Нирвана">
            20949, //Упаковка: Агатион Феникс - 7 дн. - Очищение Феникса">
            20950, //Упаковка: Маска Лисы">
            20951, //Упаковка: Маска Лисы - 7 дн. - Тихие Шаги">
            20952, //Упаковка: Шляпа Пайван">
            20953, //Упаковка: Шляпа Пайван - 7 дн. - Сила Богов">
            20957, //Упаковка: Агатион Мертвец - 7 дн. - Прозрачность Души">
            20959, //Упаковка: Королевская Корона Венеры">
            20960, //Упаковка: Королевская Диадема Венеры">
            20961, //Упаковка: Диадема Дворянина">
            20962, //Упаковка: Королевская Корона Венеры (30 дн.)">
            20963, //Упаковка: Королевская Диадема Венеры (30 дн.)">
            20964, //Упаковка: Диадема Дворянина (30 дн.)">
            20965, //Упаковка: Королевская Корона Венеры">
            20966, //Упаковка: Королевская Диадема Венеры">
            20967, //Упаковка с Диадемой Дворянина">
            20969, //Упаковка: Агатион Бог Войны">
            20994, //Упаковка: Агатион Трехглавый Дракон - Легкая Походка">
            20995, //Упаковка: Маска Пекинской Оперы (Юэ Фэй) - Эффект Добродетели, Дух Трех Государств">
            20996, //Упаковка: Маска Пекинской Оперы (Гуань Юй) - Безмолвие Преданности, Дух Трех Государств">
            20997, //Упаковка: Маска Пекинской Оперы (Джань Фэй) - Энергия Алмаза, Дух Трех Государств">
            20998, //Упаковка: Шапка Дракона">
            20999, //Упаковка: Шапка Дракона (7 дн.) - Ускорение">
            21000, //Упаковка: Агатион Ловец Мячей Гносиан">
            21001, //Упаковка: Агатион Ловец Мячей Ородриэль">
            21002, //Упаковка: Агатион Штрафной Удар">
            21003, //Упаковка: Агатион Ловец Мячей Гносиан">
            21004, //Упаковка: Агатион Ловец Мячей Ородриэль">
            21005, //Упаковка: Агатион Штрафной Удар">
            21006, //Упаковка: Агатион Ловец Мячей Гносиан">
            21007, //Упаковка: Агатион Ловец Мячей Ородриэль">
            21008, //Упаковка: Агатион Штрафной Удар">
            21024, //Упаковка: Африканский Парик-Мяч (Белый)">
            21025, //Упаковка: Африканский Парик-Мяч (Синий)">
            21026, //Упаковка: Африканский Парик-Мяч (Красный) - Благословение Победы">
            21027, //Упаковка: Марка Победы (Корея)">
            21028, //Упаковка: Марка Победы (Япония)">
            21029, //Упаковка: Марка Поддержки">
            21063, //Упаковка: Национальная Шляпа (7 дн.)">
            21064, //Упаковка: Национальная Шляпа">
            21065, //Упаковка: Шапка Тигрицы-Старушки">
            21066, //Упаковка: Шапка Пчелы-Труженицы">
            21067, //Упаковка: Агатион Тигрица-Старушка (7 дн.)">
            21068, //Упаковка: Агатион Тигрица-Старушка">
            21069, //Упаковка: Агатион Фея Цветов">
            21070, //Упаковка: Агатион Болельщица Ородриэль (7 дн.)">
            21071, //Упаковка: Агатион Болельщица Ородриэль">
            21072, //Упаковка: Агатион Болельщица Лана (7 дн.)">
            21073, //Упаковка: Агатион Болельщица Лана">
            21074, //Упаковка: Агатион Болельщица Наонин (7 дн.)">
            21075, //Упаковка: Агатион Болельщица Наонин">
            21076, //Упаковка: Агатион Болельщица Мортия (7 дн.)">
            21077, //Упаковка: Агатион Болельщица Мортия">
            21078, //Упаковка: Агатион Болельщица Каурин (7 дн.)">
            21079, //Упаковка: Агатион Болельщица Каурин">
            21080, //Упаковка: Агатион Болельщица Мерурил (7 дн.)">
            21081, //Упаковка: Агатион Болельщица Мерурил">
            21082, //Упаковка: Агатион Ханди (7 дн.)">
            21083, //Упаковка: Агатион Ханди">
            21085, //Упаковка: Руна Опыта 30% (1 ч.)">
            21087, //Упаковка: Руна SP 30% (1 ч.)">
            21089, //Упаковка: Реактивный Мотоцикл">
            21091, //Упаковка: Руна Опыта 50% (7 дн.)">
            21092, //Упаковка: Руна SP 50% (7 дн.)">
            21095, //Упаковка: Обруч Льда">
            21169, //Коробка с Подарком на веселый день рождения">
            21601, //Упаковка: Руна Опыта 30% (5 ч.)">
            21602, //Упаковка: Руна Опыта 50% (5 ч.)">
            21603, //Упаковка: Руна Опыта 30% (10 ч.)">
            21604, //Упаковка: Руна Опыта 50% (10 ч.)">
            21605, //Упаковка: Руна Опыта 30% (7 дней)">
            21606, //Упаковка: Руна Опыта 50% (7 дней)">
            21607, //Упаковка: Руна SP 30% (5 ч.)">
            21608, //Упаковка: Руна SP 50% (5 ч.)">
            21609, //Упаковка: Руна SP 30% (10 ч.)">
            21610, //Упаковка: Руна SP 50% (10 ч.)">
            21611, //Упаковка: Руна SP 30% (7 дн.)">
            21612, //Упаковка: Руна SP 50% (7 дн.)">
            21613, //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
            21614, //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
            21615, //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
            21616, //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
            21617, //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
            21618, //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
            21619, //Упаковка: Руна Пера (24 ч.)">
            21620, //Упаковка: Камень: Модифицировать Оружие (D)">
            21621, //Упаковка: Камень: Модифицировать Оружие (С)">
            21622, //Упаковка: Камень: Модифицировать Оружие (В)">
            21623, //Упаковка: Камень: Модифицировать Оружие (А)">
            21624, //Упаковка: Камень: Модифицировать Оружие (S)">
            21625, //Упаковка: Камень: Модифицировать Доспех (D)">
            21626, //Упаковка: Камень: Модифицировать Доспех (С)">
            21627, //Упаковка: Камень: Модифицировать Доспех (В)">
            21628, //Упаковка: Камень: Модифицировать Доспех (А)">
            21629, //Упаковка: Камень: Модифицировать Доспех (S)">
            21630, //Упаковка: Зелье Поддержания Энергии">
            21631, //Упаковка: Зелье Всплеска Энергии">
            21632, //Упаковка: Коктейль из Сладких Фруктов">
            21633, //Упаковка: Коктейль из Свежих Фруктов">
            21634, //Упаковка: Браслет Сиреневого Коня (7 дн.)">
            21635, //Упаковка: Браслет Сиреневого Коня (30 дн.)">
            21636, //Упаковка: Браслет Сиреневого Коня">
            21637, //Упаковка: Браслет Парового Жука (7 дн.)">
            21638, //Упаковка: Браслет Парового Жука (30 дн.)">
            21639, //Упаковка: Браслет Парового Жука">
            21640, //Упаковка: Браслет Златогривого Льва (30 дн.)">
            21641, //Упаковка: Браслет Златогривого Льва">
            21642, //Упаковка: Реактивный Мотоцикл (7 дн.)">
            21643, //Упаковка: Реактивный Мотоцикл (30 дн.)">
            21644, //Упаковка: Реактивный Мотоцикл">
            21645, //Упаковка: Шляпа Наполеона (7 дн.) - Регенерация Маны">
            21646, //Упаковка: Шляпа Наполеона">
            21647, //Упаковка: Рожки (7 дн.) - Отражение Урона">
            21648, //Упаковка: Рожки">
            21649, //Упаковка: Маска из Черных Камней (7 дн.) - Энергия">
            21650, //Упаковка: Маска из Черных Камней">
            21651, //Упаковка: Пластиковый Парик (7 дн.) - Благ. Телепорт">
            21652, //Упаковка: Пластиковый Парик">
            21653, //Упаковка: Заколка Маргаритка (7 дн.) - Сопротивление Тьме">
            21654, //Упаковка: Заколка Маргаритка">
            21655, //Упаковка: Заколка Незабудка (7 дн.) - Легкая Походка">
            21656, //Упаковка: Заколка Незабудка">
            21657, //Упаковка: Глазная Повязка Бандита (7 дн.) - Шепот Смерти">
            21658, //Упаковка: Глазная Повязка Бандита">
            21659, //Упаковка: Глазная Повязка Пирата (7 дн.) - Проворство">
            21660, //Упаковка: Глазная Повязка Пирата">
            21661, //Упаковка: Монокль (7 дн.) - Дикая Магия">
            21662, //Упаковка: Монокль">
            21663, //Упаковка: Маска Духов (7 дн.) - Регенерация Маны">
            21664, //Упаковка: Маска Духов">
            21665, //Упаковка: Рога Демона (7 дн.) - Отражение Урона">
            21666, //Упаковка: Рога Демона">
            21667, //Упаковка: Карнавальная Маска (7 дн.) - Великое Лечение">
            21668, //Упаковка: Карнавальная Маска">
            21669, //Упаковка: Красная Карнавальная Маска (7 дн.) - Сопротивление Тьме">
            21670, //Упаковка: Красная Карнавальная Маска">
            21671, //Упаковка: Кошачьи Ушки (7 дн.) - Легкая Походка">
            21672, //Упаковка: Кошачьи Ушки">
            21673, //Упаковка: Заколка Леди (7 дн.) - Шепот Смерти">
            21674, //Упаковка: Заколка Леди">
            21675, //Упаковка: Ушки Енота (7 дн.) - Проворство">
            21676, //Упаковка: Ушки Енота">
            21677, //Упаковка: Ушки Кролика (7 дн.) - Дикая Магия">
            21678, //Упаковка: Ушки Кролика">
            21679, //Упаковка: Крылышко Ангела (7 дн.) - Регенерация Маны">
            21680, //Упаковка: Крылышко Ангела">
            21681, //Упаковка: Антенки Феи (7 дн.) - Отражение Урона">
            21682, //Упаковка: Антенки Феи">
            21683, //Упаковка: Украшенная Перьями Шляпа (7 дн.) - Великое Лечение">
            21684, //Упаковка: Украшенная Перьями Шляпа">
            21685, //Упаковка: Защитные Очки Ремесленника (7 дн.) - Энергия">
            21686, //Упаковка: Защитные Очки Ремесленника">
            22187, //Подарочная Коробка Радости Дня Рождения">
            30280, //Упаковка: Благословенные Заряды Духа - Ранг R">
            30278, //Упаковка: Заряды Духа - Ранг R">
            30277, //Большая Упаковка: Заряды Души - Ранг R">
            30276, //Упаковка: Заряды Души - Ранг R">
            33468, //Сундук Поддержки Героя">
            33493, //Ящик Поддержки Усиления Стихий">
            33495, //Сундук Оружия Реквиема - Обычный">
            33496, //Сундук Тяжелых Доспехов Бессмертия - Обычный">
            33497, //Сундук Легких Доспехов Бессмертия - Обычный">
            33498, //Сундук Магических Доспехов Бессмертия - Обычный">
            33499, //Сундук Аксессуаров Бессмертия - Обычный">
            35728, //Коробка поддержки героя Таути">
            35723, //Коробка оружия R95">
            35724, //Коробка брони R95">
            35725, //Коробка бижи R95">
            35726, //Коробка R95 остальное">
            35727, //Коробка материалов Семени Индустриализации">
            30279,

            //
            34927, // Синий Сундук Хранителя Мира
            34928, // Красный Сундук Хранителя Мира
            34929, // Золотистый Сундук Хранителя Мира
            34930, // Синий Сундук Странника Мира
            34931, // Красный Сундук Странника Мира
            34932, // Золотистый Сундук Странника Мира
            34855, // Сундук Реан

            32782, // Мешочек с оружием D
            32783, // Мешочек с оружием C
            32784, // Мешочек с оружием B
            32785, // Мешочек с оружием A
            32786, // Мешочек с оружием S
            32787, // мешок с оружием Р
            32788, // мешок с оружием Р95
            32789, // мешок с оружие Р99

            32797, // мешок с доспехом Р99
            32796, // мешок с доспехом Р95
            32795, // мешок с доспехом Р
            32794, // мешок с доспехом S
            32793, // мешок с доспехом A
            32792, // мешок с доспехом B
            32791, // мешок с доспехом C
            32790, // мешок с доспехом D

            32779,//Start Mazaffaka : Мешки с усилками
            32781,
            32780,
            34861,
            32240,
            32239,
            32238,
            32237,
            32236,
            32235,
            32234,
            32233,
            32232,
            32231,
            32230,
            32229,
            32242,
            32228, //Finish Mazaffaka : Мешки с усилками
            14767, //Корзина Конфет Белого Дня
            14766, //Большая Корзина Конфет Белого Дня
            14729, //Ивент - Кристальный Кубик
            20097, //Волшебные Одеяния - Ивент
            20629, //Сундук Любви - Ивент
            14638, //Огромный Наградной Сундук Битвы
            14637, //Большой Наградной Сундук Битвы
            14636, //Обычный Наградной Сундук Битвы
            14635, //Малый Наградной Сундук Битвы
            14677, //Новогодний Подарок: Агатион
            14676, //Новогодний Подарок: Агатион
            20277, //Настойка - Багет
            20271, //Наследие Багета
            20739, //Сундук со Свитками Трансформации
            13428, //Коробка: Напиток (1 шт.)
            13427, //Коробка: Напиток 2 шт.
            13426, //Коробка: Камень (1 шт.)
            13425, //Коробка: Свиток Телепорта (1 шт.
            13424, //Коробка: Напиток (3 шт.)
            13423, //Коробка: Камень (2 шт.)
            13422, //Коробка: Свиток Телепорта (2 шт.)
            10259, //Приз 6-го Класса	Ивент
            10258, //Приз 5-го Класса	Ивент
            10257, //Приз 4-го Класса	Ивент
            10256, //Приз 3-го Класса	Ивент
            10255, //Приз 2-го Класса	Ивент
            15376, //Особый Подарочный Сверток на Праздник Ткачихи - Ивент
            15372, //Особый Подарочный Сверток на Праздник Ткачихи
            8547, //Старая Коробка
            8551, //Коробка Группы Поддержки
            8570, //Коробка с Ивентовыми Подарками
            8571, //Коробка с Ивентовыми Подарками
            8572, //Коробка с Ивентовыми Подарками
            8573, //Коробка с Ивентовыми Подарками
            8574, //Коробка с Ивентовыми Подарками
            8575, //Коробка с Ивентовыми Подарками
            8966, //Коробка с Комплектом Предметов для Воителя (Без Ранга)
            8967, //Коробка с Комплектом Предметов для Воителя (D)
            8968, //Коробка с Комплектом Предметов для Воителя (C)
            8969, //Коробка с Комплектом Предметов для Воителя (B)
            8970, //Коробка с Комплектом Предметов для Воителя (A)
            8971, //Коробка с Комплектом Предметов для Воителя (S)
            9104, //Композитный Лук и Деревянная Стрела
            9105, //Гастрафет и Костяная Стрела
            9106, //Длинный Лук Аката и Стальная Стрела
            9107, //Длинный Лук Темных Эльфов и Серебряная Стрела
            9108, //Кровавый Лук и Мифриловая Стрела
            9109, //Пронзатель Душ и Мифриловая Стрела
            9110, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Без Ранга)
            9111, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Ранг D)
            9112, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Ранг C)
            9113, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Ранг B)
            9114, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Ранг A)
            9115, //Коробка с Комплектом Теневого Доспеха (Тяжелый Доспех, Ранг S)
            9116, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Без Ранга)
            9117, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Ранг D)
            9118, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Ранг C)
            9119, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Ранг B)
            9120, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Ранг A)
            9121, //Коробка с Комплектом Теневого Доспеха (Легкий Доспех, Ранг S)
            9122, //Коробка с Комплектом Теневого Доспеха (Мантия, Без Ранга)
            9123, //Коробка с Комплектом Теневого Доспеха (Мантия, Ранг D)
            9124, //Коробка с Комплектом Теневого Доспеха (Мантия, Ранг C)
            9125, //Коробка с Комплектом Теневого Доспеха (Мантия, Ранг B)
            9126, //Коробка с Комплектом Теневого Доспеха (Мантия, Ранг A)
            9127, //Коробка с Комплектом Теневого Доспеха (Мантия, Ранг S)
            9130, //Коробка с Комплектом Предметов (для Мага, Без Ранга)
            9131, //Коробка с Комплектом Предметов (для Мага, Ранг D)
            9132, //Коробка с Комплектом Предметов (для Мага, Ранг C)
            9133, //Коробка с Комплектом Предметов (для Мага, Ранг B)
            9134, //Коробка с Комплектом Предметов (для Мага, Ранг A)
            9135, //Коробка с Комплектом Предметов (для Мага, Ранг S
            9139, //Шапка Деда Мороза
            9142, //Апига
            9143, //Золотая Апига
            9144, //Добыча Пиратов
            10205, //Белое Семя Зла
            10206, //Черное Семя Зла
            10254, //Приз 1-го Класса
            21225, //Упаковка: Концентрированный Концентрированный Коктейль из Сладких Фруктов
            21226, //Упаковка: Концентрированный Коктейль из Сладких Фруктов	Ивент
            21229, //Упаковка: Концентрированный Коктейль из Свежих Фруктов
            21230, //Упаковка: Концентрированный Коктейль из Свежих Фруктов	Ивент
            21233, //Упаковка: Парное Молоко
            21234, //Упаковка: Парное Молоко	Ивент
            21237, //Упаковка: Превосходный Целебный Сок (НР)
            21238, //Упаковка: Превосходный Целебный Сок (НР)	Ивент
            21240, //Превосходный Целебный Сок (НР)	Ивент
            15434, //Коробка Игрушек Хэллоуина
            15435, //Сверкающая Коробка Игрушек Хэллоуина
            15437, //Коробка со Свитками Трансформации
            21421, //Упаковка: Изменение Цвета Титула
            21422, //Упаковка: Изменение Цвета Титула	Ивент
            21241, //Упаковка: Превосходный Целебный Сок (СР)

            22565, //	Упаковка: Снабжение Витаминами
            22566, //	Упаковка: Снабжение Зельями
            22567, //	Упаковка: Снабжение Предметами
            22568, //	Упаковка Развития
            22569, //	Упаковка Путешествий
            22570, //	Упаковка Судьбы
            22571, //	Сундук Агатиона
            22572, //	Упаковка: Заряды Души R (10 000)
            22573, //	Упаковка: Благ. Заряды Духа R (10 000)
            22574, //	Упаковка: Заряды Души R (3000)
            22575, //	Упаковка: Благ. Заряды Духа R (3000)
            22576, //	Упаковка: Чудесные Заряды Души S (10 000)
            22577, //	Упаковка: Чудесные Благ. Заряды Духа S (10 000)
            22578, //	Сундук Оружия C (30 дн.)
            22579, //	Сундук Оружия B (30 дн.)
            22580, //	Сундук Оружия A (30 дн.)
            22581, //	Сундук Оружия S (90 дн.)
            22582, //	Сундук Доспехов D (30 дн.)
            22583, //	Сундук Доспехов C (30 дн.)
            22584, //	Сундук Доспехов B (30 дн.)
            22585, //	Сундук Доспехов A (30 дн.)
            22586, //	Сундук Доспехов S (90 дн.)
            22587, //	Сундук Оружия D (30 дн.)
            22588, //	Энергия Ростка
            22589, //	Упаковка: Энергия Ростка (3 шт.)
            22590, //	Упаковка: Чудесные Заряды Души D (10 000)
            22591, //	Упаковка: Чудесные Заряды Души D (5000)
            22592, //	Упаковка: Чудесные Заряды Души C (10 000)
            22593, //	Упаковка: Чудесные Заряды Души C (5000)
            22594, //	Упаковка: Чудесные Заряды Души B (10 000)
            22595, //	Упаковка: Чудесные Заряды Души B (5000)
            22596, //	Упаковка: Чудесные Заряды Души A (10 000)
            22597, //	Упаковка: Чудесные Заряды Души A (5000)
            22598, //	Упаковка: Чудесные Заряды Духа D (10 000)
            22599, //	Упаковка: Чудесные Заряды Духа D (5000)
            22600, //	Упаковка: Чудесные Заряды Духа C (10 000)
            22601, //	Упаковка: Чудесные Заряды Духа C (5000)
            22602, //	Упаковка: Чудесные Заряды Духа B (10 000)
            22603, //	Упаковка: Чудесные Заряды Духа B (5000)
            22604, //	Упаковка: Чудесные Заряды Духа A (10 000)
            22605, //	Упаковка: Чудесные Заряды Духа A (5000)
            22606, //	Упаковка: Чудесные Заряды Духа S (10 000)
            22607, //	Упаковка: Чудесные Заряды Духа S (5000)
            22608, //	Упаковка: Зелье Поддержания Энергии 30 мин. (2 шт.)
            22609, //	Упаковка: Зелье Поддержания Энергии 30 мин. (4 шт.)
            22610, //	Наилучший Коктейль
            22612, //	Упаковка: Руна Опыта 30% (3 ч.)
            22613, //	Упаковка: Руна Опыта 30% (1 ч.)
            22614, //	Упаковка: Руна Опыта 50% (1 ч.)
            22615, //	Билет в Окрестности Камалоки
            22616, //	Комплект Величия - Артефакт Дружбы
            22617, //	Комплект Черного Снаряжения - Артефакт Дружбы
            22618, //	Комплект Печати - Артефакт Дружбы
            22619, //	Упаковка: Аксессуары Династии (Ранг S) - Артефакт Дружбы
    };

    @Override
    public int[] getItemIds() {
        return ITEM_IDS;
    }

    @Override
    protected boolean useItemImpl(Player player, ItemInstance item, boolean ctrl) {
        int itemId = item.getItemId();

        if (!canBeExtracted(player, item))
            return false;

        if (!useItem(player, item, 1))
            return false;

        switch (itemId) {
            case 8534:
                use8534(player, ctrl);
                break;
            case 8535:
                use8535(player, ctrl);
                break;
            case 8536:
                use8536(player, ctrl);
                break;
            case 8537:
                use8537(player, ctrl);
                break;
            case 8538:
                use8538(player, ctrl);
                break;
            case 8539:
                use8539(player, ctrl);
                break;
            case 8540:
                use8540(player, ctrl);
                break;
            case 5916:
                use5916(player, ctrl);
                break;
            case 5944:
                use5944(player, ctrl);
                break;
            case 14841:
                use14841(player, ctrl);
                break;
            case 5955:
                use5955(player, ctrl);
                break;
            case 14847:
                use14847(player, ctrl);
                break;
            case 5966:
                use5966(player, ctrl);
                break;
            case 5967:
                use5967(player, ctrl);
                break;
            case 5968:
                use5968(player, ctrl);
                break;
            case 5969:
                use5969(player, ctrl);
                break;
            case 6007:
                use6007(player, ctrl);
                break;
            case 6008:
                use6008(player, ctrl);
                break;
            case 6009:
                use6009(player, ctrl);
                break;
            case 6010:
                use6010(player, ctrl);
                break;
            case 7725:
                use7725(player, ctrl);
                break;
            case 7637:
                use7637(player, ctrl);
                break;
            case 7636:
                use7636(player, ctrl);
                break;
            case 7629:
                use7629(player, ctrl);
                break;
            case 7630:
                use7630(player, ctrl);
                break;
            case 7631:
                use7631(player, ctrl);
                break;
            case 7632:
                use7632(player, ctrl);
                break;
            case 7633:
                use7633(player, ctrl);
                break;
            case 7634:
                use7634(player, ctrl);
                break;
            case 7635:
                use7635(player, ctrl);
                break;
            case 10408:
                use10408(player, ctrl);
                break;
            case 10473:
                use10473(player, ctrl);
                break;
            case 9599:
                use9599(player, ctrl);
                break;
            case 20069:
                use20069(player, ctrl);
                break;
            case 20070:
                use20070(player, ctrl);
                break;
            case 20071:
                use20071(player, ctrl);
                break;
            case 20072:
                use20072(player, ctrl);
                break;
            case 20073:
                use20073(player, ctrl);
                break;
            case 20074:
                use20074(player, ctrl);
                break;
            case 20210:
                use20210(player, ctrl);
                break;
            case 20211:
                use20211(player, ctrl);
                break;
            case 20215:
                use20215(player, ctrl);
                break;
            case 20216:
                use20216(player, ctrl);
                break;
            case 20217:
                use20217(player, ctrl);
                break;
            case 20218:
                use20218(player, ctrl);
                break;
            case 20219:
                use20219(player, ctrl);
                break;
            case 20220:
                use20220(player, ctrl);
                break;
            case 20227:
                use20227(player, ctrl);
                break;
            case 20228:
                use20228(player, ctrl);
                break;
            case 20229:
                use20229(player, ctrl);
                break;
            case 20233:
                use20233(player, ctrl);
                break;
            case 20234:
                use20234(player, ctrl);
                break;
            case 20235:
                use20235(player, ctrl);
                break;
            case 20239:
                use20239(player, ctrl);
                break;
            case 20240:
                use20240(player, ctrl);
                break;
            case 20241:
                use20241(player, ctrl);
                break;
            case 20242:
                use20242(player, ctrl);
                break;
            case 20243:
                use20243(player, ctrl);
                break;
            case 20244:
                use20244(player, ctrl);
                break;
            case 20251:
                use20251(player, ctrl);
                break;
            case 20254:
                use20254(player, ctrl);
                break;
            case 20278:
                use20278(player, ctrl);
                break;
            case 20279:
                use20279(player, ctrl);
                break;
            case 20041:
                use20041(player, ctrl);
                break;
            case 20042:
                use20042(player, ctrl);
                break;
            case 20043:
                use20043(player, ctrl);
                break;
            case 20044:
                use20044(player, ctrl);
                break;
            case 20035:
                use20035(player, ctrl);
                break;
            case 20036:
                use20036(player, ctrl);
                break;
            case 20037:
                use20037(player, ctrl);
                break;
            case 20038:
                use20038(player, ctrl);
                break;
            case 20039:
                use20039(player, ctrl);
                break;
            case 20040:
                use20040(player, ctrl);
                break;
            case 20060:
                use20060(player, ctrl);
                break;
            case 20061:
                use20061(player, ctrl);
                break;
            case 22000:
                use22000(player, ctrl);
                break;
            case 22001:
                use22001(player, ctrl);
                break;
            case 22002:
                use22002(player, ctrl);
                break;
            case 22003:
                use22003(player, ctrl);
                break;
            case 22004:
                use22004(player, ctrl);
                break;
            case 22005:
                use22005(player, ctrl);
                break;
            case 20326:
                use20326(player, ctrl);
                break;
            case 20327:
                use20327(player, ctrl);
                break;
            case 20329:
                use20329(player, ctrl);
                break;
            case 20330:
                use20330(player, ctrl);
                break;
            case 20059:
                use20059(player, ctrl);
                break;
            case 20494:
                use20494(player, ctrl);
                break;
            case 20493:
                use20493(player, ctrl);
                break;
            case 20395:
                use20395(player, ctrl);
                break;
            case 13281:
                use13281(player, ctrl);
                break;
            case 13282:
                use13282(player, ctrl);
                break;
            case 13283:
                use13283(player, ctrl);
                break;
            case 13284:
                use13284(player, ctrl);
                break;
            case 13285:
                use13285(player, ctrl);
                break;
            case 13286:
                use13286(player, ctrl);
                break;
            case 13287:
                use13287(player, ctrl);
                break;
            case 13288:
                use13288(player, ctrl);
                break;
            case 13289:
                use13289(player, ctrl);
                break;
            case 13290:
                use13290(player, ctrl);
                break;
            case 14267:
                use14267(player, ctrl);
                break;
            case 14268:
                use14268(player, ctrl);
                break;
            case 14269:
                use14269(player, ctrl);
                break;
            case 13280:
                use13280(player, ctrl);
                break;
            case 22087:
                use22087(player, ctrl);
                break;
            case 22088:
                use22088(player, ctrl);
                break;
            case 13713:
                use13713(player, ctrl);
                break;
            case 13714:
                use13714(player, ctrl);
                break;
            case 13715:
                use13715(player, ctrl);
                break;
            case 13716:
                use13716(player, ctrl);
                break;
            case 13717:
                use13717(player, ctrl);
                break;
            case 13718:
                use13718(player, ctrl);
                break;
            case 13719:
                use13719(player, ctrl);
                break;
            case 13720:
                use13720(player, ctrl);
                break;
            case 13721:
                use13721(player, ctrl);
                break;
            case 14549:
                use14549(player, ctrl);
                break;
            case 14550:
                use14550(player, ctrl);
                break;
            case 14551:
                use14551(player, ctrl);
                break;
            case 14552:
                use14552(player, ctrl);
                break;
            case 14553:
                use14553(player, ctrl);
                break;
            case 14554:
                use14554(player, ctrl);
                break;
            case 14555:
                use14555(player, ctrl);
                break;
            case 14556:
                use14556(player, ctrl);
                break;
            case 14557:
                use14557(player, ctrl);
                break;
            case 13695:
                use13695(player, ctrl);
                break;
            case 13696:
                use13696(player, ctrl);
                break;
            case 13697:
                use13697(player, ctrl);
                break;
            case 13698:
                use13698(player, ctrl);
                break;
            case 13699:
                use13699(player, ctrl);
                break;
            case 13700:
                use13700(player, ctrl);
                break;
            case 13701:
                use13701(player, ctrl);
                break;
            case 13702:
                use13702(player, ctrl);
                break;
            case 13703:
                use13703(player, ctrl);
                break;
            case 14531:
                use14531(player, ctrl);
                break;
            case 14532:
                use14532(player, ctrl);
                break;
            case 14533:
                use14533(player, ctrl);
                break;
            case 14534:
                use14534(player, ctrl);
                break;
            case 14535:
                use14535(player, ctrl);
                break;
            case 14536:
                use14536(player, ctrl);
                break;
            case 14537:
                use14537(player, ctrl);
                break;
            case 14538:
                use14538(player, ctrl);
                break;
            case 14539:
                use14539(player, ctrl);
                break;
            case 13704:
                use13704(player, ctrl);
                break;
            case 13705:
                use13705(player, ctrl);
                break;
            case 13706:
                use13706(player, ctrl);
                break;
            case 13707:
                use13707(player, ctrl);
                break;
            case 13708:
                use13708(player, ctrl);
                break;
            case 13709:
                use13709(player, ctrl);
                break;
            case 13710:
                use13710(player, ctrl);
                break;
            case 13711:
                use13711(player, ctrl);
                break;
            case 13712:
                use13712(player, ctrl);
                break;
            case 14540:
                use14540(player, ctrl);
                break;
            case 14541:
                use14541(player, ctrl);
                break;
            case 14542:
                use14542(player, ctrl);
                break;
            case 14543:
                use14543(player, ctrl);
                break;
            case 14544:
                use14544(player, ctrl);
                break;
            case 14545:
                use14545(player, ctrl);
                break;
            case 14546:
                use14546(player, ctrl);
                break;
            case 14547:
                use14547(player, ctrl);
                break;
            case 14548:
                use14548(player, ctrl);
                break;
            case 14884:
                use14884(player, ctrl);
                break;
            case 14885:
                use14885(player, ctrl);
                break;
            case 14886:
                use14886(player, ctrl);
                break;
            case 14887:
                use14887(player, ctrl);
                break;
            case 14888:
                use14888(player, ctrl);
                break;
            case 14889:
                use14889(player, ctrl);
                break;
            case 14890:
                use14890(player, ctrl);
                break;
            case 14891:
                use14891(player, ctrl);
                break;
            case 14892:
                use14892(player, ctrl);
                break;
            case 14893:
                use14893(player, ctrl);
                break;
            case 14894:
                use14894(player, ctrl);
                break;
            case 14895:
                use14895(player, ctrl);
                break;
            case 14896:
                use14896(player, ctrl);
                break;
            case 14897:
                use14897(player, ctrl);
                break;
            case 14898:
                use14898(player, ctrl);
                break;
            case 14899:
                use14899(player, ctrl);
                break;
            case 14900:
                use14900(player, ctrl);
                break;
            case 14901:
                use14901(player, ctrl);
                break;
            case 14616:
                use14616(player, ctrl);
                break;
            case 20575:
                use20575(player, ctrl);
                break;
            case 20804:
                use20804(player, ctrl);
                break;
            case 20807:
                use20807(player, ctrl);
                break;
            case 20805:
                use20805(player, ctrl);
                break;
            case 20808:
                use20808(player, ctrl);
                break;
            case 20806:
                use20806(player, ctrl);
                break;
            case 20809:
                use20809(player, ctrl);
                break;
            case 20842:
                use20842(player, ctrl);
                break;
            case 20843:
                use20843(player, ctrl);
                break;
            case 20844:
                use20844(player, ctrl);
                break;
            case 20845:
                use20845(player, ctrl);
                break;
            case 20846:
                use20846(player, ctrl);
                break;
            case 20847:
                use20847(player, ctrl);
                break;
            case 20848:
                use20848(player, ctrl);
                break;
            case 20849:
                use20849(player, ctrl);
                break;
            case 20850:
                use20850(player, ctrl);
                break;
            case 20851:
                use20851(player, ctrl);
                break;
            case 20852:
                use20852(player, ctrl);
                break;
            case 20853:
                use20853(player, ctrl);
                break;
            case 20854:
                use20854(player, ctrl);
                break;
            case 20855:
                use20855(player, ctrl);
                break;
            case 20856:
                use20856(player, ctrl);
                break;
            case 20857:
                use20857(player, ctrl);
                break;
            case 20858:
                use20858(player, ctrl);
                break;
            case 20859:
                use20859(player, ctrl);
                break;
            case 20860:
                use20860(player, ctrl);
                break;
            case 20861:
                use20861(player, ctrl);
                break;
            case 20862:
                use20862(player, ctrl);
                break;
            case 20863:
                use20863(player, ctrl);
                break;
            case 20864:
                use20864(player, ctrl);
                break;
            case 20811:
                use20811(player, ctrl);
                break;
            case 20812:
                use20812(player, ctrl);
                break;
            case 20813:
                use20813(player, ctrl);
                break;
            case 20814:
                use20814(player, ctrl);
                break;
            case 20815:
                use20815(player, ctrl);
                break;
            case 20816:
                use20816(player, ctrl);
                break;
            case 20817:
                use20817(player, ctrl);
                break;
            case 20810:
                use20810(player, ctrl);
                break;
            case 20865:
                use20865(player, ctrl);
                break;
            case 20748:
                use20748(player, ctrl);
                break;
            case 20749:
                use20749(player, ctrl);
                break;
            case 20750:
                use20750(player, ctrl);
                break;
            case 20751:
                use20751(player, ctrl);
                break;
            case 20752:
                use20752(player, ctrl);
                break;
            case 20195:
                use20195(player, ctrl);
                break;
            case 20196:
                use20196(player, ctrl);
                break;
            case 20197:
                use20197(player, ctrl);
                break;
            case 20198:
                use20198(player, ctrl);
                break;
            case 13777:
                use13777(player, ctrl);
                break;
            case 13778:
                use13778(player, ctrl);
                break;
            case 13779:
                use13779(player, ctrl);
                break;
            case 13780:
                use13780(player, ctrl);
                break;
            case 13781:
                use13781(player, ctrl);
                break;
            case 13782:
                use13782(player, ctrl);
                break;
            case 13783:
                use13783(player, ctrl);
                break;
            case 13784:
                use13784(player, ctrl);
                break;
            case 13785:
                use13785(player, ctrl);
                break;
            case 13786:
                use13786(player, ctrl);
                break;
            case 14849:
                use14849(player, ctrl);
                break;
            case 14834:
                use14834(player, ctrl);
                break;
            case 14833:
                use14833(player, ctrl);
                break;
            case 13988:
                use13988(player, ctrl);
                break;
            case 13989:
                use13989(player, ctrl);
                break;
            case 13003:
                use13003(player, ctrl);
                break;
            case 13004:
                use13004(player, ctrl);
                break;
            case 13005:
                use13005(player, ctrl);
                break;
            case 13006:
                use13006(player, ctrl);
                break;
            case 13007:
                use13007(player, ctrl);
                break;
            case 13990:
                use13990(player, ctrl);
                break;
            case 13991:
                use13991(player, ctrl);
                break;
            case 13992:
                use13992(player, ctrl);
                break;
            case 14850:
                use14850(player, ctrl);
                break;
            case 14713:
                use14713(player, ctrl);
                break;
            case 14714:
                use14714(player, ctrl);
                break;
            case 14715:
                use14715(player, ctrl);
                break;
            case 14716:
                use14716(player, ctrl);
                break;
            case 14717:
                use14717(player, ctrl);
                break;
            case 14718:
                use14718(player, ctrl);
                break;
            case 17138:
                use17138(player, ctrl);
                break;
            case 15482:
                use15482(player, ctrl);
                break;
            case 15483:
                use15483(player, ctrl);
                break;
            case 13270:
                use13270(player, ctrl);
                break;
            case 13271:
                use13271(player, ctrl);
                break;
            case 13272:
                use13272(player, ctrl);
                break;
            case 14231:
                use14231(player, ctrl);
                break;
            case 14232:
                use14232(player, ctrl);
                break;
            case 21747:
                use21747(player, ctrl);
                break;
            case 21748:
                use21748(player, ctrl);
                break;
            case 21749:
                use21749(player, ctrl);
                break;
            case 17169:
                use17169(player, ctrl);
                break;
            case 21169:
                use21169(player, ctrl);
                break;
            case 21753:
                use21753(player, ctrl);
                break;
            case 21752:
                use21752(player, ctrl);
                break;
            case 30276:  // Soulshot Pack (R-Grade)
                use30276(player, ctrl);
                break;
            case 30277:  // Soulshot Large Pack (R-Grade)
                use30277(player, ctrl);
                break;
            case 30278:  // Spiritshot Pack (R-Grade)
                use30278(player, ctrl);
                break;
            case 30279:  // Spiritshot Large Pack (R-Grade)
                use30279(player, ctrl);
                break;
            case 30280:  // Blessed Spiritshot Pack (R-Grade)
                use30280(player, ctrl);
                break;
            case 30281:  // Blessed Spiritshot Large Pack (R-Grade)
                use30281(player, ctrl);
                break;
            case 30282:  // Orichalcum Quiver
                use30282(player, ctrl);
                break;
            case 30283:  // Orichalcum Bolt Container
                use30283(player, ctrl);
                break;
            case 30284:  // Requiem Weapon Box
                use30284(player, ctrl);
                break;
            case 30285:  // Immortal Heavy Armor Box
                use30285(player, ctrl);
                break;
            case 30286:  // Immortal Light Armor Box
                use30286(player, ctrl);
                break;
            case 30287:  // Immortal Robe Armor Box
                use30287(player, ctrl);
                break;
            case 30288:  // Apocalypse Weapon Box
                use30288(player, ctrl);
                break;
            case 30289:  // Twilight Heavy Armor Box
                use30289(player, ctrl);
                break;
            case 30290:  // Twilight Light Armor Box
                use30290(player, ctrl);
                break;
            case 30291:  // Twilight Robe Armor Box
                use30291(player, ctrl);
                break;
            case 30292:  // Immortal Accessory Box
                use30292(player, ctrl);
                break;
            case 30293: // Twilight Accessory Box
                use30293(player, ctrl);
                break;
            case 33465:
                use33465(player, ctrl);
                break;
            case 35728:
                use35728(player, ctrl);
                break;
            case 35723:
                use35723(player, ctrl);
                break;
            case 35724:
                use35724(player, ctrl);
                break;
            case 35725:
                use35725(player, ctrl);
                break;
            case 35726:
                use35726(player, ctrl);
                break;
            case 35727:
                use35727(player, ctrl);
                break;
            case 20101:
                use20101(player, ctrl);
                break;
            case 20102:
                use20102(player, ctrl);
                break;
            case 53:   //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Гнева
                use53(player, ctrl);
                break; //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Гнева
            case 54:   //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости.
                use54(player, ctrl);
                break; //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости.
            case 55:   //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости (7 дней)
                use55(player, ctrl);
                break; //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости (7 дней)
            case 56:
                use56(player, ctrl);
                break;
            case 136:
                use136(player, ctrl);
                break;
            case 137:
                use137(player, ctrl);
                break;
            case 138:
                use138(player, ctrl);
                break;
            case 139:
                use139(player, ctrl);
                break;
            case 140:
                use140(player, ctrl);
                break;
            case 141:
                use141(player, ctrl);
                break;
            case 163:
                use163(player, ctrl);
                break;
            case 170:
                use170(player, ctrl);
                break;
            case 5906:   //Красный Кристалл Души: Уровень 11
                use5906(player, ctrl);
                break; //Красный Кристалл Души: Уровень 11
            case 5907:   //Красный Кристалл Души: Уровень 11
                use5907(player, ctrl);
                break; //Красный Кристалл Души: Уровень 11
            case 5909:   //Красный Кристалл Души: Уровень 11
                use5909(player, ctrl);
                break; //Красный Кристалл Души: Уровень 11
            case 5910:   //Красный Кристалл Души: Уровень 11
                use5910(player, ctrl);
                break; //Красный Кристалл Души: Уровень 11
            case 5912:   //Красный Кристалл Души: Уровень 11
                use5912(player, ctrl);
                break; //Красный Кристалл Души: Уровень 11
            case 5913:   //Синий Кристалл Души: Уровень 12
                use5913(player, ctrl);
                break; //Синий Кристалл Души: Уровень 12
            case 13079:   //Упаковка: Книга Телепорта к Флагу (1 шт.)
                use13079(player, ctrl);
                break; //Упаковка: Книга Телепорта к Флагу (1 шт.)
            case 13080:   //Упаковка: Книга Телепорта к Флагу (30 шт.)
                use13080(player, ctrl);
                break; //Упаковка: Книга Телепорта к Флагу (30 шт.)
            case 13082:   //Упаковка: Благословенные Перья (3 шт.)
                use13082(player, ctrl);
                break; //Упаковка: Благословенные Перья (3 шт.)
            case 13083:   //Упаковка: Агатион Любви (30 дней)
                use13083(player, ctrl);
                break; //Упаковка: Агатион Любви (30 дней)
            case 13084:   //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
                use13084(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
            case 13085:   //Упаковка: Билет в Камалоку (3 шт.)
                use13085(player, ctrl);
                break; //Упаковка: Билет в Камалоку (3 шт.)
            case 13086:   //Упаковка: Шляпа Кошки Кэт (30 дней)
                use13086(player, ctrl);
                break; //Упаковка: Шляпа Кошки Кэт (30 дней)
            case 13087:   //Упаковка: Шляпа Королевы Кошек (30 дней)
                use13087(player, ctrl);
                break; //Упаковка: Шляпа Королевы Кошек (30 дней)
            case 13088:   //Упаковка: Шляпа Монстроглаза (30 дней)
                use13088(player, ctrl);
                break; //Упаковка: Шляпа Монстроглаза (30 дней)
            case 13089:   //Упаковка: Шляпа Бурого Медведя (30 дней)
                use13089(player, ctrl);
                break; //Упаковка: Шляпа Бурого Медведя (30 дней)
            case 13090:   //Упаковка: Шляпа Горного Гриба (30 дней)
                use13090(player, ctrl);
                break; //Упаковка: Шляпа Горного Гриба (30 дней)
            case 13091:   //Упаковка: Маска Черепа (30 дней)
                use13091(player, ctrl);
                break; //Упаковка: Маска Черепа (30 дней)
            case 13092:   //Упаковка: Шляпа Орнитомима (30 дней)
                use13092(player, ctrl);
                break; //Упаковка: Шляпа Орнитомима (30 дней)
            case 13093:   //Упаковка: Шляпа Короля Кошек (30 дней)
                use13093(player, ctrl);
                break; //Упаковка: Шляпа Короля Кошек (30 дней)
            case 13094:   //Упаковка: Шляпа Кота Кая (30 дней)
                use13094(player, ctrl);
                break; //Упаковка: Шляпа Кота Кая (30 дней)
            case 13095:   //Упаковка: Крестик/Нолик (30 дней)
                use13095(player, ctrl);   //Упаковка: Крестик/Нолик (30 дней)
            case 13096:   //Упаковка: Камень/Ножницы/Бумага (30 дней)
                use13096(player, ctrl);
                break; //Упаковка: Камень/Ножницы/Бумага (30 дней)
            case 13097:   //Упаковка: Браслет Сиреневого Коня
                use13097(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня
            case 13098:   //Упаковка: Изменение Цвета Титула (3 шт.)
                use13098(player, ctrl);
                break; //Упаковка: Изменение Цвета Титула (3 шт.)
            case 13103:   //Упаковка: Книга Телепорта к Флагу (1 шт.)
                use13103(player, ctrl);
                break; //Упаковка: Книга Телепорта к Флагу (1 шт.)
            case 13105:   //Упаковка: Билет в Камалоку (3 шт.)
                use13105(player, ctrl);
                break; //Упаковка: Билет в Камалоку (3 шт.)
            case 13104:   //Упаковка: Свиток Телепорта к Флагу (30 шт.)
                use13104(player, ctrl);
                break; //Упаковка: Свиток Телепорта к Флагу (30 шт.)
            case 13106:   //Упаковка: Благословенные Перья (3 шт.)
                use13106(player, ctrl);
                break; //Упаковка: Благословенные Перья (3 шт.)
            case 13107:   //Упаковка: Агатион Любви (30 дней)
                use13107(player, ctrl);
                break; //Упаковка: Агатион Любви (30 дней)
            case 13108:   //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
                use13108(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
            case 13109:   //Упаковка: Билет в Камалоку (3 шт.)
                use13109(player, ctrl);
                break; //Упаковка: Билет в Камалоку (3 шт.)
            case 13110:   //Упаковка: Шляпа Кошки Кэт (30 дней)
                use13110(player, ctrl);
                break; //Упаковка: Шляпа Кошки Кэт (30 дней)
            case 13111:   //Упаковка: Шляпа Королевы Кошек (30 дней)
                use13111(player, ctrl);
                break; //Упаковка: Шляпа Королевы Кошек (30 дней)
            case 13112:   //Упаковка: Шляпа Монстроглаза (30 дней)
                use13112(player, ctrl);
                break; //Упаковка: Шляпа Монстроглаза (30 дней)
            case 13113:   //Упаковка: Шляпа Бурого Медведя (30 дней)
                use13113(player, ctrl);
                break; //Упаковка: Шляпа Бурого Медведя (30 дней)
            case 13114:   //Упаковка: Шляпа Горного Гриба (30 дней)
                use13114(player, ctrl);
                break; //Упаковка: Шляпа Горного Гриба (30 дней)
            case 13115:
                use13115(player, ctrl);
                break;
            case 13116:   //Упаковка: Шляпа Орнитомима (30 дней)">
                use13116(player, ctrl);
                break; //Упаковка: Шляпа Орнитомима (30 дней)">
            case 13117:   //Упаковка: Шляпа Короля Кошек (30 дней)">
                use13117(player, ctrl);
                break; //Упаковка: Шляпа Короля Кошек (30 дней)">
            case 13118:   //Упаковка: Шляпа Кота Кая (30 дней)">
                use13118(player, ctrl);
                break; //Упаковка: Шляпа Кота Кая (30 дней)">
            case 13119:   //Упаковка: Крестик/Нолик (30 дней)">
                use13119(player, ctrl);
                break; //Упаковка: Крестик/Нолик (30 дней)">
            case 13120:   //Упаковка: Камень/Ножницы/Бумага (30 дней)">
                use13120(player, ctrl);
                break; //Упаковка: Камень/Ножницы/Бумага (30 дней)">
            case 13121:   //Упаковка: Браслет Сиреневого Коня (7 дней)">
                use13121(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня (7 дней)">
            case 13122:   //Упаковка: Изменение Цвета Титула (3 шт.)">
                use13122(player, ctrl);
                break; //Упаковка: Изменение Цвета Титула (3 шт.)">
            case 13124:   //Упаковка: Изменение Цвета Титула (1 шт.)">
                use13124(player, ctrl);
                break; //Упаковка: Изменение Цвета Титула (1 шт.)">
            case 13125:   //Упаковка: Свиток Телепорта к Флагу (10 шт.)">
                use13125(player, ctrl);
                break; //Упаковка: Свиток Телепорта к Флагу (10 шт.)">
            case 13126:   //Упаковка: Витамин - Ивент">
                use13126(player, ctrl);
                break; //Упаковка: Витамин - Ивент">
            case 13225:   //Коробка: Билет в Камалоку (Зал Бездны) 15 шт.">
                use13225(player, ctrl);
                break; //Коробка: Билет в Камалоку (Зал Бездны) 15 шт.">
            case 13226:   //Коробка: Билет в Земли Камалоки 15 шт.">
                use13226(player, ctrl);
                break; //Коробка: Билет в Земли Камалоки 15 шт.">
            case 13227:   //Коробка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
                use13227(player, ctrl);
                break; //Коробка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
            case 13228:   //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт.">
                use13228(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт.">
            case 13229:   //Упаковка: Билет в Земли Камалоки 15 шт.">
                use13229(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 15 шт.">
            case 13230:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
                use13230(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">
            case 13231:   //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
                use13231(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
            case 13232:   //Упаковка: Билет в Земли Камалоки 5 шт.">
                use13232(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 5 шт.">
            case 13233:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
                use13233(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
            case 13256:   //Упаковка: Подарок Гран Каина">
                use13256(player, ctrl);
                break; //Упаковка: Подарок Гран Каина">
            case 13257:   //Упаковка: Подарок Гран Каина - Ивент">
                use13257(player, ctrl);
                break; //Упаковка: Подарок Гран Каина - Ивент">
            case 13275:   //Упаковка: Купон на Ожерелье Питомца (3 шт.)">
                use13275(player, ctrl);
                break; //Упаковка: Купон на Ожерелье Питомца (3 шт.)">
            case 13276:   //Упаковка: Купон на Ожерелье Питомца (1 шт.)">
                use13276(player, ctrl);
                break; //Упаковка: Купон на Ожерелье Питомца (1 шт.)">
            case 13279:   //Упаковка: Благословенное Перо (1 шт.)">
                use13279(player, ctrl);
                break; //Упаковка: Благословенное Перо (1 шт.)">
            case 13291:   //Упаковка: Крестик/Нолик (7 дней)">
                use13291(player, ctrl);
                break; //Упаковка: Крестик/Нолик (7 дней)">
            case 13292:   //Упаковка: Камень/Ножницы/Бумага (7 дней)">
                use13292(player, ctrl);
                break; //Упаковка: Камень/Ножницы/Бумага (7 дней)">
            case 13341:   //Упаковка: Книга Телепорта к Флагу (1 шт.) - Ивент">
                use13341(player, ctrl);
                break; //Упаковка: Книга Телепорта к Флагу (1 шт.) - Ивент">
            case 13342:   //Упаковка: Свиток Телепорта к Флагу (30 шт.) - Ивент">
                use13342(player, ctrl);
                break; //Упаковка: Свиток Телепорта к Флагу (30 шт.) - Ивент">
            case 13343:   //Упаковка: Благословенное Перо (3 шт.) - Ивент">
                use13343(player, ctrl);
                break; //Упаковка: Благословенное Перо (3 шт.) - Ивент">
            case 13344:   //Упаковка: Агатион Любви (30 дней) - Ивент">
                use13344(player, ctrl);
                break; //Упаковка: Агатион Любви (30 дней) - Ивент">
            case 13345:   //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дн.) - Ивент">
                use13345(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дн.) - Ивент">
            case 13346:   //Упаковка: Билет в Камалоку (3 шт.) - Ивент">
                use13346(player, ctrl);
                break; //Упаковка: Билет в Камалоку (3 шт.) - Ивент">
            case 13347:   //Упаковка: Шляпа Кошки Кэт (30 дней) - Ивент">
                use13347(player, ctrl);
                break; //Упаковка: Шляпа Кошки Кэт (30 дней) - Ивент">
            case 13348:   //Упаковка: Шляпа Королевы Кошек (30 дней) - Ивент">
                use13348(player, ctrl);
                break; //Упаковка: Шляпа Королевы Кошек (30 дней) - Ивент">
            case 13349:   //Упаковка: Шляпа Монстроглаза (30 дней) - Ивент">
                use13349(player, ctrl);
                break; //Упаковка: Шляпа Монстроглаза (30 дней) - Ивент">
            case 13350:   //Упаковка: Шляпа Бурого Медведя (30 дней) - Ивент">
                use13350(player, ctrl);
                break; //Упаковка: Шляпа Бурого Медведя (30 дней) - Ивент">
            case 13351:   //Упаковка: Шляпа Горного Гриба (30 дней) - Ивент">
                use13351(player, ctrl);
                break; //Упаковка: Шляпа Горного Гриба (30 дней) - Ивент">
            case 13352:   //Упаковка: Маска Черепа (30 дней) - Ивент">
                use13352(player, ctrl);
                break; //Упаковка: Маска Черепа (30 дней) - Ивент">
            case 13353:   //Упаковка: Шляпа Орнитомима (30 дней) - Ивент">
                use13353(player, ctrl);
                break; //Упаковка: Шляпа Орнитомима (30 дней) - Ивент">
            case 13354:   //Упаковка: Шляпа Короля Кошек (30 дней) - Ивент">
                use13354(player, ctrl);
                break; //Упаковка: Шляпа Короля Кошек (30 дней) - Ивент">
            case 13355:   //Упаковка: Шляпа Кота Кая (30 дней) - Ивент">
                use13355(player, ctrl);
                break; //Упаковка: Шляпа Кота Кая (30 дней) - Ивент">
            case 13356:   //Упаковка: Крестик/Нолик (30 дней) - Ивент">
                use13356(player, ctrl);
                break; //Упаковка: Крестик/Нолик (30 дней) - Ивент">
            case 13357:   //Упаковка: Камень/Ножницы/Бумага (30 дней) - Ивент">
                use13357(player, ctrl);
                break; //Упаковка: Камень/Ножницы/Бумага (30 дней) - Ивент">
            case 13358:   //Упаковка: Сиреневый Конь (30 дней) - Ивент">
                use13358(player, ctrl);
                break; //Упаковка: Сиреневый Конь (30 дней) - Ивент">
            case 13359:   //Упаковка: Изменение Цвета Титула (3 шт.) - Ивент">
                use13359(player, ctrl);
                break; //Упаковка: Изменение Цвета Титула (3 шт.) - Ивент">
            case 13360:   //Упаковка: Изменение Цвета Титула (1 шт.) - Ивент">
                use13360(player, ctrl);
                break; //Упаковка: Изменение Цвета Титула (1 шт.) - Ивент">
            case 13361:   //Упаковка: Свиток Телепорта к Флагу (10 шт.) - Ивент">
                use13361(player, ctrl);
                break; //Упаковка: Свиток Телепорта к Флагу (10 шт.) - Ивент">
            case 13362:   //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт. - Ивент">
                use13362(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт. - Ивент">
            case 13363:   //Упаковка: Билет в Земли Камалоки 15 шт. - Ивент">
                use13363(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 15 шт. - Ивент">
            case 13364:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт. - Ивент">
                use13364(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт. - Ивент">
            case 13365:   //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт. - Ивент">
                use13365(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт. - Ивент">
            case 13366:   //Упаковка: Билет в Земли Камалоки 5 шт. - Ивент">
                use13366(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 5 шт. - Ивент">
            case 13367:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт. - Ивент">
                use13367(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт. - Ивент">
            case 13368:   //Упаковка: Благословенное Перо (1 шт.) - Ивент">
                use13368(player, ctrl);
                break; //Упаковка: Благословенное Перо (1 шт.) - Ивент">
            case 13369:   //Упаковка: Агатион Любви (7 дней) - Ивент">
                use13369(player, ctrl);
                break; //Упаковка: Агатион Любви (7 дней) - Ивент">
            case 13370:   //Упаковка: Жезл Трансформации в Праздничную Тыкву (7 дн.) - Ивент">
                use13370(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Праздничную Тыкву (7 дн.) - Ивент">
            case 13371:   //Упаковка: Шляпа Кошки Кэт (7 дней) - Ивент">
                use13371(player, ctrl);
                break; //Упаковка: Шляпа Кошки Кэт (7 дней) - Ивент">
            case 13372:   //Упаковка: Шляпа Королевы Кошек (7 дней) - Ивент">
                use13372(player, ctrl);
                break; //Упаковка: Шляпа Королевы Кошек (7 дней) - Ивент">
            case 13373:   //Упаковка: Шляпа Монстроглаза (7 дней) - Ивент">
                use13373(player, ctrl);
                break; //Упаковка: Шляпа Монстроглаза (7 дней) - Ивент">
            case 13374:   //Упаковка: Шляпа Бурого Медведя (7 дней) - Ивент">
                use13374(player, ctrl);
                break; //Упаковка: Шляпа Бурого Медведя (7 дней) - Ивент">
            case 13375:   //Упаковка: Шляпа Горного Гриба (7 дней) - Ивент">
                use13375(player, ctrl);
                break; //Упаковка: Шляпа Горного Гриба (7 дней) - Ивент">
            case 13376:   //Упаковка: Маска Черепа (7 дней) - Ивент">
                use13376(player, ctrl);
                break; //Упаковка: Маска Черепа (7 дней) - Ивент">
            case 13377:   //Упаковка: Шляпа Орнитомима (7 дней) - Ивент">
                use13377(player, ctrl);
                break; //Упаковка: Шляпа Орнитомима (7 дней) - Ивент">
            case 13378:   //Упаковка: Шляпа Короля Кошек (7 дней) - Ивент">
                use13378(player, ctrl);
                break; //Упаковка: Шляпа Короля Кошек (7 дней) - Ивент">
            case 13379:   //Упаковка: Шляпа Кота Кая (7 дней) - Ивент">
                use13379(player, ctrl);
                break; //Упаковка: Шляпа Кота Кая (7 дней) - Ивент">
            case 13380:   //Упаковка: Крестик, Нолик (7 дней) - Ивент">
                use13380(player, ctrl);
                break; //Упаковка: Крестик, Нолик (7 дней) - Ивент">
            case 13381:   //Упаковка: Камень/Ножницы/Бумага (7 дней) - Ивент">
                use13381(player, ctrl);
                break; //Упаковка: Камень/Ножницы/Бумага (7 дней) - Ивент">
            case 13384:   //Упаковка: Купон на Ожерелье Питомца (3 шт.) - Ивент">
                use13384(player, ctrl);
                break; //Упаковка: Купон на Ожерелье Питомца (3 шт.) - Ивент">
            case 13385:   //Упаковка: Купон на Ожерелье Питомца (1 шт.) - Ивент">
                use13385(player, ctrl);
                break; //Упаковка: Купон на Ожерелье Питомца (1 шт.) - Ивент">
            case 13799:   //Мешок Древних Ценностей
                use13799(player, ctrl);
                break; //Мешок Древних Ценностей
            case 14228:   //Упаковка: Агатион Гнева (30 дней)">
                use14228(player, ctrl);
                break; //Упаковка: Агатион Гнева (30 дней)">
            case 14229:   //Упаковка: Агатион Радости (30 дней)">
                use14229(player, ctrl);
                break; //Упаковка: Агатион Радости (30 дней)">
            case 14230:   //Упаковка: Агатион Печали (30 дней)">
                use14230(player, ctrl);
                break; //Упаковка: Агатион Печали (30 дней)">
            case 14233:   //Упаковка: Напиток Всплеска Энергии">
                use14233(player, ctrl);
                break; //Упаковка: Напиток Всплеска Энергии">
            case 14234:   //Упаковка: Жезл Трансформации в Снеговика (30 дней)">
                // 			use14234(player, ctrl); break; //Упаковка: Жезл Трансформации в Снеговика (30 дней)">
            case 14235:   //Упаковка: Жезл Трансформации в Пугало (30 дней)">
                use14235(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Пугало (30 дней)">
            case 14236:   //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней)">
                use14236(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней)">
            case 14237:   //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней)">
                use14237(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней)">
            case 14238:   //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней)">
                use14238(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней)">
            case 14239:   //Упаковка: Купоны Обмена на Особого Питомца (2 шт.)">
                use14239(player, ctrl);
                break; //Упаковка: Купоны Обмена на Особого Питомца (2 шт.)">
            case 14240:   //Упаковка: Браслет Златогривого Льва (7 дней) - Ивент">
                use14240(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва (7 дней) - Ивент">
            case 14241:   //Упаковка: Браслет Парового Жука (7 дней) - Ивент">
                use14241(player, ctrl);
                break; //Упаковка: Браслет Парового Жука (7 дней) - Ивент">
            case 14242:   //Упаковка: Напиток Всплеска Энергии - Ивент">
                use14242(player, ctrl);
                break; //Упаковка: Напиток Всплеска Энергии - Ивент">
            case 14243:   //Упаковка: Жезл Трансформации в Снеговика (30 дней) - Ивент">
                use14243(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Снеговика (30 дней) - Ивент">
            case 14244:   //Упаковка: Жезл Трансформации в Пугало (30 дней) - Ивент">
                use14244(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Пугало (30 дней) - Ивент">
            case 14245:   //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней) - Ивент">
                use14245(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней) - Ивент">
            case 14246:   //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней) - Ивент">
                use14246(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней) - Ивент">
            case 14247:   //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней) - Ивент">
                use14247(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней) - Ивент">
            case 14248:   //Упаковка: Купон Обмена на Особого Питомца">
                use14248(player, ctrl);
                break; //Упаковка: Купон Обмена на Особого Питомца">
            case 14249:   //Упаковка: Агатион Гнева (30 дней) - Ивент">
                use14249(player, ctrl);
                break; //Упаковка: Агатион Гнева (30 дней) - Ивент">
            case 14250:   //Упаковка: Агатион Радости (30 дней) - Ивент">
                use14250(player, ctrl);
                break; //Упаковка: Агатион Радости (30 дней) - Ивент">
            case 14251:   //Упаковка: Агатион Печали (30 дней) - Ивент">
                use14251(player, ctrl);
                break; //Упаковка: Агатион Печали (30 дней) - Ивент">
            case 14252:   //Упаковка: Камень: Модифицировать Оружие (D) - Ивент">
                use14252(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (D) - Ивент">
            case 14253:   //Упаковка: Камень: Модифицировать Оружие (С) - Ивент">
                use14253(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (С) - Ивент">
            case 14254:   //Упаковка: Камень: Модифицировать Оружие (В) - Ивент">
                use14254(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (В) - Ивент">
            case 14255:   //Упаковка: Камень: Модифицировать Оружие (А) - Ивент">
                use14255(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (А) - Ивент">
            case 14256:   //Упаковка: Камень: Модифицировать Оружие (S) - Ивент">
                use14256(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (S) - Ивент">
            case 14257:   //Упаковка: Камень: Модифицировать Доспех (D) - Ивент">
                use14257(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (D) - Ивент">
            case 14258:   //Упаковка: Камень: Модифицировать Доспех (С) - Ивент">
                use14258(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (С) - Ивент">
            case 14259:   //Упаковка: Камень: Модифицировать Доспех (В) - Ивент">
                use14259(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (В) - Ивент">
            case 14260:   //Упаковка: Камень: Модифицировать Доспех (А) - Ивент">
                use14260(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (А) - Ивент">
            case 14261:   //Упаковка: Камень: Модифицировать Доспех (S) - Ивент">
                use14261(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (S) - Ивент">
            case 14262:   //Упаковка: Жезл Трансформации в Снеговика (7 дней)">
                use14262(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Снеговика (7 дней)">
            case 14263:   //Упаковка: Жезл Трансформации в Пугало (7 дней)">
                use14263(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Пугало (7 дней)">
            case 14264:   //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней)">
                use14264(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней)">
            case 14265:   //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней)">
                use14265(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней)">
            case 14266:   //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней)">
                use14266(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней)">
            case 14270:   //Упаковка: Жезл Трансформации в Снеговика (7 дней) - Ивент">
                use14270(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Снеговика (7 дней) - Ивент">
            case 14271:   //Упаковка: Жезл Трансформации в Пугало (7 дней) - Ивент">
                use14271(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Пугало (7 дней) - Ивент">
            case 14272:   //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней) - Ивент">
                use14272(player, ctrl);
                break; //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней) - Ивент">
            case 14273:   //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней) - Ивент">
                use14273(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней) - Ивент">
            case 14274:   //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней) - Ивент">
                use14274(player, ctrl);
                break; //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней) - Ивент">
            case 14275:   //Упаковка: Агатион Гнева (7 дней) - Ивент">
                use14275(player, ctrl);
                break; //Упаковка: Агатион Гнева (7 дней) - Ивент">
            case 14276:   //Упаковка: Агатион Радости (7 дней) - Ивент">
                use14276(player, ctrl);
                break; //Упаковка: Агатион Радости (7 дней) - Ивент">
            case 14277:   //Упаковка: Агатион Печали (7 дней) - Ивент">
                use14277(player, ctrl);
                break; //Упаковка: Агатион Печали (7 дней) - Ивент">
            case 14278:   //Упаковка: Камень: Модифицировать Оружие (D)">
                use14278(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (D)">
            case 14279:   //Упаковка: Камень: Модифицировать Оружие (С)">
                use14279(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (С)">
            case 14280:   //Упаковка: Камень: Модифицировать Оружие (В)">
                use14280(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (В)">
            case 14281:   //Упаковка: Камень: Модифицировать Оружие (А)">
                use14281(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (А)">

            case 14282:   //Упаковка: Камень: Модифицировать Оружие (S)">
                use14282(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (S)">
            case 14283:   //Упаковка: Камень: Модифицировать Доспех (D)">
                use14283(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (D)">
            case 14284:   //Упаковка: Камень: Модифицировать Доспех (С)">
                use14284(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (С)">
            case 14285:   //Упаковка: Камень: Модифицировать Доспех (В)">
                use14285(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (В)">
            case 14286:   //Упаковка: Камень: Модифицировать Доспех (А)">
                use14286(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (А)">
            case 14287:   //Упаковка: Камень: Модифицировать Доспех (S)">
                use14287(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (S)">
            case 14288:   //Упаковка: Напиток Всплеска Энергии (3 шт.)">
                use14288(player, ctrl);
                break; //Упаковка: Напиток Всплеска Энергии (3 шт.)">
            case 14289:   //Упаковка: Напиток Всплеска Энергии (3 шт.) - Ивент">
                use14289(player, ctrl);
                break; //Упаковка: Напиток Всплеска Энергии (3 шт.) - Ивент">
            case 14290:   //Упаковка: Купоны Обмена на Особого Питомца (2 шт.) - Ивент">
                use14290(player, ctrl);
                break; //Упаковка: Купоны Обмена на Особого Питомца (2 шт.) - Ивент">
            case 14291:   //Упаковка: Купон Обмена на Особого Питомца - Ивент">
                use14291(player, ctrl);
                break; //Упаковка: Купон Обмена на Особого Питомца - Ивент">
            case 14530:   //Упаковка: Максвелл Хаус
                use14530(player, ctrl);
                break; //Упаковка: Максвелл Хаус
            case 14639:   //Ивент - Клеймор
                use14639(player, ctrl);
                break; //Ивент - Клеймор
            case 14640:   //Ивент - Костолом
                use14640(player, ctrl);
                break; //Ивент - Костолом
            case 14641:   //Ивент - Молот Атубы
                use14641(player, ctrl);
                break; //Ивент - Молот Атубы
            case 14642:   //Ивент - Посох Призрака
                use14642(player, ctrl);
                break; //Ивент - Посох Призрака
            case 14643:   //Ивент - Посох Жизни
                use14643(player, ctrl);
                break; //Ивент - Посох Жизни
            case 14644:   //Ивент - Булава Атубы
                use14644(player, ctrl);
                break; //Ивент - Булава Атубы
            case 14645:   //Ивент - Мифриловый Кинжал
                use14645(player, ctrl);
                break; //Ивент - Мифриловый Кинжал
            case 14646:   //Ивент - Шипованный Джамадхар
                use14646(player, ctrl);
                break; //Ивент - Шипованный Джамадхар
            case 14647:   //Ивент - Легкий Лук
                use14647(player, ctrl);
                break; //Ивент - Легкий Лук
            case 14648:   //Ивент - Глефа
                use14648(player, ctrl);
                break; //Ивент - Глефа
            case 14649:   //Ивент - Длинный Меч Эльфов
                use14649(player, ctrl);
                break; //Ивент - Длинный Меч Эльфов
            case 14650:   //Ивент - Длинный Меч Самурая
                use14650(player, ctrl);
                break; //Ивент - Длинный Меч Самурая
            case 14651:   //Ивент - Посох Мертвеца
                use14651(player, ctrl);
                break; //Ивент - Посох Мертвеца
            case 14652:   //Ивент - Посох Вурдалака
                use14652(player, ctrl);
                break; //Ивент - Посох Вурдалака
            case 14653:   //Ивент - Посох Демона
                use14653(player, ctrl);
                break; //Ивент - Посох Демона
            case 14654:   //Ивент - Кристальный Кинжал
                use14654(player, ctrl);
                break; //Ивент - Кристальный Кинжал
            case 14655:   //Ивент - Большая Пата
                use14655(player, ctrl);
                break; //Ивент - Большая Пата
            case 14656:   //Ивент - Лук Превосходства
                use14656(player, ctrl);
                break; //Ивент - Лук Превосходства
            case 14657:   //Ивент - Секира Орков
                use14657(player, ctrl);
                break; //Ивент - Секира Орков
            case 14658:   //Ивент - Булава Якса
                use14658(player, ctrl);
                break; //Ивент - Булава Якса
            case 14659:   //Ивент - Клинок Берсерка
                use14659(player, ctrl);
                break; //Ивент - Клинок Берсерка
            case 14660:   //Ивент - Меч Затмения
                use14660(player, ctrl);
                break; //Ивент - Меч Затмения
            case 14661:   //Ивент - Топор Затмения
                use14661(player, ctrl);
                break; //Ивент - Топор Затмения
            case 14662:   //Ивент - Молот Гномов
                use14662(player, ctrl);
                break; //Ивент - Молот Гномов
            case 14663:   //Ивент - Катана*Катана
                use14663(player, ctrl);
                break; //Ивент - Катана*Катана
            case 14719:   //Упаковка Энергии - Ивент
                use14719(player, ctrl);
                break; //Упаковка Энергии - Ивент
            case 14740:   //Ивент - Упаковка Сохранения Коровы
                use14740(player, ctrl);
                break; //Ивент - Упаковка Сохранения Коровы
            case 14768:   //Подарочный Пакет для Одиноких
                use14768(player, ctrl);
                break; //Подарочный Пакет для Одиноких
            case 15194:   //Комплект Снаряжения Рыцаря - 10 дней
                use15194(player, ctrl);
                break; //Комплект Снаряжения Рыцаря - 10 дней
            case 15195:   //Комплект Снаряжения Мага - 10 дней
                use15195(player, ctrl);
                break; //Комплект Снаряжения Мага - 10 дней
            case 15196:   //Комплект Снаряжения Воина - 10 дней
                use15196(player, ctrl);
                break; //Комплект Снаряжения Воина - 10 дней
            case 15197:   //Комплект Снаряжения Разбойника - 10 дней
                use15197(player, ctrl);
                break; //Комплект Снаряжения Разбойника - 10 дней
            case 15198:   //Комплект Снаряжения Камаэль - 10 дней
                use15198(player, ctrl);
                break; //Комплект Снаряжения Камаэль - 10 дней
            case 15199:   //Комплект Снаряжения Орка Воина - 10 дней
                use15199(player, ctrl);
                break; //Комплект Снаряжения Орка Воина - 10 дней
            case 15200:   //Комплект Снаряжения Орка Шамана - 10 дней
                use15200(player, ctrl);
                break; //Комплект Снаряжения Орка Шамана - 10 дней
            case 15201:   //Комплект Снаряжения Рыцаря - 30 дней
                use15201(player, ctrl);
                break; //Комплект Снаряжения Рыцаря - 30 дней
            case 15202:   //Комплект Снаряжения Мага - 30 дней
                use15202(player, ctrl);
                break; //Комплект Снаряжения Мага - 30 дней
            case 15203:   //Комплект Снаряжения Воина - 30 дней
                use15203(player, ctrl);
                break; //Комплект Снаряжения Воина - 30 дней
            case 15204:   //Комплект Снаряжения Разбойника - 30 дней
                use15204(player, ctrl);
                break; //Комплект Снаряжения Разбойника - 30 дней
            case 15205:   //Комплект Снаряжения Камаэль - 30 дней
                use15205(player, ctrl);
                break; //Комплект Снаряжения Камаэль - 30 дней
            case 15206:   //Комплект Снаряжения Орка Воина - 30 дней
                use15206(player, ctrl);
                break; //Комплект Снаряжения Орка Воина - 30 дней
            case 15207:   //Комплект Снаряжения Орка Шамана - 30 дней
                use15207(player, ctrl);
                break; //Комплект Снаряжения Орка Шамана - 30 дней
            case 15209:   //Купон на Комплект Снаряжения (10 дн.)
                use15209(player, ctrl);
                break; //Купон на Комплект Снаряжения (10 дн.)
            case 15212:   //Купон на 1-ю Награду за Приглашение Друзей - Рекомендатель
                use15212(player, ctrl);
                break; //Купон на 1-ю Награду за Приглашение Друзей - Рекомендатель
            case 15213:   //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
                use15213(player, ctrl);
                break; //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
            case 15214:   //Купон на 2-ю Награда за Приглашение Друзей - Рекомендатель
                use15214(player, ctrl);
                break; //Купон на 2-ю Награда за Приглашение Друзей - Рекомендатель
            case 15215:   //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
                use15215(player, ctrl);
                break; //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
            case 15216:   //Купон на 1-ю Награду за Приглашение Друзей - Новичок
                use15216(player, ctrl);
                break; //Купон на 1-ю Награду за Приглашение Друзей - Новичок
            case 15217:   //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
                use15217(player, ctrl);
                break; //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней

            case 15218:   //Купон на 2-ю Награду за Приглашение Друзей - Новичок
                use15218(player, ctrl);
                break; //Купон на 2-ю Награду за Приглашение Друзей - Новичок
            case 15219:   //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
                use15219(player, ctrl);
                break; //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
            case 15222:   //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 10 дней
                use15222(player, ctrl);
                break; //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 10 дней
            case 15223:   //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы - 10 дней
                use15223(player, ctrl);
                break; //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы - 10 дней
            case 15224:   //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 10 дней
                use15224(player, ctrl);
                break; //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 10 дней
            case 15225:   //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 10 дней
                use15225(player, ctrl);
                break; //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 10 дней
            case 15226:   //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 10 дней
                use15226(player, ctrl);
                break; //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 10 дней
            case 15227:   //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 10 дней
                use15227(player, ctrl);
                break; //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 10 дней
            case 15228:   //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 10 дней
                use15228(player, ctrl);
                break; //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 10 дней
            case 15229:   //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 10 дней
                use15229(player, ctrl);
                break; //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 10 дней
            case 15230:   //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 10 дней
                use15230(player, ctrl);
                break; //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 10 дней
            case 15231:   //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 10 дней
                use15231(player, ctrl);
                break; //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 10 дней
            case 15232:   //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 10 дней
                use15232(player, ctrl);
                break; //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 10 дней
            case 15233:   //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 10 дней
                use15233(player, ctrl);
                break; //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 10 дней
            case 15234:   //Комплект Магического Оружия - Артефакт Дружбы - 10 дней
                use15234(player, ctrl);
                break; //Комплект Магического Оружия - Артефакт Дружбы - 10 дней
            case 15235:   //Комплект Кинжалов - Артефакт Дружбы - 10 дней
                use15235(player, ctrl);
                break; //Комплект Кинжалов - Артефакт Дружбы - 10 дней
            case 15236:   //Комплект Луков - Артефакт Дружбы - 10 дней
                use15236(player, ctrl);
                break; //Комплект Луков - Артефакт Дружбы - 10 дней
            case 15237:   //Комплект Булав - Артефакт Дружбы - 10 дней
                use15237(player, ctrl);
                break; //Комплект Булав - Артефакт Дружбы - 10 дней
            case 15238:   //Комплект Одноручными Мечами - Артефакт Дружбы - 10 дней
                use15238(player, ctrl);
                break; //Комплект Одноручными Мечами - Артефакт Дружбы - 10 дней
            case 15239:   //Комплект Двуручных Мечей - Артефакт Дружбы - 10 дней
                use15239(player, ctrl);
                break; //Комплект Двуручных Мечей - Артефакт Дружбы - 10 дней
            case 15240:   //Комплект Кастетов - Артефакт Дружбы - 10 дней
                use15240(player, ctrl);
                break; //Комплект Кастетов - Артефакт Дружбы - 10 дней
            case 15241:   //Комплект Парных Мечей - Артефакт Дружбы - 10 дней
                use15241(player, ctrl);
                break; //Комплект Парных Мечей - Артефакт Дружбы - 10 дней
            case 15242:   //Комплект Копий - Артефакт Дружбы - 10 дней
                use15242(player, ctrl);
                break; //Комплект Копий - Артефакт Дружбы - 10 дней
            case 15243:   //Комплект Древних Мечей - Артефакт Дружбы - 10 дней
                use15243(player, ctrl);
                break; //Комплект Древних Мечей - Артефакт Дружбы - 10 дней
            case 15244:   //Комплект Рапир - Артефакт Дружбы - 10 дней
                use15244(player, ctrl);
                break; //Комплект Рапир - Артефакт Дружбы - 10 дней
            case 15245:   //Комплект Арбалетов - Артефакт Дружбы - 10 дней
                use15245(player, ctrl);
                break; //Комплект Арбалетов - Артефакт Дружбы - 10 дней
            case 15246:   //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 30 дней
                use15246(player, ctrl);
                break; //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 30 дней
            case 15247:   //Упаковка: Комплект Латных Доспехов - Артефакт Дружбы - 30 дней
                use15247(player, ctrl);
                break; //Упаковка: Комплект Латных Доспехов - Артефакт Дружбы - 30 дней
            case 15248:   //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 30 дней
                use15248(player, ctrl);
                break; //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 30 дней
            case 15249:   //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 30 дней
                use15249(player, ctrl);
                break; //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 30 дней
            case 15250:   //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 30 дней
                use15250(player, ctrl);
                break; //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 30 дней
            case 15251:   //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 30 дней
                use15251(player, ctrl);
                break; //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 30 дней
            case 15252:   //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 30 дней
                use15252(player, ctrl);
                break; //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 30 дней
            case 15253:   //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 30 дней
                use15253(player, ctrl);
                break; //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 30 дней
            case 15254:   //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 30 дней
                use15254(player, ctrl);
                break; //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 30 дней
            case 15255:   //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 30 дней
                use15255(player, ctrl);
                break; //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 30 дней
            case 15256:   //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 30 дней
                use15256(player, ctrl);
                break; //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 30 дней
            case 15257:   //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 30 дней
                use15257(player, ctrl);
                break; //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 30 дней
            case 15258:   //Комплект Магического Оружия - Артефакт Дружбы - 30 дней
                use15258(player, ctrl);
                break; //Комплект Магического Оружия - Артефакт Дружбы - 30 дней
            case 15259:   //Комплект Кинжалов - Артефакт Дружбы - 30 дней
                use15259(player, ctrl);
                break; //Комплект Кинжалов - Артефакт Дружбы - 30 дней
            case 15260:   //Комплект Луков - Артефакт Дружбы - 30 дней
                use15260(player, ctrl);
                break; //Комплект Луков - Артефакт Дружбы - 30 дней
            case 15261:   //Комплект Булав - Артефакт Дружбы - 30 дней
                use15261(player, ctrl);
                break; //Комплект Булав - Артефакт Дружбы - 30 дней
            case 15262:   //Комплект Одноручных Мечей - Артефакт Дружбы - 30 дней
                use15262(player, ctrl);
                break; //Комплект Одноручных Мечей - Артефакт Дружбы - 30 дней
            case 15263:   //Комплект Двуручных Мечей - Артефакт Дружбы - 30 дней
                use15263(player, ctrl);
                break; //Комплект Двуручных Мечей - Артефакт Дружбы - 30 дней
            case 15264:   //Комплект Кастетов - Артефакт Дружбы - 30 дней
                use15264(player, ctrl);
                break; //Комплект Кастетов - Артефакт Дружбы - 30 дней
            case 15265:   //Комплект Парных Мечей - Артефакт Дружбы - 30 дней
                use15265(player, ctrl);
                break; //Комплект Парных Мечей - Артефакт Дружбы - 30 дней
            case 15266:   //Комплект Копий - Артефакт Дружбы - 30 дней
                use15266(player, ctrl);
                break; //Комплект Копий - Артефакт Дружбы - 30 дней
            case 15267:   //Комплект Древних Мечей - Артефакт Дружбы - 30 дней
                use15267(player, ctrl);
                break; //Комплект Древних Мечей - Артефакт Дружбы - 30 дней
            case 15268:   //Комплект Рапир - Артефакт Дружбы - 30 дней
                use15268(player, ctrl);
                break; //Комплект Рапир - Артефакт Дружбы - 30 дней

            case 15269:   //Комплект Арбалетов - Артефакт Дружбы - 30 дней
                use15269(player, ctrl);
                break; //Комплект Арбалетов - Артефакт Дружбы - 30 дней
            case 15270:   //Комплект Величия - Артефакт Дружбы - 10 дней
                use15270(player, ctrl);
                break; //Комплект Величия - Артефакт Дружбы - 10 дней
            case 15271:   //Комплект Черного Снаряжения - Артефакт Дружбы - 10 дней
                use15271(player, ctrl);
                break; //Комплект Черного Снаряжения - Артефакт Дружбы - 10 дней
            case 15272:   //Комплект Печати - Артефакт Дружбы - 10 дней
                use15272(player, ctrl);
                break; //Комплект Печати - Артефакт Дружбы - 10 дней
            case 15273:   //Комплект Эльфов - Артефакт Дружбы - 10 дней
                use15273(player, ctrl);
                break; //Комплект Эльфов - Артефакт Дружбы - 10 дней
            case 15274:   //Комплект Величия - Артефакт Дружбы - 30 дней
                use15274(player, ctrl);
                break; //Комплект Величия - Артефакт Дружбы - 30 дней
            case 15275:   //Комплект Черного Снаряжения - Артефакт Дружбы - 30 дней
                use15275(player, ctrl);
                break; //Комплект Черного Снаряжения - Артефакт Дружбы - 30 дней
            case 15276:   //Комплект Печати - Артефакт Дружбы - 30 дней
                use15276(player, ctrl);
                break; //Комплект Печати - Артефакт Дружбы - 30 дней
            case 15277:   //Комплект Эльфов - Артефакт Дружбы - 30 дней
                use15277(player, ctrl);
                break; //Комплект Эльфов - Артефакт Дружбы - 30 дней
            case 15278:   //Подарок Менеджера Витаминов
                use15278(player, ctrl);
                break; //Подарок Менеджера Витаминов
            case 15343:   //Упаковка: Арфа перевоплощения в Морского Эльфа (60 Дн.)
                use15343(player, ctrl);
                break; //Упаковка: Арфа перевоплощения в Морского Эльфа (60 Дн.)
            case 15345:   //Упаковка: Арфа Перевоплощения в Морского Эльфа (60 Дн.) - Ивент
                use15345(player, ctrl);
                break; //Упаковка: Арфа Перевоплощения в Морского Эльфа (60 Дн.) - Ивент
            case 15370:   //Особый Подарочный Пакет на Праздник Ткачихи
                use15370(player, ctrl);
                break; //Особый Подарочный Пакет на Праздник Ткачихи
            case 15371:   //Подарочный Пакет на Праздник Ткачихи
                use15371(player, ctrl);
                break; //Подарочный Пакет на Праздник Ткачихи
            case 15373:   //Подарочный Сверток на Праздник Ткачихи
                use15373(player, ctrl);
                break; //Подарочный Сверток на Праздник Ткачихи
            case 15374:   //Особый Подарочный Пакет на Праздник Ткачихи - Ивент
                use15374(player, ctrl);
                break; //Особый Подарочный Пакет на Праздник Ткачихи - Ивент
            case 15375:   //Подарочный Пакет на Праздник Ткачихи - Ивент
                use15375(player, ctrl);
                break; //Подарочный Пакет на Праздник Ткачихи - Ивент
            case 15377:   //Подарочный Сверток на Праздник Ткачихи - Ивент
                use15377(player, ctrl);
                break; //Подарочный Сверток на Праздник Ткачихи - Ивент
            case 15378:   //Подарочная Коробка на Праздник Ткачихи
                use15378(player, ctrl);
                break; //Подарочная Коробка на Праздник Ткачихи
            case 15404:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2003) - Ивент
                use15404(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2003) - Ивент

            case 15405:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2004) - Ивент
                use15405(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2004) - Ивент
            case 15406:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2005) - Ивент
                use15406(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2005) - Ивент
            case 15407:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2006) - Ивент
                use15407(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2006) - Ивент
            case 15408:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2007) - Ивент
                use15408(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2007) - Ивент
            case 15409:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2008) - Ивент
                use15409(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2008) - Ивент
            case 15410:   //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2009) - Ивент
                use15410(player, ctrl);
                break; //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2009) - Ивент
            case 15411:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2003) - Ивент
                use15411(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2003) - Ивент
            case 15412:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2004) - Ивент
                use15412(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2004) - Ивент
            case 15413:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2005) - Ивент
                use15413(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2005) - Ивент
            case 15414:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2006) - Ивент
                use15414(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2006) - Ивент
            case 15415:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2007) - Ивент
                use15415(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2007) - Ивент
            case 15416:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2008) - Ивент
                use15416(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2008) - Ивент
            case 15417:   //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2009) - Ивент
                use15417(player, ctrl);
                break; //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2009) - Ивент
            case 15425:   //Сундук Сокровищ Героя - Ивент
                use15425(player, ctrl);
                break; //Сундук Сокровищ Героя - Ивент
            case 15454:   //Упаковка: Блестящая Маска Инопланетянина X235 - Ивент
                use15454(player, ctrl);
                break; //Упаковка: Блестящая Маска Инопланетянина X235 - Ивент
            case 15455:   //Упаковка: Блестящая Маска Гиганта - Ивент
                use15455(player, ctrl);
                break; //Упаковка: Блестящая Маска Гиганта - Ивент
            case 15456:   //Упаковка: Блестящая Маска Беззвучного Крика - Ивент
                use15456(player, ctrl);
                break; //Упаковка: Блестящая Маска Беззвучного Крика - Ивент
            case 15457:   //Упаковка: Блестящая Маска Разгневанного Духа - Ивент
                use15457(player, ctrl);
                break; //Упаковка: Блестящая Маска Разгневанного Духа - Ивент
            case 15458:   //Упаковка: Блестящая Маска Нетленного Трупа - Ивент
                use15458(player, ctrl);
                break; //Упаковка: Блестящая Маска Нетленного Трупа - Ивент
            case 15459:   //Упаковка: Медовая Тыква Хэллоуина - Ивент
                use15459(player, ctrl);
                break; //Упаковка: Медовая Тыква Хэллоуина - Ивент
            case 15460:   //Упаковка: Большая Тыква Хэллоуина - Ивент
                use15460(player, ctrl);
                break; //Упаковка: Большая Тыква Хэллоуина - Ивент
            case 15462:   //Большая Тыква Хэллоуина - Ивент
                use15462(player, ctrl);
                break; //Большая Тыква Хэллоуина - Ивент
            case 15465:   //Упаковка: Медовая Тыква Хэллоуина - Ивент - Ивент
                use15465(player, ctrl);
                break; //Упаковка: Медовая Тыква Хэллоуина - Ивент - Ивент
            case 15466:   //Упаковка: Большая Тыква Хэллоуина - Ивент - Ивент
                use15466(player, ctrl);
                break; //Упаковка: Большая Тыква Хэллоуина - Ивент - Ивент
            case 15468:   //Большая Тыква Хэллоуина - Ивент - Ивент
                use15468(player, ctrl);
                break; //Большая Тыква Хэллоуина - Ивент - Ивент
            case 16383:   //Упаковка: Новогодний Торт
                use16383(player, ctrl);
                break; //Упаковка: Новогодний Торт
            case 16384:   //Упаковка: Большой Новогодний Торт
                use16384(player, ctrl);
                break; //Упаковка: Большой Новогодний Торт
            case 16385:   //Упаковка: Подарочная Коробка Плюшевого Медведя
                use16385(player, ctrl);
                break; //Упаковка: Подарочная Коробка Плюшевого Медведя
            case 16386:   //Упаковка: Подарочная Коробка Плюшевой Медведицы
                use16386(player, ctrl);
                break; //Упаковка: Подарочная Коробка Плюшевой Медведицы
            case 16387:   //Упаковка: Новогодний Торт - Ивент
                use16387(player, ctrl);
                break; //Упаковка: Новогодний Торт - Ивент
            case 16388:   //Упаковка: Большой Новогодний Торт - Ивент
                use16388(player, ctrl);
                break; //Упаковка: Большой Новогодний Торт - Ивент
            case 16389:   //Упаковка: Подарочная Коробка Плюшевого Медведя - Ивент
                use16389(player, ctrl);
                break; //Упаковка: Подарочная Коробка Плюшевого Медведя - Ивент
            case 16390:   //Упаковка: Подарочная Коробка Плюшевой Медведицы - Ивент
                use16390(player, ctrl);
                break; //Упаковка: Подарочная Коробка Плюшевой Медведицы - Ивент
            case 16391:   //Коробка с Новогодним Тортом
                use16391(player, ctrl);
                break; //Коробка с Новогодним Тортом
            case 16392:   //Коробка с Большим Новогодним Тортом
                use16392(player, ctrl);
                break; //Коробка с Большим Новогодним Тортом
            case 16393:   //Коробка с Новогодним Тортом - Ивент
                use16393(player, ctrl);
                break; //Коробка с Новогодним Тортом - Ивент
            case 16394:   //Коробка с Большим Новогодним Тортом - Ивент
                use16394(player, ctrl);
                break; //Коробка с Большим Новогодним Тортом - Ивент
            case 16395:   //Подарочная Коробка Плюшевого Медведя
                use16395(player, ctrl);
                break; //Подарочная Коробка Плюшевого Медведя
            case 16396:   //Подарочная Коробка Плюшевой Медведицы
                use16396(player, ctrl);
                break; //Подарочная Коробка Плюшевой Медведицы
            case 16397:   //Подарочная Коробка Плюшевого Медведя - Ивент
                use16397(player, ctrl);
                break; //Подарочная Коробка Плюшевого Медведя - Ивент
            case 16398:   //Подарочная Коробка Плюшевой Медведицы - Ивент
                use16398(player, ctrl);
                break; //Подарочная Коробка Плюшевой Медведицы - Ивент
            case 16852:   //Коробка Сокровищ Героя
                use16852(player, ctrl);
                break; //Коробка Сокровищ Героя
            case 16968:   //Комплект Снаряжения Рыцаря - 90 дней
                use16968(player, ctrl);
                break; //Комплект Снаряжения Рыцаря - 90 дней
            case 16969:   //Комплект Снаряжения Мага - 90 дней
                use16969(player, ctrl);
                break; //Комплект Снаряжения Мага - 90 дней
            case 16970:   //Комплект Снаряжения Воина - 90 дней
                use16970(player, ctrl);
                break; //Комплект Снаряжения Воина - 90 дней
            case 16971:   //Комплект Снаряжения Разбойника - 90 дней
                use16971(player, ctrl);
                break; //Комплект Снаряжения Разбойника - 90 дней
            case 16972:   //Комплект Снаряжения Камаэль - 90 дней
                use16972(player, ctrl);
                break; //Комплект Снаряжения Камаэль - 90 дней
            case 16973:   //Комплект Снаряжения Орка Воина - 90 дней
                use16973(player, ctrl);
                break; //Комплект Снаряжения Орка Воина - 90 дней
            case 16974:   //Комплект Снаряжения Орка Шамана - 90 дней
                use16974(player, ctrl);
                break; //Комплект Снаряжения Орка Шамана - 90 дней
            case 16975:   //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы(Ранг A) - 90 дней
                use16975(player, ctrl);
                break; //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы(Ранг A) - 90 дней
            case 16976:   //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
                use16976(player, ctrl);
                break; //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
            case 16977:   //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
                use16977(player, ctrl);
                break; //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
            case 16978:   //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы(Ранг D) - 90 дней
                use16978(player, ctrl);
                break; //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы(Ранг D) - 90 дней
            case 16979:   //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
                use16979(player, ctrl);
                break; //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
            case 16980:   //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
                use16980(player, ctrl);
                break; //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
            case 16981:   //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
                use16981(player, ctrl);
                break; //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
            case 16982:   //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы(Ранг D) - 90 дней
                use16982(player, ctrl);
                break; //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы(Ранг D) - 90 дней
            case 16983:   //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
                use16983(player, ctrl);
                break; //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
            case 16984:   //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы(Ранг B) - 90 дней
                use16984(player, ctrl);
                break; //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы(Ранг B) - 90 дней
            case 16985:   //Упаковка: Комплект Туники Кармиана (Ранг C) - Артефакт Дружбы - 90 дней
                use16985(player, ctrl);
                break; //Упаковка: Комплект Туники Кармиана (Ранг C) - Артефакт Дружбы - 90 дней
            case 16986:   //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы(Ранг D) - 90 дней
                use16986(player, ctrl);
                break; //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы(Ранг D) - 90 дней
            case 16987:   //Упаковка с Магическим Оружием - Артефакт Дружбы - 90 дней
                use16987(player, ctrl);
                break; //Упаковка с Магическим Оружием - Артефакт Дружбы - 90 дней
            case 16988:   //Упаковка с Кинжалом - Артефакт Дружбы - 90 дней
                use16988(player, ctrl);
                break; //Упаковка с Кинжалом - Артефакт Дружбы - 90 дней
            case 16989:   //Упаковка с Луком - Артефакт Дружбы - 90 дней
                use16989(player, ctrl);
                break; //Упаковка с Луком - Артефакт Дружбы - 90 дней
            case 16990:   //Упаковка с Булавой - Артефакт Дружбы - 90 дней
                use16990(player, ctrl);
                break; //Упаковка с Булавой - Артефакт Дружбы - 90 дней
            case 16991:   //Упаковка с Одноручным Мечом - Артефакт Дружбы - 90 дней
                use16991(player, ctrl);
                break; //Упаковка с Одноручным Мечом - Артефакт Дружбы - 90 дней
            case 16992:   //Упаковка с Двуручным Мечом - Артефакт Дружбы - 90 дней
                use16992(player, ctrl);
                break; //Упаковка с Двуручным Мечом - Артефакт Дружбы - 90 дней
            case 16993:   //Упаковка с Кастетом - Артефакт Дружбы - 90 дней
                use16993(player, ctrl);
                break; //Упаковка с Кастетом - Артефакт Дружбы - 90 дней
            case 16994:   //Упаковка с Парными Мечами - Артефакт Дружбы - 90 дней
                use16994(player, ctrl);
                break; //Упаковка с Парными Мечами - Артефакт Дружбы - 90 дней
            case 16995:   //Упаковка с Копьем - Артефакт Дружбы - 90 дней
                use16995(player, ctrl);
                break; //Упаковка с Копьем - Артефакт Дружбы - 90 дней
            case 16996:   //Упаковка с Древним Мечом - Артефакт Дружбы - 90 дней
                use16996(player, ctrl);
                break; //Упаковка с Древним Мечом - Артефакт Дружбы - 90 дней
            case 16997:   //Упаковка с Рапирой - Артефакт Дружбы - 90 дней
                use16997(player, ctrl);
                break; //Упаковка с Рапирой - Артефакт Дружбы - 90 дней
            case 16998:   //Упаковка с Арбалетом - Артефакт Дружбы - 90 дней
                use16998(player, ctrl);
                break; //Упаковка с Арбалетом - Артефакт Дружбы - 90 дней
            case 16999:   //Комплект Величия (Ранг A) - Артефакт Дружбы - 90 дней
                use16999(player, ctrl);
                break; //Комплект Величия (Ранг A) - Артефакт Дружбы - 90 дней
            case 17000:   //Комплект Черного Снаряжения (Ранг B) - Артефакт Дружбы - 90 дней
                use17000(player, ctrl);
                break; //Комплект Черного Снаряжения (Ранг B) - Артефакт Дружбы - 90 дней
            case 17001:   //Комплект Печати (Ранг C) - Артефакт Дружбы - 90 дней
                use17001(player, ctrl);
                break; //Комплект Печати (Ранг C) - Артефакт Дружбы - 90 дней
            case 17002:   //Комплект Эльфов (Ранг D) - Артефакт Дружбы - 90 дней
                use17002(player, ctrl);
                break; //Комплект Эльфов (Ранг D) - Артефакт Дружбы - 90 дней
            case 17019:   //Упаковк: Браслеты Ездовых Питомцев 3 шт.
                use17019(player, ctrl);
                break; //Упаковк: Браслеты Ездовых Питомцев 3 шт.
            case 17020:   //Упаковка: Парное Молоко - Ивент
                use17020(player, ctrl);
                break; //Упаковка: Парное Молоко - Ивент
            case 17021:   //Упаковка: Опыт Витаминов 30 - Ивент
                use17021(player, ctrl);
                break; //Упаковка: Опыт Витаминов 30 - Ивент
            case 17022:   //Упаковка: Знак Варка - Ивент
                use17022(player, ctrl);
                break; //Упаковка: Знак Варка - Ивент
            case 17023:   //Упаковка: Знак Кетра - Ивент
                use17023(player, ctrl);
                break; //Упаковка: Знак Кетра - Ивент
            case 17024:   //Упаковка: Зелье Поддержания Энергии - Ивент
                use17024(player, ctrl);
                break; //Упаковка: Зелье Поддержания Энергии - Ивент
            case 17025:   //Упаковка: Очки ПА (7000) - Ивент
                use17025(player, ctrl);
                break; //Упаковка: Очки ПА (7000) - Ивент
            case 17026:   //Упаковка: Шляпа Старшего Помощника - Ивент
                use17026(player, ctrl);
                break; //Упаковка: Шляпа Старшего Помощника - Ивент
            case 17027:   //Упаковка: Соломенная Шляпа - Ивент
                use17027(player, ctrl);
                break; //Упаковка: Соломенная Шляпа - Ивент
            case 17028:   //Упаковка: Маска Фантома - Ивент
                use17028(player, ctrl);
                break; //Упаковка: Маска Фантома - Ивент
            case 17029:   //Упаковка: Черная Маска Фантома - Ивент
                use17029(player, ctrl);
                break; //Упаковка: Черная Маска Фантома - Ивент
            case 17031:   //Упаковка: Белая Фрея
                use17031(player, ctrl);
                break; //Упаковка: Белая Фрея
            case 17032:   //Упаковка: Сундук с Сокровищами Героя
                use17032(player, ctrl);
                break; //Упаковка: Сундук с Сокровищами Героя
            case 17040:   //Упаковка: Сундук Любви
                use17040(player, ctrl);
                break; //Упаковка: Сундук Любви
            case 17041:   //Упаковка: Сундук Сердцебиения
                use17041(player, ctrl);
                break; //Упаковка: Сундук Сердцебиения
            case 17042:   //Упаковка: Сундук Признания
                use17042(player, ctrl);
                break; //Упаковка: Сундук Признания
            case 17043:   //Упаковка: Сундук Радости
                use17043(player, ctrl);
                break; //Упаковка: Сундук Радости
            case 17044:   //Сундук Любви
                use17044(player, ctrl);
                break; //Сундук Любви
            case 17045:   //Сундук Сердцебиения
                use17045(player, ctrl);
                break; //Сундук Сердцебиения
            case 17046:   //Сундук Признания
                use17046(player, ctrl);
                break; //Сундук Признания
            case 17047:   //Сундук Радости
                use17047(player, ctrl);
                break; //Сундук Радости
            case 17048:   //Упаковка: Блестящий Браслет
                use17048(player, ctrl);
                break; //Упаковка: Блестящий Браслет
            case 17066:   //Ивент - Упаковка: Спаси Белого Тигра
                use17066(player, ctrl);
                break; //Ивент - Упаковка: Спаси Белого Тигра
            case 17082:   //Упаковка: Книга Трансформации в Анаким
                use17082(player, ctrl);
                break; //Упаковка: Книга Трансформации в Анаким
            case 17083:   //Упаковка: Птичье Гнездо - Ивент
                use17083(player, ctrl);
                break; //Упаковка: Птичье Гнездо - Ивент
            case 17084:   //Упаковка: Теневой Предмет - Шляпа Чародея - Телепорт
                use17084(player, ctrl);
                break; //Упаковка: Теневой Предмет - Шляпа Чародея - Телепорт
            case 17085:   //Упаковка: Теневой Предмет - Шляпа Чародея - Большая Голова
                use17085(player, ctrl);
                break; //Упаковка: Теневой Предмет - Шляпа Чародея - Большая Голова
            case 17086:   //Упаковка: Теневой Предмет - Шляпа Чародея - Фейерверк
                use17086(player, ctrl);
                break; //Упаковка: Теневой Предмет - Шляпа Чародея - Фейерверк
            case 17164:   //Ивент - Упаковка: Энергия Ростка
                use17164(player, ctrl);
                break; //Ивент - Упаковка: Энергия Ростка
            case 17165:   //Ивент - Упаковка: Настойка Всплеска Энергии: 30 минут
                use17165(player, ctrl);
                break; //Ивент - Упаковка: Настойка Всплеска Энергии: 30 минут
            case 17166:   //Упаковка: Усиливающий Камень Венеры (10 штук)
                use17166(player, ctrl);
                break; //Упаковка: Усиливающий Камень Венеры (10 штук)
            case 17167:   //Упаковка: Свиток: Модифицировать Оружие (S)
                use17167(player, ctrl);
                break; //Упаковка: Свиток: Модифицировать Оружие (S)
            case 17168:   //Упаковка: Кодекс Гигантов - Мастерство
                use17168(player, ctrl);
                break; //Упаковка: Кодекс Гигантов - Мастерство
            case 17232:   //Упаковка: Гасион с Мячом
                use17232(player, ctrl);
                break; //Упаковка: Гасион с Мячом
            case 17233:   //Упаковка: Родриэль с Мячом
                use17233(player, ctrl);
                break; //Упаковка: Родриэль с Мячом
            case 17234:   //Упаковка: Пенальти
                use17234(player, ctrl);
                break; //Упаковка: Пенальти
            case 17272:   //Упаковка: Агатион Антарас
                use17272(player, ctrl);
                break; //Упаковка: Агатион Антарас
            case 17273:   //Упаковка: Агатион Герольд Невитта Канна
                use17273(player, ctrl);
                break; //Упаковка: Агатион Герольд Невитта Канна
            case 17274:   //Упаковка: Агатион Хранитель Рассвета Калесин
                use17274(player, ctrl);
                break; //Упаковка: Агатион Хранитель Рассвета Калесин
            case 20045:   //Упаковка: Очки в Роговой Оправе - Проворство
                use20045(player, ctrl);
                break; //Упаковка: Очки в Роговой Оправе - Проворство
            case 20046:   //Упаковка: Афроамериканский Парик
                use20046(player, ctrl);
                break; //Упаковка: Афроамериканский Парик
            case 20047:   //Упаковка: Афроамериканский Парик - Большая Голова, Фейерверк
                use20047(player, ctrl);
                break; //Упаковка: Афроамериканский Парик - Большая Голова, Фейерверк
            case 20048:   //Упаковка: Афроамериканский Парик - Легкая походка
                use20048(player, ctrl);
                break; //Упаковка: Афроамериканский Парик - Легкая походка
            case 20049:   //Упаковка: Форменнй Головной Убор
                use20049(player, ctrl);
                break; //Упаковка: Форменнй Головной Убор
            case 20050:   //Упаковка: Бамбуковая Шляпа
                use20050(player, ctrl);
                break; //Упаковка: Бамбуковая Шляпа
            case 20051:   //Упаковка: Маска Мародеров
                use20051(player, ctrl);
                break; //Упаковка: Маска Мародеров
            case 20052:   //Упаковка: Бантик
                use20052(player, ctrl);
                break; //Упаковка: Бантик
            case 20053:   //Упаковка: Визоры
                use20053(player, ctrl);
                break; //Упаковка: Визоры
            case 20054:   //Упаковка: Свиток Возвращения к Флагу
                use20054(player, ctrl);
                break; //Упаковка: Свиток Возвращения к Флагу
            case 20055:   //Упаковка: Билет в Камалоку (Зал Бездны) 1 шт.
                use20055(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 1 шт.
            case 20056:   //Упаковка: Билет в Земли Камалоки 1 шт.
                use20056(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 1 шт.
            case 20057:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 1 шт.
                use20057(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 1 шт.
            case 20058:   //Упаковка: Браслет Сиреневого Коня
                use20058(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня
            case 20062:   //Упаковка: Флаг
                use20062(player, ctrl);
                break; //Упаковка: Флаг
            case 20079:   //Упаковка: Мешки Удачи
                use20079(player, ctrl);
                break; //Упаковка: Мешки Удачи
            case 20080:   //Упаковка: Четырехлистный Клевер
                use20080(player, ctrl);
                break; //Упаковка: Четырехлистный Клевер
            case 20092:   //Упаковка: Рождественские Чудеса
                use20092(player, ctrl);
                break; //Упаковка: Рождественские Чудеса
            case 20096:   //Упаковка: Волшебные Одеяния - Ивент
                use20096(player, ctrl);
                break; //Упаковка: Волшебные Одеяния - Ивент
            case 20179:   //Упаковка: Билет в Земли Камалоки 5 шт.">
                use20179(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 5 шт.">
            case 20180:   //Упаковка: Билет в Земли Камалоки 10 шт.">
                use20180(player, ctrl);
                break; //Упаковка: Билет в Земли Камалоки 10 шт.">
            case 20181:   //Упаковка: Свитки Возвращения к Флагу 5 шт.">
                use20181(player, ctrl);
                break; //Упаковка: Свитки Возвращения к Флагу 5 шт.">
            case 20182:   //Упаковка: Свитки Возвращения к Флагу 10ед.">
                use20182(player, ctrl);
                break; //Упаковка: Свитки Возвращения к Флагу 10ед.">
            case 20183:   //Упаковка: Флаги 5ед.">
                use20183(player, ctrl);
                break; //Упаковка: Флаги 5ед.">
            case 20184:   //Упаковка: Флаги 10ед.">
                use20184(player, ctrl);
                break; //Упаковка: Флаги 10ед.">
            case 20185:   //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
                use20185(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
            case 20186:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
                use20186(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
            case 20187:   //Упаковка: Билет в Камалоку (Зал Бездны) 10 шт.">
                use20187(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Зал Бездны) 10 шт.">
            case 20188:   //Упаковка: Билет в Камалоку (Лабиринт Бездны) 10 шт.">
                use20188(player, ctrl);
                break; //Упаковка: Билет в Камалоку (Лабиринт Бездны) 10 шт.">
            case 20189:   //Упаковка: Декорации Валентина - Премиум">
                use20189(player, ctrl);
                break; //Упаковка: Декорации Валентина - Премиум">
            case 20280:   //Упаковка: Агатион Красный Сумоист">
                use20280(player, ctrl);
                break; //Упаковка: Агатион Красный Сумоист">
            case 20281:   //Упаковка: Агатион Красный Сумоист (7дн.) - Шепот Смерти">
                use20281(player, ctrl);
                break; //Упаковка: Агатион Красный Сумоист (7дн.) - Шепот Смерти">
            case 20282:   //Упаковка: Агатион Синий Сумоист">
                use20282(player, ctrl);
                break; //Упаковка: Агатион Синий Сумоист">
            case 20283:   //Упаковка: Агатион Синий Сумоист (7дн.) - Дикая Магия">
                use20283(player, ctrl);
                break; //Упаковка: Агатион Синий Сумоист (7дн.) - Дикая Магия">
            case 20284:   //Упаковка: Агатион Сумоист Чемпион">
                use20284(player, ctrl);
                break; //Упаковка: Агатион Сумоист Чемпион">
            case 20285:   //Упаковка: Агатион Сумоист Чемпион (7дн.) - Большая Голова/Фейерверк">
                use20285(player, ctrl);
                break; //Упаковка: Агатион Сумоист Чемпион (7дн.) - Большая Голова/Фейерверк">
            case 20286:   //Упаковка: Агатион Плюшевый Медведь">
                use20286(player, ctrl);
                break; //Упаковка: Агатион Плюшевый Медведь">
            case 20287:   //Упаковка: Агатион Плюшевый Медведь (7 дн.) - Телепорт">
                use20287(player, ctrl);
                break; //Упаковка: Агатион Плюшевый Медведь (7 дн.) - Телепорт">
            case 20288:   //Упаковка: Агатион Плюшевый Медведь (7дн.) - Воскрешение">
                use20288(player, ctrl);
                break; //Упаковка: Агатион Плюшевый Медведь (7дн.) - Воскрешение">
            case 20289:   //Упаковка: Агатион Плюшевый Медведь (7дн.) - Энергия">
                use20289(player, ctrl);
                break; //Упаковка: Агатион Плюшевый Медведь (7дн.) - Энергия">
            case 20290:   //Упаковка: Агатион Бог Богатства">
                use20290(player, ctrl);
                break; //Упаковка: Агатион Бог Богатства">
            case 20291:   //Упаковка: Агатион Бог Богатства (7дн.) - Бог Богатства">
                use20291(player, ctrl);
                break; //Упаковка: Агатион Бог Богатства (7дн.) - Бог Богатства">
            case 20292:   //Упаковка: Агатион Дриада">
                use20292(player, ctrl);
                break; //Упаковка: Агатион Дриада">
            case 20293:   //Упаковка: Агатион Священная Корова">
                use20293(player, ctrl);
                break; //Упаковка: Агатион Священная Корова">
            case 20294:   //Упаковка: Агатион Священная Корова (7дн.) - Священная Корова">
                use20294(player, ctrl);
                break; //Упаковка: Агатион Священная Корова (7дн.) - Священная Корова">
            case 20295:   //Упаковка: Агатион Счастливая Корова">
                use20295(player, ctrl);
                break; //Упаковка: Агатион Счастливая Корова">
            case 20296:   //Упаковка: Агатион Счастливая Корова (7дн.) - Счастливая Корова">
                use20296(player, ctrl);
                break; //Упаковка: Агатион Счастливая Корова (7дн.) - Счастливая Корова">
            case 20314:   //Упаковка: Праздничный Торт - Энергия">
                use20314(player, ctrl);
                break; //Упаковка: Праздничный Торт - Энергия">
            case 20315:   //Упаковка: Очки">
                use20315(player, ctrl);
                break; //Упаковка: Очки">
            case 20316:   //Упаковка: Шляпа Наполеона">
                use20316(player, ctrl);
                break; //Упаковка: Шляпа Наполеона">
            case 20317:   //Упаковка: Рожки">
                use20317(player, ctrl);
                break; //Упаковка: Рожки">
            case 20318:   //Упаковка: Маска из Черных Камней">
                use20318(player, ctrl);
                break; //Упаковка: Маска из Черных Камней">
            case 20319:   //Упаковка: Пластиковый Парик">
                use20319(player, ctrl);
                break; //Упаковка: Пластиковый Парик">
            case 20328:   //Упаковка: Благословенные Заряды Духа Зверя">
                use20328(player, ctrl);
                break; //Упаковка: Благословенные Заряды Духа Зверя">
            case 20331:   //Большая Упаковка: Благословенные Заряды Духа Зверя">
                use20331(player, ctrl);
                break; //Большая Упаковка: Благословенные Заряды Духа Зверя">
            case 20397:   //Упаковка Развития Новичка">
                use20397(player, ctrl);
                break; //Упаковка Развития Новичка">
            case 20398:   //Упаковка Быстрого Развития">
                use20398(player, ctrl);
                break; //Упаковка Быстрого Развития">
            case 20402:   //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Тела">
                use20402(player, ctrl);
                break; //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Тела">
            case 20403:   //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Души">
                use20403(player, ctrl);
                break; //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Души">
            case 20404:   //Упаковка: Шляпа Лэй Фэна">
                use20404(player, ctrl);
                break; //Упаковка: Шляпа Лэй Фэна">
            case 20450:   //Упаковка: Агатион Майо (7 дн.)">
                use20450(player, ctrl);
                break; //Упаковка: Агатион Майо (7 дн.)">
            case 20451:   //Упаковка: Золотой Агатион (7 дн.)">
                use20451(player, ctrl);
                break; //Упаковка: Золотой Агатион (7 дн.)">
            case 20452:   //Упаковка: Черный Агатион (7 дн.)">
                use20452(player, ctrl);
                break; //Упаковка: Черный Агатион (7 дн.)">
            case 20453:   //Упаковка: Агатион Питак (7 дн.)">
                use20453(player, ctrl);
                break; //Упаковка: Агатион Питак (7 дн.)">
            case 20454:   //Упаковка: Агатион Питак (7 дн.)">
                use20454(player, ctrl);
                break; //Упаковка: Агатион Питак (7 дн.)">
            case 20455:   //Упаковка: Агатион Питак (7 дн.)">
                use20455(player, ctrl);
                break; //Упаковка: Агатион Питак (7 дн.)">
            case 20456:   //Упаковка: Агатион Детеныш Панды (7дн.)">
                use20456(player, ctrl);
                break; //Упаковка: Агатион Детеныш Панды (7дн.)">
            case 20457:   //Упаковка: Агатион Панда Папа (7дн.)">
                use20457(player, ctrl);
                break; //Упаковка: Агатион Панда Папа (7дн.)">
            case 20458:   //Упаковка: Агатион Панда Мама (7дн.)">
                use20458(player, ctrl);
                break; //Упаковка: Агатион Панда Мама (7дн.)">
            case 20459:   //Упаковка: Очки в Роговой Оправе (7 дн.)">
                use20459(player, ctrl);
                break; //Упаковка: Очки в Роговой Оправе (7 дн.)">
            case 20460:   //Упаковка: Афроамериканский Парик (7 дн.)">
                use20460(player, ctrl);
                break; //Упаковка: Афроамериканский Парик (7 дн.)">
            case 20461:   //Упаковка: Афроамериканский Парик (7 дн.)">
                use20461(player, ctrl);
                break; //Упаковка: Афроамериканский Парик (7 дн.)">
            case 20462:   //Упаковка: Форменный Головной Убор (7 дн.)">
                use20462(player, ctrl);
                break; //Упаковка: Форменный Головной Убор (7 дн.)">
            case 20463:   //Упаковка: Бамбуковая Шляпа (7 дн.)">
                use20463(player, ctrl);
                break; //Упаковка: Бамбуковая Шляпа (7 дн.)">
            case 20464:   //Упаковка: Маска Мародеров (7 дн.)">
                use20464(player, ctrl);
                break; //Упаковка: Маска Мародеров (7 дн.)">
            case 20465:   //Упаковка: Бантик (7 дн.)">
                use20465(player, ctrl);
                break; //Упаковка: Бантик (7 дн.)">
            case 20466:   //Упаковка: Визоры (7 дн.)">
                use20466(player, ctrl);
                break; //Упаковка: Визоры (7 дн.)">
            case 20467:   //Упаковка: Шляпа Кошки Кэт (7 дн.)">
                use20467(player, ctrl);
                break; //Упаковка: Шляпа Кошки Кэт (7 дн.)">
            case 20468:   //Упаковка: Маска Черепа (7 дн.)">
                use20468(player, ctrl);
                break; //Упаковка: Маска Черепа (7 дн.)">
            case 20469:   //Упаковка: Афроамериканский Парик - Золотой (7 дн.)">
                use20469(player, ctrl);
                break; //Упаковка: Афроамериканский Парик - Золотой (7 дн.)">
            case 20470:   //Упаковка: Афроамериканский Парик - Розовый (7 дн.)">
                use20470(player, ctrl);
                break; //Упаковка: Афроамериканский Парик - Розовый (7 дн.)">
            case 20471:   //Упаковка: Очки (7 дн.)">
                use20471(player, ctrl);
                break; //Упаковка: Очки (7 дн.)">
            case 20472:   //Упаковка: Шляпа Наполеона (7 дн.)">
                use20472(player, ctrl);
                break; //Упаковка: Шляпа Наполеона (7 дн.)">
            case 20473:   //Упаковка: Рожки (7 дн.)">
                use20473(player, ctrl);
                break; //Упаковка: Рожки (7 дн.)">
            case 20474:   //Упаковка: Маска из Черных Камней (7 дн.)">
                use20474(player, ctrl);
                break; //Упаковка: Маска из Черных Камней (7 дн.)">
            case 20475:   //Упаковка: Пластиковый Парик (7 дн.)">
                use20475(player, ctrl);
                break; //Упаковка: Пластиковый Парик (7 дн.)">
            case 20476:   //Упаковка: Заколка Маргаритка (7 дн.)">
                use20476(player, ctrl);
                break; //Упаковка: Заколка Маргаритка (7 дн.)">
            case 20477:   //Упаковка: Заколка Незабудка (7 дн.)">
                use20477(player, ctrl);
                break; //Упаковка: Заколка Незабудка (7 дн.)">
            case 20478:   //Упаковка: Глазная Повязка Бандита (7 дн.)">
                use20478(player, ctrl);
                break; //Упаковка: Глазная Повязка Бандита (7 дн.)">
            case 20479:   //Упаковка: Глазная Повязка Пирата (7 дн.)">
                use20479(player, ctrl);
                break; //Упаковка: Глазная Повязка Пирата (7 дн.)">
            case 20480:   //Упаковка: Монокль (7 дн.)">
                use20480(player, ctrl);
                break; //Упаковка: Монокль (7 дн.)">
            case 20481:   //Упаковка: Маска Духов (7 дн.)">
                use20481(player, ctrl);
                break; //Упаковка: Маска Духов (7 дн.)">
            case 20482:   //Упаковка: Рога Демона (7 дн.)">
                use20482(player, ctrl);
                break; //Упаковка: Рога Демона (7 дн.)">
            case 20483:   //Упаковка: Карнавальная Маска (7 дн.)">
                use20483(player, ctrl);
                break; //Упаковка: Карнавальная Маска (7 дн.)">
            case 20484:   //Упаковка: Красная Карнавальная Маска (7 дн.)">
                use20484(player, ctrl);
                break; //Упаковка: Красная Карнавальная Маска (7 дн.)">
            case 20485:   //Упаковка: Кошачьи Ушки (7 дн.)">
                use20485(player, ctrl);
                break; //Упаковка: Кошачьи Ушки (7 дн.)">
            case 20486:   //Упаковка: Заколка Леди (7 дн.)">
                use20486(player, ctrl);
                break; //Упаковка: Заколка Леди (7 дн.)">
            case 20487:   //Упаковка: Ушки Енота (7 дн.)">
                use20487(player, ctrl);
                break; //Упаковка: Ушки Енота (7 дн.)">
            case 20488:   //Упаковка: Ушки Кролика (7 дн.)">
                use20488(player, ctrl);
                break; //Упаковка: Ушки Кролика (7 дн.)">
            case 20489:   //Упаковка: Крылышко Ангела (7 дн.)">
                use20489(player, ctrl);
                break; //Упаковка: Крылышко Ангела (7 дн.)">
            case 20490:   //Упаковка: Антенки Феи (7 дн.)">
                use20490(player, ctrl);
                break; //Упаковка: Антенки Феи (7 дн.)">
            case 20491:   //Упаковка: Украшенная Перьями Шляпа (7 дн.)">
                use20491(player, ctrl);
                break; //Упаковка: Украшенная Перьями Шляпа (7 дн.)">
            case 20492:   //Упаковка: Защитные Очки Ремесленника (7 дн.)">
                use20492(player, ctrl);
                break; //Упаковка: Защитные Очки Ремесленника (7 дн.)">
            case 20505:   //Упаковка: Агатион Фомона">
                use20505(player, ctrl);
                break; //Упаковка: Агатион Фомона">
            case 20506:   //Упаковка: Агатион Фомона (7 дн.)">
                use20506(player, ctrl);
                break; //Упаковка: Агатион Фомона (7 дн.)">
            case 20507:   //Упаковка: Почтение к Матери (24 ч.) - Ивент">
                use20507(player, ctrl);
                break; //Упаковка: Почтение к Матери (24 ч.) - Ивент">
            case 20508:   //Упаковка: Почтение к Матери (3 дн.)">
                use20508(player, ctrl);
                break; //Упаковка: Почтение к Матери (3 дн.)">
            case 20509:   //Упаковка: Шляпа Королевы Кошек">
                use20509(player, ctrl);
                break; //Упаковка: Шляпа Королевы Кошек">
            case 20510:   //Упаковка: Шляпа Короля Кошек">
                use20510(player, ctrl);
                break; //Упаковка: Шляпа Короля Кошек">
            case 20511:   //Упаковка: Шляпа Кота Кая">
                use20511(player, ctrl);
                break; //Упаковка: Шляпа Кота Кая">
            case 20512:   //Упаковка: Браслет Златогривого Льва">
                use20512(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва">
            case 20513:   //Упаковка: Браслет Златогривого Льва - 30 дней">
                use20513(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва - 30 дней">
            case 20514:   //Упаковка: Браслет Парового Жука - 30 дней">
                use20514(player, ctrl);
                break; //Упаковка: Браслет Парового Жука - 30 дней">
            case 20540:   //Упаковка: Браслет Парового Жука (30дн.)">
                use20540(player, ctrl);
                break; //Упаковка: Браслет Парового Жука (30дн.)">
            case 20541:   //Упаковка: Браслет Златогривого Льва (30 дн.)">
                use20541(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва (30 дн.)">
            case 20542:   //Упаковка: Афроамериканский Парик (7 дн.)">
                use20542(player, ctrl);
                break; //Упаковка: Афроамериканский Парик (7 дн.)">
            case 20543:   //Упаковка: Очки в Роговой Оправе (7 дн.)">
                use20543(player, ctrl);
                break; //Упаковка: Очки в Роговой Оправе (7 дн.)">
            case 20544:   //Упаковка: Бамбуковая Шляпа (7 дн.)">
                use20544(player, ctrl);
                break; //Упаковка: Бамбуковая Шляпа (7 дн.)">
            case 20548:   //Упаковка: Руна Опыта 30% (5 ч.)">
                use20548(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (5 ч.)">
            case 20549:   //Упаковка: Руна Опыта 50% (5 ч.)">
                use20549(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (5 ч.)">
            case 20550:   //Упаковка: Руна Опыта 30% (10 ч.)">

                use20550(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (10 ч.)">
            case 20551:   //Упаковка: Руна Опыта 50% (10 ч.)">
                use20551(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (10 ч.)">
            case 20552:   //Упаковка: Руна Опыта 30% (7 дн.)">
                use20552(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (7 дн.)">
            case 20553:   //Упаковка: Руна Опыта 50% (7 дн.)">
                use20553(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (7 дн.)">
            case 20554:   //Упаковка: Руна SP 30% (5 ч.)">
                use20554(player, ctrl);
                break; //Упаковка: Руна SP 30% (5 ч.)">
            case 20555:   //Упаковка: Руна SP 50% (5 ч.)">
                use20555(player, ctrl);
                break; //Упаковка: Руна SP 50% (5 ч.)">
            case 20556:   //Упаковка: Руна SP 30% (10 ч.)">
                use20556(player, ctrl);
                break; //Упаковка: Руна SP 30% (10 ч.)">
            case 20557:   //Упаковка: Руна SP 50% (10 ч.)">
                use20557(player, ctrl);
                break; //Упаковка: Руна SP 50% (10 ч.)">
            case 20558:   //Упаковка: Руна SP 30% (7 дн.)">
                use20558(player, ctrl);
                break; //Упаковка: Руна SP 30% (7 дн.)">
            case 20559:   //Упаковка: Руна SP 50% (7 дн.)">
                use20559(player, ctrl);
                break; //Упаковка: Руна SP 50% (7 дн.)">
            case 20560:   //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
                use20560(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
            case 20561:   //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
                use20561(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
            case 20562:   //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
                use20562(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
            case 20563:   //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
                use20563(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
            case 20564:   //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
                use20564(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
            case 20565:   //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
                use20565(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
            case 20566:   //Упаковка: Руна Пера (24 ч.)">
                use20566(player, ctrl);
                break; //Упаковка: Руна Пера (24 ч.)">
            case 20574:   //Свиток Мастера 2 - Ивент">
                use20574(player, ctrl);
                break; //Свиток Мастера 2 - Ивент">
            case 20576:   //Упаковка: Диадема Евы (3 дн.) - Ивент">
                use20576(player, ctrl);
                break; //Упаковка: Диадема Евы (3 дн.) - Ивент">
            case 20577:   //Упаковка: Диадема Евы (7 дн.) - Ивент">
                use20577(player, ctrl);
                break; //Упаковка: Диадема Евы (7 дн.) - Ивент">
            case 20578:   //Упаковка: Диадема Евы - Ивент">
                use20578(player, ctrl);
                break; //Упаковка: Диадема Евы - Ивент">
            case 20579:   //Упаковка: Руна Евы (5 ч.) - Ивент">
                use20579(player, ctrl);
                break; //Упаковка: Руна Евы (5 ч.) - Ивент">
            case 20580:   //Упаковка: Руна Евы (3 ч.) - Ивент">
                use20580(player, ctrl);
                break; //Упаковка: Руна Евы (3 ч.) - Ивент">
            case 20581:   //Упаковка: Руна Опыта 30% (3 ч.)">
                use20581(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (3 ч.)">
            case 20587:   //Упаковка: Агатион Вега">
                use20587(player, ctrl);
                break; //Упаковка: Агатион Вега">
            case 20588:   //Упаковка: Агатион Вега (24 ч.) - Ужасающая Мощь">
                use20588(player, ctrl);
                break; //Упаковка: Агатион Вега (24 ч.) - Ужасающая Мощь">
            case 20589:   //Упаковка: Агатион Вега (3 дн.) - Ужасающая Мощь">
                use20589(player, ctrl);
                break; //Упаковка: Агатион Вега (3 дн.) - Ужасающая Мощь">
            case 20590:   //Упаковка: Браслет Любви (24 ч.) - Ивент">
                use20590(player, ctrl);
                break; //Упаковка: Браслет Любви (24 ч.) - Ивент">
            case 20598:   //Упаковка: Посох Душ (7 дн.) - Танец Тени">
                use20598(player, ctrl);
                break; //Упаковка: Посох Душ (7 дн.) - Танец Тени">
            case 20599:   //Упаковка: Шляпа Серой Души (7 дн.) - Душа Феникса">
                use20599(player, ctrl);
                break; //Упаковка: Шляпа Серой Души (7 дн.) - Душа Феникса">
            case 20607:   //Упаковка: Гарнитура - Тема: Город">
                use20607(player, ctrl);
                break; //Упаковка: Гарнитура - Тема: Город">
            case 20608:   //Упаковка: Гарнитура - Тема: Герой">
                use20608(player, ctrl);
                break; //Упаковка: Гарнитура - Тема: Герой">
            case 20609:   //Упаковка: Гарнитура - Тема: Парк">
                use20609(player, ctrl);
                break; //Упаковка: Гарнитура - Тема: Парк">
            case 20610:   //Упаковка: Гарнитура (7 дн.) - Тема: Город. Сила души бессмертного Путешественника">
                use20610(player, ctrl);
                break; //Упаковка: Гарнитура (7 дн.) - Тема: Город. Сила души бессмертного Путешественника">
            case 20611:   //Упаковка: Гарнитура (7 дн.) - Тема: Герой. Сила души могучего Воина">
                use20611(player, ctrl);
                break; //Упаковка: Гарнитура (7 дн.) - Тема: Герой. Сила души могучего Воина">
            case 20612:   //Упаковка: Гарнитура (7 дн.) - Тема: Парк. Сила мудрейшего Мистика">
                use20612(player, ctrl);
                break; //Упаковка: Гарнитура (7 дн.) - Тема: Парк. Сила мудрейшего Мистика">
            case 20619:   //Упаковка: Агатион Вега (24 ч.) - Звук Свистка">
                use20619(player, ctrl);
                break; //Упаковка: Агатион Вега (24 ч.) - Звук Свистка">
            case 20620:   //Упаковка: Агатион Вега (3 дн.) - Звук Свистка">
                use20620(player, ctrl);
                break; //Упаковка: Агатион Вега (3 дн.) - Звук Свистка">
            case 20623:   //Упаковка: Благодать - Благовоние">
                use20623(player, ctrl);
                break; //Упаковка: Благодать - Благовоние">
            case 20624:   //Упаковка: Благовоние 100 ед.">
                use20624(player, ctrl);
                break; //Упаковка: Благовоние 100 ед.">
            case 20625:   //Упаковка: Шляпа Серой Души (7 дн.) - Воскрешение">
                use20625(player, ctrl);
                break; //Упаковка: Шляпа Серой Души (7 дн.) - Воскрешение">
            case 20627:   //Упаковка: Браслет Любви (7 дн.)">
                use20627(player, ctrl);
                break; //Упаковка: Браслет Любви (7 дн.)">
            case 20631:   //Упаковка: Шляпа Арбуз (7 дн.)">
                use20631(player, ctrl);
                break; //Упаковка: Шляпа Арбуз (7 дн.)">
            case 20632:   //Упаковка: Шляпа Арбуз">
                use20632(player, ctrl);
                break; //Упаковка: Шляпа Арбуз">
            case 20635:   //Упаковка: Снаряжение для Новичков (Без ранга)">
                use20635(player, ctrl);
                break; //Упаковка: Снаряжение для Новичков (Без ранга)">
            case 20636:   //Упаковка: Снаряжение для Воинов (Ранг D)">
                use20636(player, ctrl);
                break; //Упаковка: Снаряжение для Воинов (Ранг D)">
            case 20637:   //Упаковка: Снаряжение для Магов (Ранг D)">
                use20637(player, ctrl);
                break; //Упаковка: Снаряжение для Магов (Ранг D)">
            case 20638:   //Упаковка: Поддержка Новичков">
                use20638(player, ctrl);
                break; //Упаковка: Поддержка Новичков">
            case 20680:   //Упаковка: Агатион Чончон">
                use20680(player, ctrl);
                break; //Упаковка: Агатион Чончон">
            case 20681:   //Упаковка: Агатион Чончон на 7 дн. - Сила души отважного Воина">
                use20681(player, ctrl);
                break; //Упаковка: Агатион Чончон на 7 дн. - Сила души отважного Воина">
            case 20682:   //Упаковка: Агатион Бум">
                use20682(player, ctrl);
                break; //Упаковка: Агатион Бум">
            case 20683:   //Упаковка: Агатион Бум на 7 дн. - Сила души великого Мистика">
                use20683(player, ctrl);
                break; //Упаковка: Агатион Бум на 7 дн. - Сила души великого Мистика">
            case 20684:   //Упаковка: Агатион Танцующий ребенок">
                use20684(player, ctrl);
                break; //Упаковка: Агатион Танцующий ребенок">
            case 20685:   //Упаковка: Агатион Танцующий ребенок на 7 дн. - Сила души выдающегося Путешественника">
                use20685(player, ctrl);
                break; //Упаковка: Агатион Танцующий ребенок на 7 дн. - Сила души выдающегося Путешественника">
            case 20686:   //Упаковка: Агатион Древнего Героя">
                use20686(player, ctrl);
                break; //Упаковка: Агатион Древнего Героя">
            case 20687:   //Упаковка: Агатион Древнего Героя на 7 дн. - Сила души великого Мистика">
                use20687(player, ctrl);
                break; //Упаковка: Агатион Древнего Героя на 7 дн. - Сила души великого Мистика">
            case 20688:   //Упаковка: Агатион Утанка ">
                use20688(player, ctrl);
                break; //Упаковка: Агатион Утанка ">
            case 20689:   //Упаковка: Агатион Утанка на 7 дн. - Сила души отважного Воина">
                use20689(player, ctrl);
                break; //Упаковка: Агатион Утанка на 7 дн. - Сила души отважного Воина">
            case 20690:   //Упаковка: Агатион Бонус В">
                use20690(player, ctrl);
                break; //Упаковка: Агатион Бонус В">
            case 20691:   //Упаковка: Агатион Бонус В на 7 дн. - Сила души выдающегося Путешественника">
                use20691(player, ctrl);
                break; //Упаковка: Агатион Бонус В на 7 дн. - Сила души выдающегося Путешественника">
            case 20692:   //Упаковка: Головной Убор Валькирии ">
                use20692(player, ctrl);
                break; //Упаковка: Головной Убор Валькирии ">
            case 20693:   //Упаковка: Головной Убор Валькирии 7 дн. - Сила души выдающегося Путешественника">
                use20693(player, ctrl);
                break; //Упаковка: Головной Убор Валькирии 7 дн. - Сила души выдающегося Путешественника">
            case 20694:   //Упаковка: Маска Тигра">
                use20694(player, ctrl);
                break; //Упаковка: Маска Тигра">
            case 20695:   //Упаковка: Маска Тигра 7 дн. - Сила души отважного Воина">
                use20695(player, ctrl);
                break; //Упаковка: Маска Тигра 7 дн. - Сила души отважного Воина">
            case 20696:   //Упаковка: Ободок">
                use20696(player, ctrl);
                break; //Упаковка: Ободок">
            case 20697:   //Упаковка: Ободок на 7 дн. - Сила души великого Мистика">
                use20697(player, ctrl);
                break; //Упаковка: Ободок на 7 дн. - Сила души великого Мистика">
            case 20698:   //Упаковка: Шапка Детеныша Панды ">
                use20698(player, ctrl);
                break; //Упаковка: Шапка Детеныша Панды ">
            case 20699:   //Упаковка: Шапка Детеныша Панды 7 дн. - Благ. Телепорт">
                use20699(player, ctrl);
                break; //Упаковка: Шапка Детеныша Панды 7 дн. - Благ. Телепорт">
            case 20700:   //Упаковка: Шапка Панды Папы ">
                use20700(player, ctrl);
                break; //Упаковка: Шапка Панды Папы ">
            case 20701:   //Упаковка: Шапка Панды Папы 7дн. - Сила души выдающегося Путешественника">
                use20701(player, ctrl);
                break; //Упаковка: Шапка Панды Папы 7дн. - Сила души выдающегося Путешественника">
            case 20702:   //Упаковка: Шапка Панды Мамы ">
                use20702(player, ctrl);
                break; //Упаковка: Шапка Панды Мамы ">
            case 20703:   //Упаковка: Шапка Панды Мамы 7 дн. - Благ. Воскрешение">
                use20703(player, ctrl);
                break; //Упаковка: Шапка Панды Мамы 7 дн. - Благ. Воскрешение">
            case 20704:   //Упаковка: Головной Убор Стражника">
                use20704(player, ctrl);
                break; //Упаковка: Головной Убор Стражника">
            case 20705:   //Упаковка: Головной Убор Стражника 7 дн. - Инстинкт разрушения">
                use20705(player, ctrl);
                break; //Упаковка: Головной Убор Стражника 7 дн. - Инстинкт разрушения">
            case 20734:   //Golden Jack O'Lantern Mask 7-Day Pack - Authority of Golden Jack O'Lantern Mask.">
                use20734(player, ctrl);
                break; //Golden Jack O'Lantern Mask 7-Day Pack - Authority of Golden Jack O'Lantern Mask.">
            case 20735:   //Упаковка: Агатион Мертвец">
                use20735(player, ctrl);
                break; //Упаковка: Агатион Мертвец">
            case 20736:   //Упаковка: Агатион Мертвец (7 дн.) - Риск для Жизни">
                use20736(player, ctrl);
                break; //Упаковка: Агатион Мертвец (7 дн.) - Риск для Жизни">
            case 20737:   //Упаковка: Агатион Синяя Птица">
                use20737(player, ctrl);
                break; //Упаковка: Агатион Синяя Птица">
            case 20738:   //Упаковка: Агатион Птица">
                use20738(player, ctrl);
                break; //Упаковка: Агатион Птица">
            case 20740:   //Упаковка: Коктейли">
                use20740(player, ctrl);
                break; //Упаковка: Коктейли">
            case 20753:   //Коробка с Подарками Седобородого Деда Мороза">
                use20753(player, ctrl);
                break; //Коробка с Подарками Седобородого Деда Мороза">
            case 20754:   //Коробка с Подарками Седобородого Деда Мороза - Большая">
                use20754(player, ctrl);
                break; //Коробка с Подарками Седобородого Деда Мороза - Большая">
            case 20773:   //Подарок Рудольфа">
                use20773(player, ctrl);
                break; //Подарок Рудольфа">
            case 20796:   //Упаковка: Агатион Бог Войны (7 дн.) - Аура гнева">
                use20796(player, ctrl);
                break; //Упаковка: Агатион Бог Войны (7 дн.) - Аура гнева">
            case 20797:   //Упаковка: Агатион Богиня Милосердия (7 дн.) - Благословение Милосердия">
                use20797(player, ctrl);
                break; //Упаковка: Агатион Богиня Милосердия (7 дн.) - Благословение Милосердия">
            case 20798:   //Упаковка: Агатион Китайский Актер (7 дн.) - Меч Восстановления">
                use20798(player, ctrl);
                break; //Упаковка: Агатион Китайский Актер (7 дн.) - Меч Восстановления">
            case 20799:   //Упаковка: Агатион Китайский Актер (7 дн.) - Водяной Меч">
                use20799(player, ctrl);
                break; //Упаковка: Агатион Китайский Актер (7 дн.) - Водяной Меч">
            case 20800:   //Упаковка: Агатион Китайская Актриса (7 дн.) - Копье Пламени">
                use20800(player, ctrl);
                break; //Упаковка: Агатион Китайская Актриса (7 дн.) - Копье Пламени">
            case 20801:   //Упаковка: Агатион Китайские Актеры (7 дн.)">
                use20801(player, ctrl);
                break; //Упаковка: Агатион Китайские Актеры (7 дн.)">
            case 20802:   //Упаковка: Агатион Китайские Актеры (7 дн.) - Меч Жизни">
                use20802(player, ctrl);
                break; //Упаковка: Агатион Китайские Актеры (7 дн.) - Меч Жизни">
            case 20803:   //Упаковка: Агатион Чипао (7 дн.) - Легкость">
                use20803(player, ctrl);
                break; //Упаковка: Агатион Чипао (7 дн.) - Легкость">
            case 20866:   //Комплект Духовных Аватаров">
                use20866(player, ctrl);
                break; //Комплект Духовных Аватаров">
            case 20869:   //Подарок к Новому Году">
                use20869(player, ctrl);
                break; //Подарок к Новому Году">
            case 20898:   //Упаковка: Фиолетовая Маска (7 дн.) - Благословение Души">
                use20898(player, ctrl);
                break; //Упаковка: Фиолетовая Маска (7 дн.) - Благословение Души">
            case 20901:   //Комплект Седобородого Деда Мороза">
                use20901(player, ctrl);
                break; //Комплект Седобородого Деда Мороза">
            case 20902:   //Упаковка: Кольцо Королевы Муравьев (7 дн.)">
                use20902(player, ctrl);
                break; //Упаковка: Кольцо Королевы Муравьев (7 дн.)">
            case 20946:   //Упаковка: Реактивный Мотоцикл - 7 дн.">
                use20946(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл - 7 дн.">
            case 20947:   //Упаковка: Реактивный Мотоцикл - 30 дн.">
                use20947(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл - 30 дн.">
            case 20948:   //Упаковка: Агатион Феникс - 7 дн. - Нирвана">
                use20948(player, ctrl);
                break; //Упаковка: Агатион Феникс - 7 дн. - Нирвана">
            case 20949:   //Упаковка: Агатион Феникс - 7 дн. - Очищение Феникса">
                use20949(player, ctrl);
                break; //Упаковка: Агатион Феникс - 7 дн. - Очищение Феникса">
            case 20950:   //Упаковка: Маска Лисы">
                use20950(player, ctrl);
                break; //Упаковка: Маска Лисы">
            case 20951:   //Упаковка: Маска Лисы - 7 дн. - Тихие Шаги">
                use20951(player, ctrl);
                break; //Упаковка: Маска Лисы - 7 дн. - Тихие Шаги">
            case 20952:   //Упаковка: Шляпа Пайван">
                use20952(player, ctrl);
                break; //Упаковка: Шляпа Пайван">
            case 20953:   //Упаковка: Шляпа Пайван - 7 дн. - Сила Богов">
                use20953(player, ctrl);
                break; //Упаковка: Шляпа Пайван - 7 дн. - Сила Богов">
            case 20957:   //Упаковка: Агатион Мертвец - 7 дн. - Прозрачность Души">
                use20957(player, ctrl);
                break; //Упаковка: Агатион Мертвец - 7 дн. - Прозрачность Души">
            case 20959:   //Упаковка: Королевская Корона Венеры">
                use20959(player, ctrl);
                break; //Упаковка: Королевская Корона Венеры">
            case 20960:   //Упаковка: Королевская Диадема Венеры">
                use20960(player, ctrl);
                break; //Упаковка: Королевская Диадема Венеры">
            case 20961:   //Упаковка: Диадема Дворянина">
                use20961(player, ctrl);
                break; //Упаковка: Диадема Дворянина">
            case 20962:   //Упаковка: Королевская Корона Венеры (30 дн.)">
                use20962(player, ctrl);
                break; //Упаковка: Королевская Корона Венеры (30 дн.)">
            case 20963:   //Упаковка: Королевская Диадема Венеры (30 дн.)">
                use20963(player, ctrl);
                break; //Упаковка: Королевская Диадема Венеры (30 дн.)">
            case 20964:   //Упаковка: Диадема Дворянина (30 дн.)">
                use20964(player, ctrl);
                break; //Упаковка: Диадема Дворянина (30 дн.)">
            case 20965:   //Упаковка: Королевская Корона Венеры">
                use20965(player, ctrl);
                break; //Упаковка: Королевская Корона Венеры">
            case 20966:   //Упаковка: Королевская Диадема Венеры">
                use20966(player, ctrl);
                break; //Упаковка: Королевская Диадема Венеры">
            case 20967:   //Упаковка с Диадемой Дворянина">
                use20967(player, ctrl);
                break; //Упаковка с Диадемой Дворянина">
            case 20969:   //Упаковка: Агатион Бог Войны">
                use20969(player, ctrl);
                break; //Упаковка: Агатион Бог Войны">
            case 20994:   //Упаковка: Агатион Трехглавый Дракон - Легкая Походка">
                use20994(player, ctrl);
                break; //Упаковка: Агатион Трехглавый Дракон - Легкая Походка">
            case 20995:   //Упаковка: Маска Пекинской Оперы (Юэ Фэй) - Эффект Добродетели, Дух Трех Государств">
                use20995(player, ctrl);
                break; //Упаковка: Маска Пекинской Оперы (Юэ Фэй) - Эффект Добродетели, Дух Трех Государств">
            case 20996:   //Упаковка: Маска Пекинской Оперы (Гуань Юй) - Безмолвие Преданности, Дух Трех Государств">
                use20996(player, ctrl);
                break; //Упаковка: Маска Пекинской Оперы (Гуань Юй) - Безмолвие Преданности, Дух Трех Государств">
            case 20997:   //Упаковка: Маска Пекинской Оперы (Джань Фэй) - Энергия Алмаза, Дух Трех Государств">
                use20997(player, ctrl);
                break; //Упаковка: Маска Пекинской Оперы (Джань Фэй) - Энергия Алмаза, Дух Трех Государств">
            case 20998:   //Упаковка: Шапка Дракона">
                use20998(player, ctrl);
                break; //Упаковка: Шапка Дракона">
            case 20999:   //Упаковка: Шапка Дракона (7 дн.) - Ускорение">
                use20999(player, ctrl);
                break; //Упаковка: Шапка Дракона (7 дн.) - Ускорение">
            case 21000:   //Упаковка: Агатион Ловец Мячей Гносиан">
                use21000(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Гносиан">
            case 21001:   //Упаковка: Агатион Ловец Мячей Ородриэль">
                use21001(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Ородриэль">
            case 21002:   //Упаковка: Агатион Штрафной Удар">
                use21002(player, ctrl);
                break; //Упаковка: Агатион Штрафной Удар">
            case 21003:   //Упаковка: Агатион Ловец Мячей Гносиан">
                use21003(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Гносиан">
            case 21004:   //Упаковка: Агатион Ловец Мячей Ородриэль">
                use21004(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Ородриэль">
            case 21005:   //Упаковка: Агатион Штрафной Удар">
                use21005(player, ctrl);
                break; //Упаковка: Агатион Штрафной Удар">
            case 21006:   //Упаковка: Агатион Ловец Мячей Гносиан">
                use21006(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Гносиан">
            case 21007:   //Упаковка: Агатион Ловец Мячей Ородриэль">
                use21007(player, ctrl);
                break; //Упаковка: Агатион Ловец Мячей Ородриэль">
            case 21008:   //Упаковка: Агатион Штрафной Удар">
                use21008(player, ctrl);
                break; //Упаковка: Агатион Штрафной Удар">
            case 21024:   //Упаковка: Африканский Парик-Мяч (Белый)">
                use21024(player, ctrl);
                break; //Упаковка: Африканский Парик-Мяч (Белый)">
            case 21025:   //Упаковка: Африканский Парик-Мяч (Синий)">
                use21025(player, ctrl);
                break; //Упаковка: Африканский Парик-Мяч (Синий)">
            case 21026:   //Упаковка: Африканский Парик-Мяч (Красный) - Благословение Победы">
                use21026(player, ctrl);
                break; //Упаковка: Африканский Парик-Мяч (Красный) - Благословение Победы">
            case 21027:   //Упаковка: Марка Победы (Корея)">
                use21027(player, ctrl);
                break; //Упаковка: Марка Победы (Корея)">
            case 21028:   //Упаковка: Марка Победы (Япония)">
                use21028(player, ctrl);
                break; //Упаковка: Марка Победы (Япония)">
            case 21029:   //Упаковка: Марка Поддержки">
                use21029(player, ctrl);
                break; //Упаковка: Марка Поддержки">
            case 21063:   //Упаковка: Национальная Шляпа (7 дн.)">
                use21063(player, ctrl);
                break; //Упаковка: Национальная Шляпа (7 дн.)">
            case 21064:   //Упаковка: Национальная Шляпа">
                use21064(player, ctrl);
                break; //Упаковка: Национальная Шляпа">
            case 21065:   //Упаковка: Шапка Тигрицы-Старушки">
                use21065(player, ctrl);
                break; //Упаковка: Шапка Тигрицы-Старушки">
            case 21066:   //Упаковка: Шапка Пчелы-Труженицы">
                use21066(player, ctrl);
                break; //Упаковка: Шапка Пчелы-Труженицы">
            case 21067:   //Упаковка: Агатион Тигрица-Старушка (7 дн.)">
                use21067(player, ctrl);
                break; //Упаковка: Агатион Тигрица-Старушка (7 дн.)">
            case 21068:   //Упаковка: Агатион Тигрица-Старушка">
                use21068(player, ctrl);
                break; //Упаковка: Агатион Тигрица-Старушка">
            case 21069:   //Упаковка: Агатион Фея Цветов">
                use21069(player, ctrl);
                break; //Упаковка: Агатион Фея Цветов">
            case 21070:   //Упаковка: Агатион Болельщица Ородриэль (7 дн.)">
                use21070(player, ctrl);
                break; //Упаковка: Агатион Болельщица Ородриэль (7 дн.)">
            case 21071:   //Упаковка: Агатион Болельщица Ородриэль">
                use21071(player, ctrl);
                break; //Упаковка: Агатион Болельщица Ородриэль">
            case 21072:   //Упаковка: Агатион Болельщица Лана (7 дн.)">
                use21072(player, ctrl);
                break; //Упаковка: Агатион Болельщица Лана (7 дн.)">
            case 21073:   //Упаковка: Агатион Болельщица Лана">
                use21073(player, ctrl);
                break; //Упаковка: Агатион Болельщица Лана">
            case 21074:   //Упаковка: Агатион Болельщица Наонин (7 дн.)">
                use21074(player, ctrl);
                break; //Упаковка: Агатион Болельщица Наонин (7 дн.)">
            case 21075:   //Упаковка: Агатион Болельщица Наонин">
                use21075(player, ctrl);
                break; //Упаковка: Агатион Болельщица Наонин">
            case 21076:   //Упаковка: Агатион Болельщица Мортия (7 дн.)">
                use21076(player, ctrl);
                break; //Упаковка: Агатион Болельщица Мортия (7 дн.)">
            case 21077:   //Упаковка: Агатион Болельщица Мортия">
                use21077(player, ctrl);
                break; //Упаковка: Агатион Болельщица Мортия">
            case 21078:   //Упаковка: Агатион Болельщица Каурин (7 дн.)">
                use21078(player, ctrl);
                break; //Упаковка: Агатион Болельщица Каурин (7 дн.)">
            case 21079:   //Упаковка: Агатион Болельщица Каурин">
                use21079(player, ctrl);
                break; //Упаковка: Агатион Болельщица Каурин">
            case 21080:   //Упаковка: Агатион Болельщица Мерурил (7 дн.)">
                use21080(player, ctrl);
                break; //Упаковка: Агатион Болельщица Мерурил (7 дн.)">
            case 21081:   //Упаковка: Агатион Болельщица Мерурил">
                use21081(player, ctrl);
                break; //Упаковка: Агатион Болельщица Мерурил">
            case 21082:   //Упаковка: Агатион Ханди (7 дн.)">
                use21082(player, ctrl);
                break; //Упаковка: Агатион Ханди (7 дн.)">
            case 21083:   //Упаковка: Агатион Ханди">
                use21083(player, ctrl);
                break; //Упаковка: Агатион Ханди">
            case 21085:   //Упаковка: Руна Опыта 30% (1 ч.)">
                use21085(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (1 ч.)">
            case 21087:   //Упаковка: Руна SP 30% (1 ч.)">
                use21087(player, ctrl);
                break; //Упаковка: Руна SP 30% (1 ч.)">
            case 21089:   //Упаковка: Реактивный Мотоцикл">
                use21089(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл">
            case 21091:   //Упаковка: Руна Опыта 50% (7 дн.)">
                use21091(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (7 дн.)">
            case 21092:   //Упаковка: Руна SP 50% (7 дн.)">
                use21092(player, ctrl);
                break; //Упаковка: Руна SP 50% (7 дн.)">
            case 21095:   //Упаковка: Обруч Льда">
                use21095(player, ctrl);
                break; //Упаковка: Обруч Льда">
            case 21601:   //Упаковка: Руна Опыта 30% (5 ч.)">
                use21601(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (5 ч.)">
            case 21602:   //Упаковка: Руна Опыта 50% (5 ч.)">
                use21602(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (5 ч.)">
            case 21603:   //Упаковка: Руна Опыта 30% (10 ч.)">
                use21603(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (10 ч.)">
            case 21604:   //Упаковка: Руна Опыта 50% (10 ч.)">
                use21604(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (10 ч.)">
            case 21605:   //Упаковка: Руна Опыта 30% (7 дней)">
                use21605(player, ctrl);
                break; //Упаковка: Руна Опыта 30% (7 дней)">
            case 21606:   //Упаковка: Руна Опыта 50% (7 дней)">
                use21606(player, ctrl);
                break; //Упаковка: Руна Опыта 50% (7 дней)">
            case 21607:   //Упаковка: Руна SP 30% (5 ч.)">
                use21607(player, ctrl);
                break; //Упаковка: Руна SP 30% (5 ч.)">
            case 21608:   //Упаковка: Руна SP 50% (5 ч.)">
                use21608(player, ctrl);
                break; //Упаковка: Руна SP 50% (5 ч.)">
            case 21609:   //Упаковка: Руна SP 30% (10 ч.)">
                use21609(player, ctrl);
                break; //Упаковка: Руна SP 30% (10 ч.)">
            case 21610:   //Упаковка: Руна SP 50% (10 ч.)">
                use21610(player, ctrl);
                break; //Упаковка: Руна SP 50% (10 ч.)">
            case 21611:   //Упаковка: Руна SP 30% (7 дн.)">
                use21611(player, ctrl);
                break; //Упаковка: Руна SP 30% (7 дн.)">
            case 21612:   //Упаковка: Руна SP 50% (7 дн.)">
                use21612(player, ctrl);
                break; //Упаковка: Руна SP 50% (7 дн.)">
            case 21613:   //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
                use21613(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
            case 21614:   //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
                use21614(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
            case 21615:   //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
                use21615(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
            case 21616:   //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
                use21616(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
            case 21617:   //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
                use21617(player, ctrl);
                break; //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
            case 21618:   //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
                use21618(player, ctrl);
                break; //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
            case 21619:   //Упаковка: Руна Пера (24 ч.)">
                use21619(player, ctrl);
                break; //Упаковка: Руна Пера (24 ч.)">
            case 21620:   //Упаковка: Камень: Модифицировать Оружие (D)">
                use21620(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (D)">
            case 21621:   //Упаковка: Камень: Модифицировать Оружие (С)">
                use21621(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (С)">
            case 21622:   //Упаковка: Камень: Модифицировать Оружие (В)">
                use21622(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (В)">
            case 21623:   //Упаковка: Камень: Модифицировать Оружие (А)">
                use21623(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (А)">
            case 21624:   //Упаковка: Камень: Модифицировать Оружие (S)">
                use21624(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Оружие (S)">
            case 21625:   //Упаковка: Камень: Модифицировать Доспех (D)">
                use21625(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (D)">
            case 21626:   //Упаковка: Камень: Модифицировать Доспех (С)">
                use21626(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (С)">
            case 21627:   //Упаковка: Камень: Модифицировать Доспех (В)">
                use21627(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (В)">
            case 21628:   //Упаковка: Камень: Модифицировать Доспех (А)">
                use21628(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (А)">
            case 21629:   //Упаковка: Камень: Модифицировать Доспех (S)">
                use21629(player, ctrl);
                break; //Упаковка: Камень: Модифицировать Доспех (S)">
            case 21630:   //Упаковка: Зелье Поддержания Энергии">
                use21630(player, ctrl);
                break; //Упаковка: Зелье Поддержания Энергии">
            case 21631:   //Упаковка: Зелье Всплеска Энергии">
                use21631(player, ctrl);
                break; //Упаковка: Зелье Всплеска Энергии">
            case 21632:   //Упаковка: Коктейль из Сладких Фруктов">
                use21632(player, ctrl);
                break; //Упаковка: Коктейль из Сладких Фруктов">
            case 21633:   //Упаковка: Коктейль из Свежих Фруктов">
                use21633(player, ctrl);
                break; //Упаковка: Коктейль из Свежих Фруктов">
            case 21634:   //Упаковка: Браслет Сиреневого Коня (7 дн.)">
                use21634(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня (7 дн.)">
            case 21635:   //Упаковка: Браслет Сиреневого Коня (30 дн.)">
                use21635(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня (30 дн.)">
            case 21636:   //Упаковка: Браслет Сиреневого Коня">
                use21636(player, ctrl);
                break; //Упаковка: Браслет Сиреневого Коня">
            case 21637:   //Упаковка: Браслет Парового Жука (7 дн.)">
                use21637(player, ctrl);
                break; //Упаковка: Браслет Парового Жука (7 дн.)">
            case 21638:   //Упаковка: Браслет Парового Жука (30 дн.)">
                use21638(player, ctrl);
                break; //Упаковка: Браслет Парового Жука (30 дн.)">
            case 21639:   //Упаковка: Браслет Парового Жука">
                use21639(player, ctrl);
                break; //Упаковка: Браслет Парового Жука">
            case 21640:   //Упаковка: Браслет Златогривого Льва (30 дн.)">
                use21640(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва (30 дн.)">
            case 21641:   //Упаковка: Браслет Златогривого Льва">
                use21641(player, ctrl);
                break; //Упаковка: Браслет Златогривого Льва">
            case 21642:   //Упаковка: Реактивный Мотоцикл (7 дн.)">
                use21642(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл (7 дн.)">
            case 21643:   //Упаковка: Реактивный Мотоцикл (30 дн.)">
                use21643(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл (30 дн.)">
            case 21644:   //Упаковка: Реактивный Мотоцикл">
                use21644(player, ctrl);
                break; //Упаковка: Реактивный Мотоцикл">
            case 21645:   //Упаковка: Шляпа Наполеона (7 дн.) - Регенерация Маны">
                use21645(player, ctrl);
                break; //Упаковка: Шляпа Наполеона (7 дн.) - Регенерация Маны">
            case 21646:   //Упаковка: Шляпа Наполеона">
                use21646(player, ctrl);
                break; //Упаковка: Шляпа Наполеона">
            case 21647:   //Упаковка: Рожки (7 дн.) - Отражение Урона">
                use21647(player, ctrl);
                break; //Упаковка: Рожки (7 дн.) - Отражение Урона">
            case 21648:   //Упаковка: Рожки">
                use21648(player, ctrl);
                break; //Упаковка: Рожки">
            case 21649:   //Упаковка: Маска из Черных Камней (7 дн.) - Энергия">
                use21649(player, ctrl);
                break; //Упаковка: Маска из Черных Камней (7 дн.) - Энергия">
            case 21650:   //Упаковка: Маска из Черных Камней">
                use21650(player, ctrl);
                break; //Упаковка: Маска из Черных Камней">
            case 21651:   //Упаковка: Пластиковый Парик (7 дн.) - Благ. Телепорт">
                use21651(player, ctrl);
                break; //Упаковка: Пластиковый Парик (7 дн.) - Благ. Телепорт">
            case 21652:   //Упаковка: Пластиковый Парик">
                use21652(player, ctrl);
                break; //Упаковка: Пластиковый Парик">
            case 21653:   //Упаковка: Заколка Маргаритка (7 дн.) - Сопротивление Тьме">
                use21653(player, ctrl);
                break; //Упаковка: Заколка Маргаритка (7 дн.) - Сопротивление Тьме">
            case 21654:   //Упаковка: Заколка Маргаритка">
                use21654(player, ctrl);
                break; //Упаковка: Заколка Маргаритка">
            case 21655:   //Упаковка: Заколка Незабудка (7 дн.) - Легкая Походка">
                use21655(player, ctrl);
                break; //Упаковка: Заколка Незабудка (7 дн.) - Легкая Походка">
            case 21656:   //Упаковка: Заколка Незабудка">
                use21656(player, ctrl);
                break; //Упаковка: Заколка Незабудка">
            case 21657:   //Упаковка: Глазная Повязка Бандита (7 дн.) - Шепот Смерти">
                use21657(player, ctrl);
                break; //Упаковка: Глазная Повязка Бандита (7 дн.) - Шепот Смерти">
            case 21658:   //Упаковка: Глазная Повязка Бандита">
                use21658(player, ctrl);
                break; //Упаковка: Глазная Повязка Бандита">
            case 21659:   //Упаковка: Глазная Повязка Пирата (7 дн.) - Проворство">
                use21659(player, ctrl);
                break; //Упаковка: Глазная Повязка Пирата (7 дн.) - Проворство">
            case 21660:   //Упаковка: Глазная Повязка Пирата">
                use21660(player, ctrl);
                break; //Упаковка: Глазная Повязка Пирата">
            case 21661:   //Упаковка: Монокль (7 дн.) - Дикая Магия">
                use21661(player, ctrl);
                break; //Упаковка: Монокль (7 дн.) - Дикая Магия">
            case 21662:   //Упаковка: Монокль">
                use21662(player, ctrl);
                break; //Упаковка: Монокль">
            case 21663:   //Упаковка: Маска Духов (7 дн.) - Регенерация Маны">
                use21663(player, ctrl);
                break; //Упаковка: Маска Духов (7 дн.) - Регенерация Маны">
            case 21664:   //Упаковка: Маска Духов">
                use21664(player, ctrl);
                break; //Упаковка: Маска Духов">
            case 21665:   //Упаковка: Рога Демона (7 дн.) - Отражение Урона">
                use21665(player, ctrl);
                break; //Упаковка: Рога Демона (7 дн.) - Отражение Урона">
            case 21666:   //Упаковка: Рога Демона">
                use21666(player, ctrl);
                break; //Упаковка: Рога Демона">
            case 21667:   //Упаковка: Карнавальная Маска (7 дн.) - Великое Лечение">
                use21667(player, ctrl);
                break; //Упаковка: Карнавальная Маска (7 дн.) - Великое Лечение">
            case 21668:   //Упаковка: Карнавальная Маска">
                use21668(player, ctrl);
                break; //Упаковка: Карнавальная Маска">
            case 21669:   //Упаковка: Красная Карнавальная Маска (7 дн.) - Сопротивление Тьме">
                use21669(player, ctrl);
                break; //Упаковка: Красная Карнавальная Маска (7 дн.) - Сопротивление Тьме">
            case 21670:   //Упаковка: Красная Карнавальная Маска">
                use21670(player, ctrl);
                break; //Упаковка: Красная Карнавальная Маска">
            case 21671:   //Упаковка: Кошачьи Ушки (7 дн.) - Легкая Походка">
                use21671(player, ctrl);
                break; //Упаковка: Кошачьи Ушки (7 дн.) - Легкая Походка">
            case 21672:   //Упаковка: Кошачьи Ушки">
                use21672(player, ctrl);
                break; //Упаковка: Кошачьи Ушки">
            case 21673:   //Упаковка: Заколка Леди (7 дн.) - Шепот Смерти">
                use21673(player, ctrl);
                break; //Упаковка: Заколка Леди (7 дн.) - Шепот Смерти">
            case 21674:   //Упаковка: Заколка Леди">
                use21674(player, ctrl);
                break; //Упаковка: Заколка Леди">
            case 21675:   //Упаковка: Ушки Енота (7 дн.) - Проворство">
                use21675(player, ctrl);
                break; //Упаковка: Ушки Енота (7 дн.) - Проворство">
            case 21676:   //Упаковка: Ушки Енота">
                use21676(player, ctrl);
                break; //Упаковка: Ушки Енота">
            case 21677:   //Упаковка: Ушки Кролика (7 дн.) - Дикая Магия">
                use21677(player, ctrl);
                break; //Упаковка: Ушки Кролика (7 дн.) - Дикая Магия">
            case 21678:   //Упаковка: Ушки Кролика">
                use21678(player, ctrl);
                break; //Упаковка: Ушки Кролика">
            case 21679:   //Упаковка: Крылышко Ангела (7 дн.) - Регенерация Маны">
                use21679(player, ctrl);
                break; //Упаковка: Крылышко Ангела (7 дн.) - Регенерация Маны">
            case 21680:   //Упаковка: Крылышко Ангела">
                use21680(player, ctrl);
                break; //Упаковка: Крылышко Ангела">
            case 21681:   //Упаковка: Антенки Феи (7 дн.) - Отражение Урона">
                use21681(player, ctrl);
                break; //Упаковка: Антенки Феи (7 дн.) - Отражение Урона">
            case 21682:   //Упаковка: Антенки Феи">
                use21682(player, ctrl);
                break; //Упаковка: Антенки Феи">
            case 21683:   //Упаковка: Украшенная Перьями Шляпа (7 дн.) - Великое Лечение">
                use21683(player, ctrl);
                break; //Упаковка: Украшенная Перьями Шляпа (7 дн.) - Великое Лечение">
            case 21684:   //Упаковка: Украшенная Перьями Шляпа">
                use21684(player, ctrl);
                break; //Упаковка: Украшенная Перьями Шляпа">
            case 21685:   //Упаковка: Защитные Очки Ремесленника (7 дн.) - Энергия">
                use21685(player, ctrl);
                break; //Упаковка: Защитные Очки Ремесленника (7 дн.) - Энергия">
            case 21686:   //Упаковка: Защитные Очки Ремесленника">
                use21686(player, ctrl);
                break; //Упаковка: Защитные Очки Ремесленника">
            case 22187:   //Подарочная Коробка Радости Дня Рождения">
                use22187(player, ctrl);
                break; //Подарочная Коробка Радости Дня Рождения">
            case 33468:   //Сундук Поддержки Героя">
                use33468(player, ctrl);
                break; //Сундук Поддержки Героя">
            case 33493:   //Ящик Поддержки Усиления Стихий">
                use33493(player, ctrl);
                break; //Ящик Поддержки Усиления Стихий">
            case 33495:   //Сундук Оружия Реквиема - Обычный">
                use33495(player, ctrl);
                break; //Сундук Оружия Реквиема - Обычный">
            case 33496:   //Сундук Тяжелых Доспехов Бессмертия - Обычный">
                use33496(player, ctrl);
                break; //Сундук Тяжелых Доспехов Бессмертия - Обычный">
            case 33497:   //Сундук Легких Доспехов Бессмертия - Обычный">
                use33497(player, ctrl);
                break; //Сундук Легких Доспехов Бессмертия - Обычный">
            case 33498:   //Сундук Магических Доспехов Бессмертия - Обычный">
                use33498(player, ctrl);
                break; //Сундук Магических Доспехов Бессмертия - Обычный">
            case 33499:   //Сундук Аксессуаров Бессмертия - Обычный">
                use33499(player, ctrl);
                break; //Сундук Аксессуаров Бессмертия - Обычный">
            case 34927: // Синий Сундук Странника Мира
                use34927(player, ctrl);
                break;
            case 34928: // Красный Сундук Хранителя Мира
                use34928(player, ctrl);
                break;
            case 34929: // Золотистый Сундук Хранителя Мира
                use34929(player, ctrl);
                break;
            case 34930: // Синий Сундук Странника Мира
                use34930(player, ctrl);
                break;
            case 34931: // Красный Сундук Странника Мира
                use34931(player, ctrl);
                break;
            case 34932: // Золотистый Сундук Странника Мира
                use34932(player, ctrl);
                break;
            case 34855: // Сундук Реан
                use34855(player, ctrl);
                break;
            case 32789: // Мешочек с оружием R99
                use32789(player, ctrl);
                break;
            case 32788: // Мешочек с оружием R95
                use32788(player, ctrl);
                break;
            case 32787: // Мешочек с оружием R
                use32787(player, ctrl);
                break;
            case 32786: // Мешочек с оружием S
                use32786(player, ctrl);
                break;
            case 32785: // Мешочек с оружием A
                use32785(player, ctrl);
                break;
            case 32784: // Мешочек с оружием B
                use32784(player, ctrl);
                break;
            case 32783: // Мешочек с оружием C
                use32783(player, ctrl);
                break;
            case 32782: // Мешочек с оружием D
                use32782(player, ctrl);
                break;
            case 32797: // Мешочек с доспехм R99
                use32797(player, ctrl);
                break;
            case 32796: // Мешочек с доспехом R95
                use32796(player, ctrl);
                break;
            case 32795: // Мешочек с доспехом R
                use32795(player, ctrl);
                break;
            case 32794: // Мешочек с доспехом S
                use32794(player, ctrl);
                break;
            case 32793: // Мешочек с доспехом A
                use32793(player, ctrl);
                break;
            case 32792: // Мешочек с доспехом B
                use32792(player, ctrl);
                break;
            case 32791: // Мешочек с доспехом C
                use32791(player, ctrl);
                break;
            case 32790: // Мешочек с доспехом D
                use32790(player, ctrl);
                break;
            /**
             *@Mazaffaka
             *@01.04.2013
             *@Мешочки с усилками
             **/
            case 32228: // Мешочек с Усилителем D
                use32228(player, ctrl);
                break;
            case 32242: // Мешочек с Усилителем C(46)
                use32242(player, ctrl);
                break;
            case 32229: // Мешочек с Усилителем C(49)
                use32229(player, ctrl);
                break;
            case 32230: // Мешочек с Усилителем B(52)
                use32230(player, ctrl);
                break;
            case 32231: // Мешочек с Усилителем B(55)
                use32231(player, ctrl);
                break;
            case 32232: // Мешочек с Усилителем B(58)
                use32232(player, ctrl);
                break;
            case 32233: // Мешочек с Усилителем A(61)
                use32233(player, ctrl);
                break;
            case 32234: // Мешочек с Усилителем A(64)
                use32234(player, ctrl);
                break;
            case 32235: // Мешочек с Усилителем A(67)
                use32235(player, ctrl);
                break;
            case 32236: // Мешочек с Усилителем A(70)
                use32236(player, ctrl);
                break;
            case 32237: // Мешочек с Усилителем A(75)
                use32237(player, ctrl);
                break;
            case 32238: // Мешочек с Усилителем S(80)
                use32238(player, ctrl);
                break;
            case 32239: // Мешочек с Усилителем S(82)
                use32239(player, ctrl);
                break;
            case 32240: // Мешочек с Усилителем S(84)
                use32240(player, ctrl);
                break;
            case 32779: // Мешочек с Усилителем - R
                use32779(player, ctrl);
                break;
            case 32780: // Мешочек с Усилителем - R95
                use32780(player, ctrl);
                break;
            case 32781: // Мешочек с Усилителем - R99
                use32781(player, ctrl);
                break;
            case 34861: // Мешочек с Усилителем и Материалами
                use34861(player, ctrl);
                break;
            case 14767:
                use14767(player, ctrl);
                break;
            case 14766:
                use14766(player, ctrl);
                break;
            case 14729:
                use14729(player, ctrl);
                break;
            case 20097:
                use20097(player, ctrl);
                break;
            case 20629:
                use20629(player, ctrl);
                break;
            case 14638:
                use14638(player, ctrl);
                break;
            case 14637:
                use14637(player, ctrl);
                break;
            case 14636:
                use14636(player, ctrl);
                break;
            case 14635:
                use14635(player, ctrl);
                break;
            case 14677:
                use14677(player, ctrl);
                break;
            case 14676:
                use14676(player, ctrl);
                break;
            case 20277:
                use20277(player, ctrl);
                break;
            case 20271:
                use20271(player, ctrl);
                break;
            case 20739:
                use20739(player, ctrl);
                break;
            case 13428:
                use13428(player, ctrl);
                break;
            case 13427:
                use13427(player, ctrl);
                break;
            case 13426:
                use13426(player, ctrl);
                break;
            case 13425:
                use13425(player, ctrl);
                break;
            case 13424:
                use13424(player, ctrl);
                break;
            case 13423:
                use13423(player, ctrl);
                break;
            case 13422:
                use13422(player, ctrl);
                break;
            case 10259:
                use10259(player, ctrl);
                break;
            case 10258:
                use10258(player, ctrl);
                break;
            case 10257:
                use10257(player, ctrl);
                break;
            case 10256:
                use10256(player, ctrl);
                break;
            case 10255:
                use10255(player, ctrl);
                break;
            case 15376:
                use15376(player, ctrl);
                break;
            case 15372:
                use15372(player, ctrl);
                break;
            case 8547:
                use8547(player, ctrl);
                break;
            case 8551:
                use8551(player, ctrl);
                break;
            case 8570:
                use8570(player, ctrl);
                break;
            case 8571:
                use8571(player, ctrl);
                break;
            case 8572:
                use8572(player, ctrl);
                break;
            case 8573:
                use8573(player, ctrl);
                break;
            case 8574:
                use8574(player, ctrl);
                break;
            case 8575:
                use8575(player, ctrl);
                break;
            case 8966:
                use8966(player, ctrl);
                break;
            case 8967:
                use8967(player, ctrl);
                break;
            case 8968:
                use8968(player, ctrl);
                break;
            case 8969:
                use8969(player, ctrl);
                break;
            case 8970:
                use8970(player, ctrl);
                break;
            case 8971:
                use8971(player, ctrl);
                break;
            case 9104:
                use9104(player, ctrl);
                break;
            case 9105:
                use9105(player, ctrl);
                break;
            case 9106:
                use9106(player, ctrl);
                break;
            case 9107:
                use9107(player, ctrl);
                break;
            case 9108:
                use9108(player, ctrl);
                break;
            case 9109:
                use9109(player, ctrl);
                break;
            case 9110:
                use9110(player, ctrl);
                break;
            case 9111:
                use9111(player, ctrl);
                break;
            case 9112:
                use9112(player, ctrl);
                break;
            case 9113:
                use9113(player, ctrl);
                break;
            case 9114:
                use9114(player, ctrl);
                break;
            case 9115:
                use9115(player, ctrl);
                break;
            case 9116:
                use9116(player, ctrl);
                break;
            case 9117:
                use9117(player, ctrl);
                break;
            case 9118:
                use9118(player, ctrl);
                break;
            case 9119:
                use9119(player, ctrl);
                break;
            case 9120:
                use9120(player, ctrl);
                break;
            case 9121:
                use9121(player, ctrl);
                break;
            case 9122:
                use9122(player, ctrl);
                break;
            case 9123:
                use9123(player, ctrl);
                break;
            case 9124:
                use9124(player, ctrl);
                break;
            case 9125:
                use9125(player, ctrl);
                break;
            case 9126:
                use9126(player, ctrl);
                break;
            case 9127:
                use9127(player, ctrl);
                break;
            case 9130:
                use9130(player, ctrl);
                break;
            case 9131:
                use9131(player, ctrl);
                break;
            case 9132:
                use9132(player, ctrl);
                break;
            case 9133:
                use9133(player, ctrl);
                break;
            case 9134:
                use9134(player, ctrl);
                break;
            case 9135:
                use9135(player, ctrl);
                break;
            case 9144:
                use9144(player, ctrl);
                break;
            case 10205:
                use10205(player, ctrl);
                break;
            case 10206:
                use10206(player, ctrl);
                break;
            case 10254:
                use10254(player, ctrl);
                break;
            case 21225:
                use21225(player, ctrl);
                break;
            case 21226:
                use21226(player, ctrl);
                break;
            case 21229:
                use21229(player, ctrl);
                break;
            case 21230:
                use21230(player, ctrl);
                break;
            case 21233:
                use21233(player, ctrl);
                break;
            case 21234:
                use21234(player, ctrl);
                break;
            case 21237:
                use21237(player, ctrl);
                break;
            case 21238:
                use21238(player, ctrl);
                break;
            case 21240:
                use21240(player, ctrl);
                break;
            case 15434:
                use15434(player, ctrl);
                break;
            case 15435:
                use15435(player, ctrl);
                break;
            case 15437:
                use15437(player, ctrl);
                break;
            case 21421:
                use21421(player, ctrl);
                break;
            case 21422:
                use21422(player, ctrl);
                break;
            case 21241:
                use21241(player, ctrl);
                break;

            //////////////
            /*  case 22565: //	Упаковка: Снабжение Витаминами     //21279,2;
 use22565(player, ctrl);
 break;
case 22566: //	Упаковка: Снабжение Зельями
 use22566(player, ctrl);
 break;
case 22567: //	Упаковка: Снабжение Предметами
 use22567(player, ctrl);
 break;
case 22568: //	Упаковка Развития
 use22568(player, ctrl);
 break;
case 22569: //	Упаковка Путешествий
 use22569(player, ctrl);
 break;
case 22570: //	Упаковка Судьбы
 use22570(player, ctrl);
 break;
case 22571: //	Сундук Агатиона
 use22571(player, ctrl);
 break;
case 22572: //	Упаковка: Заряды Души R (10 000)
 use22572(player, ctrl);
 break;
case 22573: //	Упаковка: Благ. Заряды Духа R (10 000)
 use22573(player, ctrl);
 break;
case 22574: //	Упаковка: Заряды Души R (3000)
 use22574(player, ctrl);
 break;
case 22575: //	Упаковка: Благ. Заряды Духа R (3000)
 use22575(player, ctrl);
 break;
case 22576: //	Упаковка: Чудесные Заряды Души S (10 000)
 use22576(player, ctrl);
 break;
case 22577: //	Упаковка: Чудесные Благ. Заряды Духа S (10 000)
 use22577(player, ctrl);
 break;
case 22578: //	Сундук Оружия C (30 дн.)
 use22578(player, ctrl);
 break;
case 22579: //	Сундук Оружия B (30 дн.)
 use22579(player, ctrl);
 break;
case 22580: //	Сундук Оружия A (30 дн.)
 use22580(player, ctrl);
 break;
case 22581: //	Сундук Оружия S (90 дн.)
 use22581(player, ctrl);
 break;
case 22582: //	Сундук Доспехов D (30 дн.)
 use22582(player, ctrl);
 break;
case 22583: //	Сундук Доспехов C (30 дн.)
 use22583(player, ctrl);
 break;
case 22584: //	Сундук Доспехов B (30 дн.)
 use22584(player, ctrl);
 break;
case 22585: //	Сундук Доспехов A (30 дн.)
 use22585(player, ctrl);
 break;
case 22586: //	Сундук Доспехов S (90 дн.)
 use22586(player, ctrl);
 break;
case 22587: //	Сундук Оружия D (30 дн.)
 use22587(player, ctrl);
 break;
case 22588: //	Энергия Ростка
 use22588(player, ctrl);
 break;
case 22589: //	Упаковка: Энергия Ростка (3 шт.)
 use22589(player, ctrl);
 break;
case 22590: //	Упаковка: Чудесные Заряды Души D (10 000)
 use22590(player, ctrl);
 break;
case 22591: //	Упаковка: Чудесные Заряды Души D (5000)
 use22591(player, ctrl);
 break;
case 22592: //	Упаковка: Чудесные Заряды Души C (10 000)
 use22592(player, ctrl);
 break;
case 22593: //	Упаковка: Чудесные Заряды Души C (5000)
 use22593(player, ctrl);
 break;
case 22594: //	Упаковка: Чудесные Заряды Души B (10 000)
 use22594(player, ctrl);
 break;
case 22595: //	Упаковка: Чудесные Заряды Души B (5000)
 use22595(player, ctrl);
 break;
case 22596: //	Упаковка: Чудесные Заряды Души A (10 000)
 use22596(player, ctrl);
 break;
case 22597: //	Упаковка: Чудесные Заряды Души A (5000)
 use22597(player, ctrl);
 break;
case 22598: //	Упаковка: Чудесные Заряды Духа D (10 000)
 use22598(player, ctrl);
 break;
case 22599: //	Упаковка: Чудесные Заряды Духа D (5000)
 use22599(player, ctrl);
 break;
case 22600: //	Упаковка: Чудесные Заряды Духа C (10 000)
 use22600(player, ctrl);
 break;
case 22601: //	Упаковка: Чудесные Заряды Духа C (5000)
 use22601(player, ctrl);
 break;
case 22602: //	Упаковка: Чудесные Заряды Духа B (10 000)
 use22602(player, ctrl);
 break;
case 22603: //	Упаковка: Чудесные Заряды Духа B (5000)
 use22603(player, ctrl);
 break;
case 22604: //	Упаковка: Чудесные Заряды Духа A (10 000)
 use22604(player, ctrl);
 break;
case 22605: //	Упаковка: Чудесные Заряды Духа A (5000)
 use22605(player, ctrl);
 break;
case 22606: //	Упаковка: Чудесные Заряды Духа S (10 000)
 use22606(player, ctrl);
 break;
case 22607: //	Упаковка: Чудесные Заряды Духа S (5000)
 use22607(player, ctrl);
 break;
case 22608: //	Упаковка: Зелье Поддержания Энергии 30 мин. (2 шт.)
 use22608(player, ctrl);
 break;
case 22609: //	Упаковка: Зелье Поддержания Энергии 30 мин. (4 шт.)
 use22609(player, ctrl);
 break;
case 22610: //	Наилучший Коктейль
 use22610(player, ctrl);
 break;
case 22612: //	Упаковка: Руна Опыта 30% (3 ч.)
 use22612(player, ctrl);
 break;
case 22613: //	Упаковка: Руна Опыта 30% (1 ч.)
 use22613(player, ctrl);
 break;
case 22614: //	Упаковка: Руна Опыта 50% (1 ч.)
 use22614(player, ctrl);
 break;
case 22615: //	Билет в Окрестности Камалоки
 use22615(player, ctrl);
 break;
case 22616: //	Комплект Величия - Артефакт Дружбы
 use22616(player, ctrl);
 break;
case 22617: //	Комплект Черного Снаряжения - Артефакт Дружбы
 use22617(player, ctrl);
 break;
case 22618: //	Комплект Печати - Артефакт Дружбы
 use22618(player, ctrl);
 break;
case 22619: //	Упаковка: Аксессуары Династии (Ранг S) - Артефакт Дружбы
 use22619(player, ctrl);
 break;           */
            default:
                return false;
        }

        return true;
    }

    // ------ Adventurer's Boxes ------

    // Adventurer's Box: C-Grade Accessory (Low Grade)
    private void use8534(Player player, boolean ctrl) {
        int[] list = new int[]{853, 916, 884};
        int[] chances = new int[]{17, 17, 17};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Hero's Blessed Enchant Scroll Box
    private void use34696(Player player, boolean ctrl) {
        int[][] list = new int[][]{{19447, 1}, {19448, 1}, {6577, 1}, {6578, 1}, {6569, 1}, {6570, 1}};
        double[] chances = new double[]{5.55555, 9.01515, 14.55555, 21.01515, 34.16666, 41.86999};
        extractRandomOneItem(player, list, chances);
    }

    // Adventurer's Box: C-Grade Accessory (Medium Grade)
    private void use8535(Player player, boolean ctrl) {
        int[] list = new int[]{854, 917, 885};
        int[] chances = new int[]{17, 17, 17};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Adventurer's Box: C-Grade Accessory (High Grade)
    private void use8536(Player player, boolean ctrl) {
        int[] list = new int[]{855, 119, 886};
        int[] chances = new int[]{17, 17, 17};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Adventurer's Box: B-Grade Accessory (Low Grade)
    private void use8537(Player player, boolean ctrl) {
        int[] list = new int[]{856, 918, 887};
        int[] chances = new int[]{17, 17, 17};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Adventurer's Box: B-Grade Accessory (High Grade)
    private void use8538(Player player, boolean ctrl) {
        int[] list = new int[]{864, 926, 895};
        int[] chances = new int[]{17, 17, 17};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Adventurer's Box: Hair Accessory
    private void use8539(Player player, boolean ctrl) {
        int[] list = new int[]{8179, 8178, 8177};
        int[] chances = new int[]{10, 20, 30};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Adventurer's Box: Cradle of Creation
    private void use8540(Player player, boolean ctrl) {
        if (Rnd.chance(30))
            Functions.addItem(player, 8175, 1);
    }

    // Quest 370: A Wiseman Sows Seeds
    private void use5916(Player player, boolean ctrl) {
        int[] list = new int[]{5917, 5918, 5919, 5920, 736};
        int[] counts = new int[]{1, 1, 1, 1, 1};
        extract_item(list, counts, player);
    }

    // Quest 376: Giants Cave Exploration, Part 1
    private void use5944(Player player, boolean ctrl) {
        int[] list = {5922, 5923, 5924, 5925, 5926, 5927, 5928, 5929, 5930, 5931, 5932, 5933, 5934, 5935, 5936, 5937, 5938, 5939, 5940, 5941, 5942, 5943};
        int[] counts = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 5944, Functions.getItemCount(player, 5944));
            for (int[] res : mass_extract_item(item_count, list, counts, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item(list, counts, player);
    }

    // Quest 376: Giants Cave Exploration, Part 1
    private void use14841(Player player, boolean ctrl) {
        int[] list = {14836, 14837, 14838, 14839, 14840};
        int[] counts = {1, 1, 1, 1, 1};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 14841, Functions.getItemCount(player, 14841));
            for (int[] res : mass_extract_item(item_count, list, counts, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item(list, counts, player);
    }

    // Quest 377: Giants Cave Exploration, Part 2, old
    private void use5955(Player player, boolean ctrl) {
        int[] list = {5942, 5943, 5945, 5946, 5947, 5948, 5949, 5950, 5951, 5952, 5953, 5954};
        int[] counts = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 5955, Functions.getItemCount(player, 5955));
            for (int[] res : mass_extract_item(item_count, list, counts, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item(list, counts, player);
    }

    // Quest 377: Giants Cave Exploration, Part 2, new
    private void use14847(Player player, boolean ctrl) {
        int[] list = {14842, 14843, 14844, 14845, 14846};
        int[] counts = {1, 1, 1, 1, 1};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 14847, Functions.getItemCount(player, 14847));
            for (int[] res : mass_extract_item(item_count, list, counts, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item(list, counts, player);
    }

    // Quest 372: Legacy of Insolence
    private void use5966(Player player, boolean ctrl) {
        int[] list = new int[]{5970, 5971, 5977, 5978, 5979, 5986, 5993, 5994, 5995, 5997, 5983, 6001};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item(list, counts, player);
    }

    // Quest 372: Legacy of Insolence
    private void use5967(Player player, boolean ctrl) {
        int[] list = new int[]{5970, 5971, 5975, 5976, 5980, 5985, 5993, 5994, 5995, 5997, 5983, 6001};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item(list, counts, player);
    }

    // Quest 372: Legacy of Insolence
    private void use5968(Player player, boolean ctrl) {
        int[] list = new int[]{5973, 5974, 5981, 5984, 5989, 5990, 5991, 5992, 5996, 5998, 5999, 6000, 5988, 5983, 6001};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item(list, counts, player);
    }

    // Quest 372: Legacy of Insolence
    private void use5969(Player player, boolean ctrl) {
        int[] list = new int[]{5970, 5971, 5982, 5987, 5989, 5990, 5991, 5992, 5996, 5998, 5999, 6000, 5972, 6001};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item(list, counts, player);
    }

    /**
     * Quest 373: Supplier of Reagents, from Hallate's Maid, Reagent Pouch (Gray)
     * 2x Quicksilver (6019) 30%
     * 2x Moonstone Shard (6013) 30%
     * 1x Rotten Bone Piece (6014) 20%
     * 1x Infernium Ore (6016) 20%
     */
    private void use6007(Player player, boolean ctrl) {
        int[] list = new int[]{6019, 6013, 6014, 6016};
        int[] counts = new int[]{2, 2, 1, 1};
        int[] chances = new int[]{30, 30, 20, 20};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 6007, Functions.getItemCount(player, 6007));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    /**
     * Quest 373: Supplier of Reagents, from Platinum Tribe Shaman, Reagent Pouch (Yellow)
     * 2x Blood Root (6017) 10%
     * 2x Sulfur (6020) 20%
     * 1x Rotten Bone Piece (6014) 35%
     * 1x Infernium Ore (6016) 35%
     */
    private void use6008(Player player, boolean ctrl) {
        int[] list = new int[]{6017, 6020, 6014, 6016};
        int[] counts = new int[]{2, 2, 1, 1};
        int[] chances = new int[]{10, 20, 35, 35};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 6008, Functions.getItemCount(player, 6008));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    /**
     * Quest 373: Supplier of Reagents, from Hames Orc Shaman, Reagent Pouch (Brown)
     * 1x Lava Stone (6012) 20%
     * 2x Volcanic Ash (6018) 20%
     * 2x Quicksilver (6019) 20%
     * 1x Moonstone Shard (6013) 40%
     */
    private void use6009(Player player, boolean ctrl) {
        int[] list = new int[]{6012, 6018, 6019, 6013};
        int[] counts = new int[]{1, 2, 2, 1};
        int[] chances = new int[]{20, 20, 20, 40};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 6009, Functions.getItemCount(player, 6009));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    /**
     * Quest 373: Supplier of Reagents, from Platinum Guardian Shaman, Reagent Box
     * 2x Blood Root (6017) 20%
     * 2x Sulfur (6020) 20%
     * 1x Infernium Ore (6016) 35%
     * 2x Demon's Blood (6015) 25%
     */
    private void use6010(Player player, boolean ctrl) {
        int[] list = new int[]{6017, 6020, 6016, 6015};
        int[] counts = new int[]{2, 2, 1, 2};
        int[] chances = new int[]{20, 20, 35, 25};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 6010, Functions.getItemCount(player, 6010));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    // Quest 628: Hunt of Golden Ram
    private void use7725(Player player, boolean ctrl) {
        int[] list = new int[]{6035, 1060, 735, 1540, 1061, 1539};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1};
        int[] chances = new int[]{7, 39, 7, 3, 12, 32};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 7725, Functions.getItemCount(player, 7725));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    // Quest 628: Hunt of Golden Ram
    private void use7637(Player player, boolean ctrl) {
        int[] list = new int[]{4039, 4041, 4043, 4044, 4042, 4040};
        int[] counts = new int[]{4, 1, 4, 4, 2, 2};
        int[] chances = new int[]{20, 10, 20, 20, 15, 15};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 7637, Functions.getItemCount(player, 7637));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    // Quest 628: Hunt of Golden Ram
    private void use7636(Player player, boolean ctrl) {
        int[] list = new int[]{1875, 1882, 1880, 1874, 1877, 1881, 1879, 1876};
        int[] counts = new int[]{3, 3, 4, 1, 3, 1, 3, 6};
        int[] chances = new int[]{10, 20, 10, 10, 10, 12, 12, 16};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 7636, Functions.getItemCount(player, 7636));
            for (int[] res : mass_extract_item_r(item_count, list, counts, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - White Cargo box
    private void use7629(Player player, boolean ctrl) {
        int[] list = new int[]{6688, 6689, 6690, 6691, 6693, 6694, 6695, 6696, 6697, 7579, 57};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 330000};
        int[] chances = new int[]{9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Blue Cargo box #All chances of 8 should be 8.5, must be fixed if possible!!
    private void use7630(Player player, boolean ctrl) {
        int[] list = new int[]{6703, 6704, 6705, 6706, 6708, 6709, 6710, 6712, 6713, 6714, 57};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 292000};
        int[] chances = new int[]{8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 20};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Yellow Cargo box
    private void use7631(Player player, boolean ctrl) {
        int[] list = new int[]{6701, 6702, 6707, 6711, 57};
        int[] counts = new int[]{1, 1, 1, 1, 930000};
        int[] chances = new int[]{20, 20, 20, 20, 20};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Red Filing Cabinet
    private void use7632(Player player, boolean ctrl) {
        int[] list;
        list = new int[]{6857, 6859, 6861, 6863, 6867, 6869, 6871, 6875, 6877, 6879, 13100, 57};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 340000};
        int[] chances = new int[]{8, 9, 8, 9, 8, 9, 8, 9, 8, 9, 8, 7};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Purple Filing Cabinet
    private void use7633(Player player, boolean ctrl) {
        int[] list;
        list = new int[]{6853, 6855, 6865, 6873, 57};
        int[] counts = new int[]{1, 1, 1, 1, 850000};
        int[] chances = new int[]{20, 20, 20, 20, 20};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Brown Pouch
    private void use7634(Player player, boolean ctrl) {
        int[] list = new int[]{1874, 1875, 1876, 1877, 1879, 1880, 1881, 1882, 57};
        int[] counts = new int[]{20, 20, 20, 20, 20, 20, 20, 20, 150000};
        int[] chances = new int[]{10, 10, 16, 11, 10, 5, 10, 18, 10};
        extract_item_r(list, counts, chances, player);
    }

    // Looted Goods - Gray Pouch
    private void use7635(Player player, boolean ctrl) {
        int[] list = new int[]{4039, 4040, 4041, 4042, 4043, 4044, 57};
        int[] counts = new int[]{4, 4, 4, 4, 4, 4, 160000};
        int[] chances = new int[]{20, 10, 10, 10, 20, 20, 10};
        extract_item_r(list, counts, chances, player);
    }

    // Old Agathion
    private void use10408(Player player, boolean ctrl) {
        Functions.addItem(player, 6471, 20);
        Functions.addItem(player, 5094, 40);
        Functions.addItem(player, 9814, 3);
        Functions.addItem(player, 9816, 4);
        Functions.addItem(player, 9817, 4);
        Functions.addItem(player, 9815, 2);
        Functions.addItem(player, 57, 6000000);
    }

    // Magic Armor Set
    private void use10473(Player player, boolean ctrl) {
        Functions.addItem(player, 10470, 2); // Shadow Item - Red Crescent
        Functions.addItem(player, 10471, 2); // Shadow Item - Ring of Devotion
        Functions.addItem(player, 10472, 1); // Shadow Item - Necklace of Devotion
    }

    // Ancient Tome of the Demon
    private void use9599(Player player, boolean ctrl) {
        int[] list = new int[]{9600, 9601, 9602};
        int[] count_min = new int[]{1, 1, 1};
        int[] count_max = new int[]{2, 2, 1};
        int[] chances = new int[]{4, 10, 1};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 9599, Functions.getItemCount(player, 9599));
            for (int[] res : mass_extract_item_r(item_count, list, count_min, count_max, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, count_min, count_max, chances, player);
    }

    // Baby Panda Agathion Pack
    private void use20069(Player player, boolean ctrl) {
        Functions.addItem(player, 20063, 1);
    }

    // Bamboo Panda Agathion Pack
    private void use20070(Player player, boolean ctrl) {
        Functions.addItem(player, 20064, 1);
    }

    // Sexy Panda Agathion Pack
    private void use20071(Player player, boolean ctrl) {
        Functions.addItem(player, 20065, 1);
    }

    // Agathion of Baby Panda 15 Day Pack
    private void use20072(Player player, boolean ctrl) {
        Functions.addItem(player, 20066, 1);
    }

    // Bamboo Panda Agathion 15 Day Pack
    private void use20073(Player player, boolean ctrl) {
        Functions.addItem(player, 20067, 1);
    }

    // Agathion of Sexy Panda 15 Day Pack
    private void use20074(Player player, boolean ctrl) {
        Functions.addItem(player, 20068, 1);
    }

    // Charming Valentine Gift Set
    private void use20210(Player player, boolean ctrl) {
        Functions.addItem(player, 20212, 1);
    }

    // Naughty Valentine Gift Set
    private void use20211(Player player, boolean ctrl) {
        Functions.addItem(player, 20213, 1);
    }

    // White Maneki Neko Agathion Pack
    private void use20215(Player player, boolean ctrl) {
        Functions.addItem(player, 20221, 1);
    }

    // Black Maneki Neko Agathion Pack
    private void use20216(Player player, boolean ctrl) {
        Functions.addItem(player, 20222, 1);
    }

    // Brown Maneki Neko Agathion Pack
    private void use20217(Player player, boolean ctrl) {
        Functions.addItem(player, 20223, 1);
    }

    // White Maneki Neko Agathion 7-Day Pack
    private void use20218(Player player, boolean ctrl) {
        Functions.addItem(player, 20224, 1);
    }

    // Black Maneki Neko Agathion 7-Day Pack
    private void use20219(Player player, boolean ctrl) {
        Functions.addItem(player, 20225, 1);
    }

    // Brown Maneki Neko Agathion 7-Day Pack
    private void use20220(Player player, boolean ctrl) {
        Functions.addItem(player, 20226, 1);
    }

    // One-Eyed Bat Drove Agathion Pack
    private void use20227(Player player, boolean ctrl) {
        Functions.addItem(player, 20230, 1);
    }

    // One-Eyed Bat Drove Agathion 7-Day Pack
    private void use20228(Player player, boolean ctrl) {
        Functions.addItem(player, 20231, 1);
    }

    // One-Eyed Bat Drove Agathion 7-Day Pack
    private void use20229(Player player, boolean ctrl) {
        Functions.addItem(player, 20232, 1);
    }

    // Pegasus Agathion Pack
    private void use20233(Player player, boolean ctrl) {
        Functions.addItem(player, 20236, 1);
    }

    // Pegasus Agathion 7-Day Pack
    private void use20234(Player player, boolean ctrl) {
        Functions.addItem(player, 20237, 1);
    }

    // Pegasus Agathion 7-Day Pack
    private void use20235(Player player, boolean ctrl) {
        Functions.addItem(player, 20238, 1);
    }

    // Yellow-Robed Tojigong Pack
    private void use20239(Player player, boolean ctrl) {
        Functions.addItem(player, 20245, 1);
    }

    // Blue-Robed Tojigong Pack
    private void use20240(Player player, boolean ctrl) {
        Functions.addItem(player, 20246, 1);
    }

    // Green-Robed Tojigong Pack
    private void use20241(Player player, boolean ctrl) {
        Functions.addItem(player, 20247, 1);
    }

    // Yellow-Robed Tojigong 7-Day Pack
    private void use20242(Player player, boolean ctrl) {
        Functions.addItem(player, 20248, 1);
    }

    // Blue-Robed Tojigong 7-Day Pack
    private void use20243(Player player, boolean ctrl) {
        Functions.addItem(player, 20249, 1);
    }

    // Green-Robed Tojigong 7-Day Pack
    private void use20244(Player player, boolean ctrl) {
        Functions.addItem(player, 20250, 1);
    }

    // Bugbear Agathion Pack
    private void use20251(Player player, boolean ctrl) {
        Functions.addItem(player, 20252, 1);
    }

    // Agathion of Love Pack (Event)
    private void use20254(Player player, boolean ctrl) {
        Functions.addItem(player, 20253, 1);
    }

    // Gold Afro Hair Pack
    private void use20278(Player player, boolean ctrl) {
        Functions.addItem(player, 20275, 1);
    }

    // Pink Afro Hair Pack
    private void use20279(Player player, boolean ctrl) {
        Functions.addItem(player, 20276, 1);
    }

    // Plaipitak Agathion Pack
    private void use20041(Player player, boolean ctrl) {
        Functions.addItem(player, 20012, 1);
    }

    // Plaipitak Agathion 30-Day Pack
    private void use20042(Player player, boolean ctrl) {
        Functions.addItem(player, 20013, 1);
    }

    // Plaipitak Agathion 30-Day Pack
    private void use20043(Player player, boolean ctrl) {
        Functions.addItem(player, 20014, 1);
    }

    // Plaipitak Agathion 30-Day Pack
    private void use20044(Player player, boolean ctrl) {
        Functions.addItem(player, 20015, 1);
    }

    // Majo Agathion Pack
    private void use20035(Player player, boolean ctrl) {
        Functions.addItem(player, 20006, 1);
    }

    // Gold Crown Majo Agathion Pack
    private void use20036(Player player, boolean ctrl) {
        Functions.addItem(player, 20007, 1);
    }

    // Black Crown Majo Agathion Pack
    private void use20037(Player player, boolean ctrl) {
        Functions.addItem(player, 20008, 1);
    }

    // Majo Agathion 30-Day Pack
    private void use20038(Player player, boolean ctrl) {
        Functions.addItem(player, 20009, 1);
    }

    // Gold Crown Majo Agathion 30-Day Pack
    private void use20039(Player player, boolean ctrl) {
        Functions.addItem(player, 20010, 1);
    }

    // Black Crown Majo Agathion 30-Day Pack
    private void use20040(Player player, boolean ctrl) {
        Functions.addItem(player, 20011, 1);
    }

    // Kat the Cat Hat Pack
    private void use20060(Player player, boolean ctrl) {
        Functions.addItem(player, 20031, 1);
    }

    // Skull Hat Pack
    private void use20061(Player player, boolean ctrl) {
        Functions.addItem(player, 20032, 1);
    }

    private void use20101(Player player, boolean ctrl) {   //Комплект подарков Санта Клаус
        Functions.addItem(player, 20075, 1);
        Functions.addItem(player, 20076, 1);
        Functions.addItem(player, 20077, 1);
    }

    private void use20102(Player player, boolean ctrl) {   //Комплект подарков Санта Клаус
        Functions.addItem(player, 20075, 1);
        Functions.addItem(player, 20076, 1);
        Functions.addItem(player, 20077, 1);
    }

    // ****** Start Item Mall ******
    // Small fortuna box
    private void use22000(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22006, 3}, {22007, 2}, {22008, 1}, {22014, 1}, {22022, 3}, {22023, 3}, {22024, 1}, {8743, 1}, {8744, 1}, {8745, 1}, {8753, 1}, {8754, 1}, {8755, 1}, {22025, 5}};
        double[] chances = new double[]{20.55555, 14.01515, 6.16666, 0.86999, 3.19444, 6.38888, 5.75, 10, 8.33333, 6.94444, 2, 1.6666, 1.38888, 12.77777};
        extractRandomOneItem(player, list, chances);
    }

    // Middle fortuna box
    private void use22001(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22007, 3}, {22008, 2}, {22009, 1}, {22014, 1}, {22015, 1}, {22022, 5}, {22023, 5}, {22024, 2}, {8746, 1}, {8747, 1}, {8748, 1}, {8756, 1}, {8757, 1}, {8758, 1}, {22025, 10}};
        double[] chances = new double[]{27.27272, 9, 5, 0.93959, 0.32467, 3.75, 7.5, 5.625, 9.11458, 7.875, 6.5625, 1.82291, 1.575, 1.3125, 12.5};
        extractRandomOneItem(player, list, chances);
    }

    // Large fortuna box
    private void use22002(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22008, 2}, {22009, 1}, {22014, 1}, {22015, 1}, {22018, 1}, {22019, 1}, {22022, 10}, {22023, 10}, {22024, 5}, {8749, 1}, {8750, 1}, {8751, 1}, {8759, 1}, {8760, 1}, {8761, 1}, {22025, 20}};
        double[] chances = new double[]{27, 15, 0.78299, 0.27056, 0.00775, 0.0027, 3.75, 7.5, 4.5, 9.75, 8.125, 6.77083, 1.95, 1.625, 1.35416, 12.5};
        extractRandomOneItem(player, list, chances);
    }

    // Small fortuna cube
    private void use22003(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22010, 3}, {22011, 2}, {22012, 1}, {22016, 1}, {22022, 3}, {22023, 3}, {22024, 1}, {8743, 1}, {8744, 1}, {8745, 1}, {8753, 1}, {8754, 1}, {8755, 1}, {22025, 5}};
        double[] chances = new double[]{20.22222, 13.78787, 6.06666, 0.69599, 3.47222, 6.94444, 6.25, 9.5, 7.91666, 6.59722, 1.9, 1.58333, 1.31944, 13.88888};
        extractRandomOneItem(player, list, chances);
    }

    // Middle fortuna cube
    private void use22004(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22011, 3}, {22012, 2}, {22013, 1}, {22016, 1}, {22017, 1}, {22022, 5}, {22023, 5}, {22024, 2}, {8746, 1}, {8747, 1}, {8748, 1}, {8756, 1}, {8757, 1}, {8758, 1}, {22025, 10}};
        double[] chances = new double[]{26.51515, 8.75, 4.86111, 0.91349, 0.31565, 3.75, 7.5, 5.625, 9.54861, 8.25, 6.875, 1.90972, 1.65, 1.375, 12.5};
        extractRandomOneItem(player, list, chances);
    }

    // Large fortuna cube
    private void use22005(Player player, boolean ctrl) {
        int[][] list = new int[][]{{22012, 2}, {22013, 1}, {22016, 1}, {22017, 1}, {22020, 1}, {22021, 1}, {22022, 10}, {22023, 10}, {22024, 5}, {8749, 1}, {8750, 1}, {8751, 1}, {8759, 1}, {8760, 1}, {8761, 1}, {22025, 20}};
        double[] chances = new double[]{26.25, 14.58333, 0.69599, 0.24049, 0.00638, 0.0022, 3.95833, 7.91666, 4.75, 9.58333, 7.98611, 6.65509, 1.91666, 1.59722, 1.33101, 13.19444};
        extractRandomOneItem(player, list, chances);
    }

    // Beast Soulshot Pack
    private void use20326(Player player, boolean ctrl) {
        Functions.addItem(player, 20332, 5000);
    }

    // Beast Spiritshot Pack
    private void use20327(Player player, boolean ctrl) {
        Functions.addItem(player, 20333, 5000);
    }

    // Beast Soulshot Large Pack
    private void use20329(Player player, boolean ctrl) {
        Functions.addItem(player, 20332, 10000);
    }

    // Beast Spiritshot Large Pack
    private void use20330(Player player, boolean ctrl) {
        Functions.addItem(player, 20333, 10000);
    }

    // Light Purple Maned Horse Bracelet 30-Day Pack
    private void use20059(Player player, boolean ctrl) {
        Functions.addItem(player, 20030, 1);
    }

    // Steam Beatle Mounting Bracelet 7 Day Pack
    private void use20494(Player player, boolean ctrl) {
        Functions.addItem(player, 20449, 1);
    }

    // Light Purple Maned Horse Mounting Bracelet 7 Day Pack
    private void use20493(Player player, boolean ctrl) {
        Functions.addItem(player, 20448, 1);
    }

    // Steam Beatle Mounting Bracelet Pack
    private void use20395(Player player, boolean ctrl) {
        Functions.addItem(player, 20396, 1);
    }

    // Pumpkin Transformation Stick 7 Day Pack
    private void use13281(Player player, boolean ctrl) {
        Functions.addItem(player, 13253, 1);
    }

    // Kat the Cat Hat 7-Day Pack
    private void use13282(Player player, boolean ctrl) {
        Functions.addItem(player, 13239, 1);
    }

    // Feline Queen Hat 7-Day Pack
    private void use13283(Player player, boolean ctrl) {
        Functions.addItem(player, 13240, 1);
    }

    // Monster Eye Hat 7-Day Pack
    private void use13284(Player player, boolean ctrl) {
        Functions.addItem(player, 13241, 1);
    }

    // Brown Bear Hat 7-Day Pack
    private void use13285(Player player, boolean ctrl) {
        Functions.addItem(player, 13242, 1);
    }

    // Fungus Hat 7-Day Pack
    private void use13286(Player player, boolean ctrl) {
        Functions.addItem(player, 13243, 1);
    }

    // Skull Hat 7-Day Pack
    private void use13287(Player player, boolean ctrl) {
        Functions.addItem(player, 13244, 1);
    }

    // Ornithomimus Hat 7-Day Pack
    private void use13288(Player player, boolean ctrl) {
        Functions.addItem(player, 13245, 1);
    }

    // Feline King Hat 7-Day Pack
    private void use13289(Player player, boolean ctrl) {
        Functions.addItem(player, 13246, 1);
    }

    // Kai the Cat Hat 7-Day Pack
    private void use13290(Player player, boolean ctrl) {
        Functions.addItem(player, 13247, 1);
    }

    // Sudden Agathion 7 Day Pack
    private void use14267(Player player, boolean ctrl) {
        Functions.addItem(player, 14093, 1);
    }

    // Shiny Agathion 7 Day Pack
    private void use14268(Player player, boolean ctrl) {
        Functions.addItem(player, 14094, 1);
    }

    // Sobbing Agathion 7 Day Pack
    private void use14269(Player player, boolean ctrl) {
        Functions.addItem(player, 14095, 1);
    }

    // Agathion of Love 7-Day Pack
    private void use13280(Player player, boolean ctrl) {
        Functions.addItem(player, 20201, 1);
    }

    // A Scroll Bundle of Fighter
    private void use22087(Player player, boolean ctrl) {
        Functions.addItem(player, 22039, 1);
        Functions.addItem(player, 22040, 1);
        Functions.addItem(player, 22041, 1);
        Functions.addItem(player, 22042, 1);
        Functions.addItem(player, 22043, 1);
        Functions.addItem(player, 22044, 1);
        Functions.addItem(player, 22047, 1);
        Functions.addItem(player, 22048, 1);
    }

    // A Scroll Bundle of Mage
    private void use22088(Player player, boolean ctrl) {
        Functions.addItem(player, 22045, 1);
        Functions.addItem(player, 22046, 1);
        Functions.addItem(player, 22048, 1);
        Functions.addItem(player, 22049, 1);
        Functions.addItem(player, 22050, 1);
        Functions.addItem(player, 22051, 1);
        Functions.addItem(player, 22052, 1);
        Functions.addItem(player, 22053, 1);
    }

    // ****** End Item Mall ******

    // ****** Belts ******
    // Gludio Supply Box - Belt: Grade B, C
    private void use13713(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Belt: Grade B, C
    private void use13714(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Belt: Grade B, C
    private void use13715(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Belt: Grade B, C
    private void use13716(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Belt: Grade B, C
    private void use13717(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Belt: Grade B, C
    private void use13718(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Belt: Grade B, C
    private void use13719(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Belt: Grade B, C
    private void use13720(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Belt: Grade B, C
    private void use13721(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13894, 1); // Cloth Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13895, 1); // Leather Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Gludio Supply Box - Belt: Grade S, A
    private void use14549(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Belt: Grade S, A
    private void use14550(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Belt: Grade S, A
    private void use14551(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Belt: Grade S, A
    private void use14552(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Belt: Grade S, A
    private void use14553(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Belt: Grade S, A
    private void use14554(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Belt: Grade S, A
    private void use14555(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Belt: Grade S, A
    private void use14556(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Belt: Grade S, A
    private void use14557(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13896, 1); // Iron Belt
        else if (Rnd.chance(50))
            Functions.addItem(player, 13897, 1); // Mithril Belt
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // ****** Magic Pins ******
    // Gludio Supply Box - Magic Pin: Grade B, C
    private void use13695(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Pin: Grade B, C
    private void use13696(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Pin: Grade B, C
    private void use13697(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Pin: Grade B, C
    private void use13698(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Pin: Grade B, C
    private void use13699(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Pin: Grade B, C
    private void use13700(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Pin: Grade B, C
    private void use13701(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Pin: Grade B, C
    private void use13702(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Pin: Grade B, C
    private void use13703(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13898, 1); // Sealed Magic Pin (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13899, 1); // Sealed Magic Pin (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Gludio Supply Box - Magic Pin: Grade S, A
    private void use14531(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Pin: Grade S, A
    private void use14532(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Pin: Grade S, A
    private void use14533(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Pin: Grade S, A
    private void use14534(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Pin: Grade S, A
    private void use14535(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Pin: Grade S, A
    private void use14536(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Pin: Grade S, A
    private void use14537(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Pin: Grade S, A
    private void use14538(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Pin: Grade S, A
    private void use14539(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13900, 1); // Sealed Magic Pin (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13901, 1); // Sealed Magic Pin (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // ****** Magic Pouchs ******
    // Gludio Supply Box - Magic Pouch: Grade B, C
    private void use13704(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Pouch: Grade B, C
    private void use13705(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Pouch: Grade B, C
    private void use13706(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Pouch: Grade B, C
    private void use13707(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Pouch: Grade B, C
    private void use13708(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Pouch: Grade B, C
    private void use13709(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Pouch: Grade B, C
    private void use13710(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Pouch: Grade B, C
    private void use13711(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Pouch: Grade B, C
    private void use13712(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13918, 1); // Sealed Magic Pouch (C-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13919, 1); // Sealed Magic Pouch (B-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Gludio Supply Box - Magic Pouch: Grade S, A
    private void use14540(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Pouch: Grade S, A
    private void use14541(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Pouch: Grade S, A
    private void use14542(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Pouch: Grade S, A
    private void use14543(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Pouch: Grade S, A
    private void use14544(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Pouch: Grade S, A
    private void use14545(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Pouch: Grade S, A
    private void use14546(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Pouch: Grade S, A
    private void use14547(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Pouch: Grade S, A
    private void use14548(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 13920, 1); // Sealed Magic Pouch (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 13921, 1); // Sealed Magic Pouch (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // ****** Magic Rune Clip ******
    // Gludio Supply Box - Magic Rune Clip: Grade S, A
    private void use14884(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Rune Clip: Grade S, A
    private void use14885(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Rune Clip: Grade S, A
    private void use14886(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Rune Clip: Grade S, A
    private void use14887(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Rune Clip: Grade S, A
    private void use14888(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Rune Clip: Grade S, A
    private void use14889(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Rune Clip: Grade S, A
    private void use14890(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Rune Clip: Grade S, A
    private void use14891(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Rune Clip: Grade S, A
    private void use14892(Player player, boolean ctrl) {
        if (Rnd.chance(50))
            Functions.addItem(player, 14902, 1); // Sealed Magic Rune Clip (A-Grade)
        else if (Rnd.chance(50))
            Functions.addItem(player, 14903, 1); // Sealed Magic Rune Clip (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // ****** Magic Ornament ******
    // Gludio Supply Box - Magic Ornament: Grade S, A
    private void use14893(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Dion Supply Box - Magic Ornament: Grade S, A
    private void use14894(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Giran Supply Box - Magic Ornament: Grade S, A
    private void use14895(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Oren Supply Box - Magic Ornament: Grade S, A
    private void use14896(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Aden Supply Box - Magic Ornament: Grade S, A
    private void use14897(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Innadril Supply Box - Magic Ornament: Grade S, A
    private void use14898(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Goddard Supply Box - Magic Ornament: Grade S, A
    private void use14899(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Rune Supply Box - Magic Ornament: Grade S, A
    private void use14900(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Schuttgart Supply Box - Magic Ornament: Grade S, A
    private void use14901(Player player, boolean ctrl) {
        if (Rnd.chance(20))
            Functions.addItem(player, 14904, 1); // Sealed Magic Ornament (A-Grade)
        else if (Rnd.chance(20))
            Functions.addItem(player, 14905, 1); // Sealed Magic Ornament (S-Grade)
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Gift from Santa Claus
    private void use14616(Player player, boolean ctrl) {
        // Santa Claus' Weapon Exchange Ticket - 12 Hour Expiration Period
        Functions.addItem(player, 20107, 1);

        // Christmas Red Sock
        Functions.addItem(player, 14612, 1);

        // Special Christmas Tree
        if (Rnd.chance(30))
            Functions.addItem(player, 5561, 1);

        // Christmas Tree
        if (Rnd.chance(50))
            Functions.addItem(player, 5560, 1);

        // Agathion Seal Bracelet - Rudolph (постоянный предмет)
        if (Functions.getItemCount(player, 10606) == 0 && Rnd.chance(5))
            Functions.addItem(player, 10606, 1);

        // Agathion Seal Bracelet: Rudolph - 30 дней со скилом на виталити
        if (Functions.getItemCount(player, 20094) == 0 && Rnd.chance(3))
            Functions.addItem(player, 20094, 1);

        // Chest of Experience (Event)
        if (Rnd.chance(30))
            Functions.addItem(player, 20575, 1);
    }

    // Chest of Experience (Event)
    private void use20575(Player player, boolean ctrl) {
        Functions.addItem(player, 20335, 1); // Rune of Experience: 30% - 5 hour limited time
        Functions.addItem(player, 20341, 1); // Rune of SP 30% - 5 Hour Expiration Period
    }

    // Nepal Snow Agathion Pack
    private void use20804(Player player, boolean ctrl) {
        Functions.addItem(player, 20782, 1);
    }

    // Nepal Snow Agathion 7-Day Pack - Snow's Haste
    private void use20807(Player player, boolean ctrl) {
        Functions.addItem(player, 20785, 1);
    }

    // Round Ball Snow Agathion Pack
    private void use20805(Player player, boolean ctrl) {
        Functions.addItem(player, 20783, 1);
    }

    // Round Ball Snow Agathion 7-Day Pack - Snow's Acumen
    private void use20808(Player player, boolean ctrl) {
        Functions.addItem(player, 20786, 1);
    }

    // Ladder Snow Agathion Pack
    private void use20806(Player player, boolean ctrl) {
        Functions.addItem(player, 20784, 1);
    }

    // Ladder Snow Agathion 7-Day Pack - Snow's Wind Walk
    private void use20809(Player player, boolean ctrl) {
        Functions.addItem(player, 20787, 1);
    }

    // Iken Agathion Pack
    private void use20842(Player player, boolean ctrl) {
        Functions.addItem(player, 20818, 1);
    }

    // Iken Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20843(Player player, boolean ctrl) {
        Functions.addItem(player, 20819, 1);
    }

    // Lana Agathion Pack
    private void use20844(Player player, boolean ctrl) {
        Functions.addItem(player, 20820, 1);
    }

    // Lana Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20845(Player player, boolean ctrl) {
        Functions.addItem(player, 20821, 1);
    }

    // Gnocian Agathion Pack
    private void use20846(Player player, boolean ctrl) {
        Functions.addItem(player, 20822, 1);
    }

    // Gnocian Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20847(Player player, boolean ctrl) {
        Functions.addItem(player, 20823, 1);
    }

    // Orodriel Agathion Pack
    private void use20848(Player player, boolean ctrl) {
        Functions.addItem(player, 20824, 1);
    }

    // Orodriel Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20849(Player player, boolean ctrl) {
        Functions.addItem(player, 20825, 1);
    }

    // Lakinos Agathion Pack
    private void use20850(Player player, boolean ctrl) {
        Functions.addItem(player, 20826, 1);
    }

    // Lakinos Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20851(Player player, boolean ctrl) {
        Functions.addItem(player, 20827, 1);
    }

    // Mortia Agathion Pack
    private void use20852(Player player, boolean ctrl) {
        Functions.addItem(player, 20828, 1);
    }

    // Mortia Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20853(Player player, boolean ctrl) {
        Functions.addItem(player, 20829, 1);
    }

    // Hayance Agathion Pack
    private void use20854(Player player, boolean ctrl) {
        Functions.addItem(player, 20830, 1);
    }

    // Hayance Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20855(Player player, boolean ctrl) {
        Functions.addItem(player, 20831, 1);
    }

    // Meruril Agathion Pack
    private void use20856(Player player, boolean ctrl) {
        Functions.addItem(player, 20832, 1);
    }

    // Meruril Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20857(Player player, boolean ctrl) {
        Functions.addItem(player, 20833, 1);
    }

    // Taman ze Lapatui Agathion Pack
    private void use20858(Player player, boolean ctrl) {
        Functions.addItem(player, 20834, 1);
    }

    // Taman ze Lapatui Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20859(Player player, boolean ctrl) {
        Functions.addItem(player, 20835, 1);
    }

    // Kaurin Agathion Pack
    private void use20860(Player player, boolean ctrl) {
        Functions.addItem(player, 20836, 1);
    }

    // Kaurin Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20861(Player player, boolean ctrl) {
        Functions.addItem(player, 20837, 1);
    }

    // Ahertbein Agathion Pack
    private void use20862(Player player, boolean ctrl) {
        Functions.addItem(player, 20838, 1);
    }

    // Ahertbein Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20863(Player player, boolean ctrl) {
        Functions.addItem(player, 20839, 1);
    }

    // Naonin Agathion Pack
    private void use20864(Player player, boolean ctrl) {
        Functions.addItem(player, 20840, 1);
    }

    // Rocket Gun Hat Pack Continuous Fireworks
    private void use20811(Player player, boolean ctrl) {
        Functions.addItem(player, 20789, 1);
    }

    // Yellow Paper Hat 7-Day Pack Bless the Body
    private void use20812(Player player, boolean ctrl) {
        Functions.addItem(player, 20790, 1);
    }

    // Pink Paper Mask Set 7-Day Pack Bless the Soul
    private void use20813(Player player, boolean ctrl) {
        Functions.addItem(player, 20791, 1);
    }

    // Flavorful Cheese Hat Pack
    private void use20814(Player player, boolean ctrl) {
        Functions.addItem(player, 20792, 1);
    }

    // Sweet Cheese Hat Pack
    private void use20815(Player player, boolean ctrl) {
        Functions.addItem(player, 20793, 1);
    }

    // Flavorful Cheese Hat 7-Day Pack Scent of Flavorful Cheese
    private void use20816(Player player, boolean ctrl) {
        Functions.addItem(player, 20794, 1);
    }

    // Sweet Cheese Hat 7-Day Pack Scent of Sweet Cheese
    private void use20817(Player player, boolean ctrl) {
        Functions.addItem(player, 20795, 1);
    }

    // Flame Box Pack
    private void use20810(Player player, boolean ctrl) {
        Functions.addItem(player, 20725, 1);
    }

    // Naonin Agathion 7-Day Pack Prominent Outsider Adventurer's Ability
    private void use20865(Player player, boolean ctrl) {
        Functions.addItem(player, 20841, 1);
    }

    // Shiny Mask of Giant Hercules 7 day Pack
    private void use20748(Player player, boolean ctrl) {
        Functions.addItem(player, 20743, 1);
    }

    // Shiny Mask of Silent Scream 7 day Pack
    private void use20749(Player player, boolean ctrl) {
        Functions.addItem(player, 20744, 1);
    }

    // Shiny Spirit of Wrath Mask 7 day Pack
    private void use20750(Player player, boolean ctrl) {
        Functions.addItem(player, 20745, 1);
    }

    // Shiny Undecaying Corpse Mask 7 Day Pack
    private void use20751(Player player, boolean ctrl) {
        Functions.addItem(player, 20746, 1);
    }

    // Shiny Planet X235 Alien Mask 7 day Pack
    private void use20752(Player player, boolean ctrl) {
        Functions.addItem(player, 20747, 1);
    }

    private void use30281(Player player, boolean ctrl) {    // Blessed Spiritshot Large Pack (R-Grade)
        Functions.addItem(player, 19442, 10000);
    }

    private void use30282(Player player, boolean ctrl) {    // Orichalcum Quiver
        Functions.addItem(player, 19443, 10000);
    }

    private void use30283(Player player, boolean ctrl) {    // Orichalcum Bolt Container
        Functions.addItem(player, 18550, 1);
    }

    private void use30284(Player player, boolean ctrl) {    // Requiem Weapon Box
        Functions.addItem(player, 18103, 1);
        Functions.addItem(player, 18104, 1);
        Functions.addItem(player, 18105, 1);
        Functions.addItem(player, 18106, 1);
        Functions.addItem(player, 18107, 1);
        Functions.addItem(player, 18109, 1);
        Functions.addItem(player, 18109, 1);
        Functions.addItem(player, 18110, 1);
        Functions.addItem(player, 18111, 1);
        Functions.addItem(player, 18112, 1);
        Functions.addItem(player, 18113, 1);
        Functions.addItem(player, 18114, 1);
        Functions.addItem(player, 18115, 1);
        Functions.addItem(player, 18116, 1);

    }

    private void use30285(Player player, boolean ctrl) {    // Immortal Heavy Armor Box
        Functions.addItem(player, 18117, 1);
        Functions.addItem(player, 18118, 1);
        Functions.addItem(player, 18119, 1);
        Functions.addItem(player, 18120, 1);
        Functions.addItem(player, 18121, 1);
        Functions.addItem(player, 18122, 1);
    }

    private void use30286(Player player, boolean ctrl) {    // Immortal Light Armor Box
        Functions.addItem(player, 18123, 1);
        Functions.addItem(player, 18124, 1);
        Functions.addItem(player, 18125, 1);
        Functions.addItem(player, 18126, 1);
        Functions.addItem(player, 18127, 1);

    }

    private void use30287(Player player, boolean ctrl) {    // Immortal Robe Armor Box
        Functions.addItem(player, 18128, 1);
        Functions.addItem(player, 18129, 1);
        Functions.addItem(player, 18130, 1);
        Functions.addItem(player, 18131, 1);
        Functions.addItem(player, 18132, 1);
        Functions.addItem(player, 18133, 1);
    }

    private void use30288(Player player, boolean ctrl) {    // Apocalypse Weapon Box
        Functions.addItem(player, 18137, 1);
        Functions.addItem(player, 18138, 1);
        Functions.addItem(player, 18139, 1);
        Functions.addItem(player, 18140, 1);
        Functions.addItem(player, 18141, 1);
        Functions.addItem(player, 18142, 1);
        Functions.addItem(player, 18143, 1);
        Functions.addItem(player, 18144, 1);
        Functions.addItem(player, 18145, 1);
        Functions.addItem(player, 18146, 1);
        Functions.addItem(player, 18147, 1);
        Functions.addItem(player, 18148, 1);
        Functions.addItem(player, 18149, 1);
        Functions.addItem(player, 18150, 1);
    }

    private void use30289(Player player, boolean ctrl) {    // Twilight Heavy Armor Box
        Functions.addItem(player, 18151, 1);
        Functions.addItem(player, 18152, 1);
        Functions.addItem(player, 18153, 1);
        Functions.addItem(player, 18154, 1);
        Functions.addItem(player, 18155, 1);
        Functions.addItem(player, 18156, 1);
    }

    private void use30290(Player player, boolean ctrl) {    // Twilight Light Armor Box
        Functions.addItem(player, 18157, 1);
        Functions.addItem(player, 18158, 1);
        Functions.addItem(player, 18159, 1);
        Functions.addItem(player, 18160, 1);
        Functions.addItem(player, 18161, 1);
    }

    private void use30291(Player player, boolean ctrl) {    // Twilight Robe Armor Box
        Functions.addItem(player, 18162, 1);
        Functions.addItem(player, 18163, 1);
        Functions.addItem(player, 18164, 1);
        Functions.addItem(player, 18165, 1);
        Functions.addItem(player, 18166, 1);
        Functions.addItem(player, 18167, 1);
    }

    private void use30292(Player player, boolean ctrl) {    // Immortal Accessory Box
        Functions.addItem(player, 18134, 1);
        Functions.addItem(player, 18135, 1);
        Functions.addItem(player, 18135, 1);
        Functions.addItem(player, 18136, 1);
        Functions.addItem(player, 18136, 1);
    }

    private void use30293(Player player, boolean ctrl) {    // Twilight Accessory Box
        Functions.addItem(player, 18168, 1);
        Functions.addItem(player, 18169, 1);
        Functions.addItem(player, 18169, 1);
        Functions.addItem(player, 18170, 1);
        Functions.addItem(player, 18170, 1);
    }

    // Simple Valentine Cake
    private void use20195(Player player, boolean ctrl) {
        // Velvety Valentine Cake
        if (Rnd.chance(20))
            Functions.addItem(player, 20196, 1);
        else {
            // Dragon Bomber Transformation Scroll
            if (Rnd.chance(5))
                Functions.addItem(player, 20371, 1);

            // Unicorn Transformation Scroll
            if (Rnd.chance(5))
                Functions.addItem(player, 20367, 1);

            // Quick Healing Potion
            if (Rnd.chance(10))
                Functions.addItem(player, 1540, 1);

            // Greater Healing Potion
            if (Rnd.chance(15))
                Functions.addItem(player, 1539, 1);
        }
    }

    // Velvety Valentine Cake
    private void use20196(Player player, boolean ctrl) {
        // Delectable Valentine Cake
        if (Rnd.chance(15))
            Functions.addItem(player, 20197, 1);
        else {
            // Scroll: Enchant Armor (C)
            if (Rnd.chance(10))
                Functions.addItem(player, 952, 1);

            // Scroll: Enchant Armor (B)
            if (Rnd.chance(5))
                Functions.addItem(player, 948, 1);

            // Blessed Scroll of Escape
            if (Rnd.chance(10))
                Functions.addItem(player, 1538, 1);

            // Blessed Scroll of Resurrection
            if (Rnd.chance(5))
                Functions.addItem(player, 3936, 1);

            // Agathion of Love - 3 Day Expiration Period
            if (Rnd.chance(10))
                Functions.addItem(player, 20200, 1);
        }
    }

    // Delectable Valentine Cake
    private void use20197(Player player, boolean ctrl) {
        // Decadent Valentine Cake
        if (Rnd.chance(10))
            Functions.addItem(player, 20198, 1);
        else {
            // Scroll: Enchant Weapon (C)
            if (Rnd.chance(10))
                Functions.addItem(player, 951, 1);

            // Scroll: Enchant Weapon (B)
            if (Rnd.chance(5))
                Functions.addItem(player, 947, 1);

            // Agathion of Love - 7 Day Expiration Period
            if (Rnd.chance(5))
                Functions.addItem(player, 20201, 1);
        }
    }

    // Decadent Valentine Cake
    private void use20198(Player player, boolean ctrl) {
        // Scroll: Enchant Weapon (S)
        if (Rnd.chance(5))
            Functions.addItem(player, 959, 1);

        // Scroll: Enchant Weapon (A)
        if (Rnd.chance(10))
            Functions.addItem(player, 729, 1);

        // Agathion of Love - 15 Day Expiration Period
        if (Rnd.chance(10))
            Functions.addItem(player, 20202, 1);

        // Agathion of Love - 30 Day Expiration Period
        if (Rnd.chance(5))
            Functions.addItem(player, 20203, 1);
    }

    private static final int[] SOI_books = {14209, // Forgotten Scroll - Hide
            14212, // Forgotten Scroll - Enlightenment - Wizard
            14213, // Forgotten Scroll - Enlightenment - Healer
            10554, // Forgotten Scroll - Anti-Magic Armor
            14208, // Forgotten Scroll - Final Secret
            10577 // Forgotten Scroll - Excessive Loyalty
    };

    // Jewel Ornamented Duel Supplies
    private void use13777(Player player, boolean ctrl) {
        int rnd = Rnd.get(100);
        if (rnd <= 65) {
            Functions.addItem(player, 9630, 3); // 3 Orichalcum
            Functions.addItem(player, 9629, 3); // 3 Adamantine
            Functions.addItem(player, 9628, 4); // 4 Leonard
            Functions.addItem(player, 8639, 6); // 6 Elixir of CP (S-Grade)
            Functions.addItem(player, 8627, 6); // 6 Elixir of Life (S-Grade)
            Functions.addItem(player, 8633, 6); // 6 Elixir of Mental Strength (S-Grade)
        } else if (rnd <= 95)
            Functions.addItem(player, SOI_books[Rnd.get(SOI_books.length)], 1);
        else
            Functions.addItem(player, 14027, 1); // Collection Agathion Summon Bracelet
    }

    // Mother-of-Pearl Ornamented Duel Supplies
    private void use13778(Player player, boolean ctrl) {
        int rnd = Rnd.get(100);
        if (rnd <= 65) {
            Functions.addItem(player, 9630, 2); // 3 Orichalcum
            Functions.addItem(player, 9629, 2); // 3 Adamantine
            Functions.addItem(player, 9628, 3); // 4 Leonard
            Functions.addItem(player, 8639, 5); // 5 Elixir of CP (S-Grade)
            Functions.addItem(player, 8627, 5); // 5 Elixir of Life (S-Grade)
            Functions.addItem(player, 8633, 5); // 5 Elixir of Mental Strength (S-Grade)
        } else if (rnd <= 95)
            Functions.addItem(player, SOI_books[Rnd.get(SOI_books.length)], 1);
        else
            Functions.addItem(player, 14027, 1); // Collection Agathion Summon Bracelet
    }

    // Gold-Ornamented Duel Supplies
    private void use13779(Player player, boolean ctrl) {
        int rnd = Rnd.get(100);
        if (rnd <= 65) {
            Functions.addItem(player, 9630, 1); // 1 Orichalcum
            Functions.addItem(player, 9629, 1); // 1 Adamantine
            Functions.addItem(player, 9628, 2); // 2 Leonard
            Functions.addItem(player, 8639, 4); // 4 Elixir of CP (S-Grade)
            Functions.addItem(player, 8627, 4); // 4 Elixir of Life (S-Grade)
            Functions.addItem(player, 8633, 4); // 4 Elixir of Mental Strength (S-Grade)
        } else if (rnd <= 95)
            Functions.addItem(player, SOI_books[Rnd.get(SOI_books.length)], 1);
        else
            Functions.addItem(player, 14027, 1); // Collection Agathion Summon Bracelet
    }

    // Silver-Ornamented Duel Supplies
    private void use13780(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 4); // 4 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 4); // 4 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 4); // 4 Elixir of Mental Strength (S-Grade)
    }

    // Bronze-Ornamented Duel Supplies
    private void use13781(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 4); // 4 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 4); // 4 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 4); // 4 Elixir of Mental Strength (S-Grade)
    }

    // Non-Ornamented Duel Supplies
    private void use13782(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 3); // 3 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 3); // 3 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 3); // 3 Elixir of Mental Strength (S-Grade)
    }

    // Weak-Looking Duel Supplies
    private void use13783(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 3); // 3 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 3); // 3 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 3); // 3 Elixir of Mental Strength (S-Grade)
    }

    // Sad-Looking Duel Supplies
    private void use13784(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 3); // 3 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 3); // 3 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 3); // 3 Elixir of Mental Strength (S-Grade)
    }

    // Poor-Looking Duel Supplies
    private void use13785(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 2); // 2 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 2); // 2 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 2); // 2 Elixir of Mental Strength (S-Grade)
    }

    // Worthless Duel Supplies
    private void use13786(Player player, boolean ctrl) {
        Functions.addItem(player, 8639, 1); // 1 Elixir of CP (S-Grade)
        Functions.addItem(player, 8627, 1); // 1 Elixir of Life (S-Grade)
        Functions.addItem(player, 8633, 1); // 1 Elixir of Mental Strength (S-Grade)
    }

    // Kahman's Supply Box
    private void use14849(Player player, boolean ctrl) {
        int[] list = new int[]{9625, 9626}; // codex_of_giant_forgetting, codex_of_giant_training
        int[] chances = new int[]{100, 80};
        int[] counts = new int[]{1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Big Stakato Cocoon
    private void use14834(Player player, boolean ctrl) {
        int[][] items = new int[][]{{9575, 1}, // rare_80_s
                {10485, 1}, // rare_82_s
                {10577, 1}, // sb_excessive_loyalty
                {14209, 1}, // sb_hide1
                {14208, 1}, // sb_final_secret1
                {14212, 1}, // sb_enlightenment_wizard1
                {960, 1}, // scrl_of_ench_am_s
                {9625, 1}, // codex_of_giant_forgetting
                {9626, 1}, // codex_of_giant_training
                {959, 1}, // scrl_of_ench_wp_s
                {10373, 1}, // rp_icarus_sowsword_i
                {10374, 1}, // rp_icarus_disperser_i
                {10375, 1}, // rp_icarus_spirits_i
                {10376, 1}, // rp_icarus_heavy_arms_i
                {10377, 1}, // rp_icarus_trident_i
                {10378, 1}, // rp_icarus_chopper_i
                {10379, 1}, // rp_icarus_knuckle_i
                {10380, 1}, // rp_icarus_wand_i
                {10381, 1}}; // rp_icarus_accipiter_i
        double[] chances = new double[]{2.77, 2.31, 3.2, 3.2, 3.2, 3.2, 6.4, 3.2, 2.13, 0.64, 1.54, 1.54, 1.54, 1.54, 1.54, 1.54, 1.54, 1.54, 1.54};
        extractRandomOneItem(player, items, chances);
    }

    // Small Stakato Cocoon
    private void use14833(Player player, boolean ctrl) {
        int[][] items = new int[][]{{9575, 1}, // rare_80_s
                {10485, 1}, // rare_82_s
                {10577, 1}, // sb_excessive_loyalty
                {14209, 1}, // sb_hide1
                {14208, 1}, // sb_final_secret1
                {14212, 1}, // sb_enlightenment_wizard1
                {960, 1}, // scrl_of_ench_am_s
                {9625, 1}, // codex_of_giant_forgetting
                {9626, 1}, // codex_of_giant_training
                {959, 1}, // scrl_of_ench_wp_s
                {10373, 1}, // rp_icarus_sowsword_i
                {10374, 1}, // rp_icarus_disperser_i
                {10375, 1}, // rp_icarus_spirits_i
                {10376, 1}, // rp_icarus_heavy_arms_i
                {10377, 1}, // rp_icarus_trident_i
                {10378, 1}, // rp_icarus_chopper_i
                {10379, 1}, // rp_icarus_knuckle_i
                {10380, 1}, // rp_icarus_wand_i
                {10381, 1}}; // rp_icarus_accipiter_i
        double[] chances = new double[]{2.36, 1.96, 2.72, 2.72, 2.72, 2.72, 5.44, 2.72, 1.81, 0.54, 1.31, 1.31, 1.31, 1.31, 1.31, 1.31, 1.31, 1.31, 1.31};
        extractRandomOneItem(player, items, chances);
    }

    private void use13988(Player player, boolean ctrl) {
        int[] list = new int[]{9442, 9443, 9444, 9445, 9446, 9447, 9448, 9450, 10252, 10253, 10215, 10216, 10217, 10218, 10219, 10220, 10221, 10222, 10223};
        int[] chances = new int[]{64, 64, 64, 64, 64, 64, 64, 64, 64, 64, 40, 40, 40, 40, 40, 40, 40, 40, 40};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    private void use13989(Player player, boolean ctrl) {
        int[] list = new int[]{9514, 9515, 9516, 9517, 9518, 9519, 9520, 9521, 9522, 9523, 9524, 9525, 9526, 9527, 9528};
        int[] chances = new int[]{50, 63, 70, 75, 75, 50, 63, 70, 75, 75, 50, 63, 70, 75, 75};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    // Pathfinder's Reward - D-Grade
    private void use13003(Player player, boolean ctrl) {
        if (Rnd.chance(3.2))
            Functions.addItem(player, 947, 1); // Scroll: Enchant Weapon B
    }

    // Pathfinder's Reward - C-Grade
    private void use13004(Player player, boolean ctrl) {
        if (Rnd.chance(1.6111))
            Functions.addItem(player, 729, 1); // Scroll: Enchant Weapon A
    }

    // Pathfinder's Reward - B-Grade
    private void use13005(Player player, boolean ctrl) {
        if (Rnd.chance(1.14))
            Functions.addItem(player, 959, 1); // Scroll: Enchant Weapon S
    }

    // Pathfinder's Reward - A-Grade
    private void use13006(Player player, boolean ctrl) {
        int[][] items = new int[][]{{9546, 1}, {9548, 1}, {9550, 1}, {959, 1}, {9442, 1}, {9443, 1}, {9444, 1}, {9445, 1}, {9446, 1}, {9447, 1}, {9448, 1}, {9449, 1}, {9450, 1}, {10252, 1}, {10253, 1}, {15645, 1}, {15646, 1}, {15647, 1}};
        double[] chances = new double[]{19.8, 19.8, 19.8, 1.98, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 1, 1, 1};
        extractRandomOneItem(player, items, chances);
    }

    // Pathfinder's Reward - S-Grade
    private void use13007(Player player, boolean ctrl) {
        int[][] items = new int[][]{{9546, 1}, {9548, 1}, {9550, 1}, {959, 1}, {10215, 1}, {10216, 1}, {10217, 1}, {10218, 1}, {10219, 1}, {10220, 1}, {10221, 1}, {10222, 1}, {10223, 1}};
        double[] chances = new double[]{26.4, 26.4, 26.4, 3.84, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13, 0.13};
        extractRandomOneItem(player, items, chances);
    }

    //Pathfinder's Reward - AU Karm
    private void use13270(Player player, boolean ctrl) {
        if (Rnd.chance(30))
            Functions.addItem(player, 13236, 1);
    }

    //Pathfinder's Reward - AR Karm
    private void use13271(Player player, boolean ctrl) {
        if (Rnd.chance(30))
            Functions.addItem(player, 13237, 1);
    }

    //Pathfinder's Reward - AE Karm
    private void use13272(Player player, boolean ctrl) {
        if (Rnd.chance(30))
            Functions.addItem(player, 13238, 1);
    }

    private void use13990(Player player, boolean ctrl) {
        int[] list = new int[]{6364, 6365, 6366, 6367, 6368, 6369, 6370, 6371, 6372, 6534, 6579, 7575};
        int[] chances = new int[]{83, 83, 83, 83, 83, 83, 83, 83, 83, 83, 83, 83};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    private void use13991(Player player, boolean ctrl) {
        int[] list = new int[]{6674, 6675, 6676, 6677, 6679, 6680, 6681, 6682, 6683, 6684, 6685, 6686, 6687};
        int[] chances = new int[]{70, 80, 95, 95, 90, 55, 95, 95, 90, 55, 95, 95, 90};
        int[] counts = new int[]{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    private void use13992(Player player, boolean ctrl) {
        int[] list = new int[]{6724, 6725, 6726};
        int[] chances = new int[]{25, 32, 42};
        int[] counts = new int[]{1, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    //Droph's Support Items
    private void use14850(Player player, boolean ctrl) {
        int rndAA = Rnd.get(80000, 100000);
        Functions.addItem(player, 5575, rndAA); // Ancient Adena
    }

    //Greater Elixir Gift Box (No-Grade)
    private void use14713(Player player, boolean ctrl) {
        Functions.addItem(player, 14682, 50); // Greater Elixir of Life (No-Grade)
        Functions.addItem(player, 14688, 50); // Greater Elixir of Mental Strength (No-Grade)
        Functions.addItem(player, 14694, 50); // Greater Elixir of CP (No Grade)
    }

    //Greater Elixir Gift Box (D-Grade)
    private void use14714(Player player, boolean ctrl) {
        Functions.addItem(player, 14683, 50); // Greater Elixir of Life (D-Grade)
        Functions.addItem(player, 14689, 50); // Greater Elixir of Mental Strength (D-Grade)
        Functions.addItem(player, 14695, 50); // Greater Elixir of CP (D Grade)
    }

    //Greater Elixir Gift Box (C-Grade)
    private void use14715(Player player, boolean ctrl) {
        Functions.addItem(player, 14684, 50); // Greater Elixir of Life (C-Grade)
        Functions.addItem(player, 14690, 50); // Greater Elixir of Mental Strength (C-Grade)
        Functions.addItem(player, 14696, 50); // Greater Elixir of CP (C Grade)
    }

    //Greater Elixir Gift Box (B-Grade)
    private void use14716(Player player, boolean ctrl) {
        Functions.addItem(player, 14685, 50); // Greater Elixir of Life (B-Grade)
        Functions.addItem(player, 14691, 50); // Greater Elixir of Mental Strength (B-Grade)
        Functions.addItem(player, 14697, 50); // Greater Elixir of CP (B Grade)
    }

    //Greater Elixir Gift Box (A-Grade)
    private void use14717(Player player, boolean ctrl) {
        Functions.addItem(player, 14686, 50); // Greater Elixir of Life (A-Grade)
        Functions.addItem(player, 14692, 50); // Greater Elixir of Mental Strength (A-Grade)
        Functions.addItem(player, 14698, 50); // Greater Elixir of CP (A Grade)
    }

    //Greater Elixir Gift Box (S-Grade)
    private void use14718(Player player, boolean ctrl) {
        Functions.addItem(player, 14687, 50); // Greater Elixir of Life (S-Grade)
        Functions.addItem(player, 14693, 50); // Greater Elixir of Mental Strength (S-Grade)
        Functions.addItem(player, 14699, 50); // Greater Elixir of CP (S Grade)
    }

    // Freya's Gift
    private void use17138(Player player, boolean ctrl) {
        int[][] items = new int[][]{{16026, 1}, {9627, 1}, {17139, 1}, {17140, 1}, {14052, 1}, {6622, 1}, {2134, 2}, {14701, 1}};
        double[] chances = new double[]{0.0001, 0.1417, 1.4172, 1.4172, 2.8345, 18.424, 21.2585, 54.5068};
        extractRandomOneItem(player, items, chances);
    }

    // Beginner Adventurer's Treasure Sack
    private void use21747(Player player, boolean ctrl) {
        int group = Rnd.get(7);
        int[] items = new int[0];
        if (group < 4) //Low D-Grade rewards
            items = new int[]{312, 167, 220, 258, 178, 221, 123, 156, 291, 166, 274};
        else if (group >= 4) //Mid D-Grade rewards
            items = new int[]{261, 224, 318, 93, 129, 294, 88, 90, 158, 172, 279, 169};

        Functions.addItem(player, items[Rnd.get(items.length)], 1);
    }

    // Experienced Adventurer's Treasure Sack
    private void use21748(Player player, boolean ctrl) {
        int group = Rnd.get(10);
        int[] items = new int[0];
        if (group < 4) //Low C-Grade rewards
            items = new int[]{160, 298, 72, 193, 192, 281, 7887, 226, 2524, 191, 71, 263};
        else if (group >= 4 && group < 7) //Low B-Grade rewards
            items = new int[]{78, 2571, 300, 284, 142, 267, 229, 148, 243, 92, 7892, 91};
        else if (group >= 7 && group < 9) //Low A-Grade rewards
            items = new int[]{98, 5233, 80, 235, 269, 288, 7884, 2504, 150, 7899, 212};
        else if (group == 9) //Low S-Grade rewards
            items = new int[]{6365, 6371, 6364, 6366, 6580, 7575, 6579, 6372, 6370, 6369, 6367};

        Functions.addItem(player, items[Rnd.get(items.length)], 1);
    }

    // Giant box
    private void use33465(Player player, boolean ctrl) {
        if (Rnd.chance(30)) {
            if (Rnd.chance(40))
                Functions.addItem(player, 30297, 1); //  Codex
            else if (Rnd.chance(20))
                Functions.addItem(player, 30299, 1); // Discipline
            else if (Rnd.chance(10))
                Functions.addItem(player, 30298, 1); // Mastery
            else if (Rnd.chance(30))
                Functions.addItem(player, 30300, 1); //   Oblivion
        } else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    // Great Adventurer's Treasure Sack
    private void use21749(Player player, boolean ctrl) {
        int group = Rnd.get(9);
        int[] items = new int[0];
        if (group < 5) //Top S-Grade rewards
            items = new int[]{9447, 9384, 9449, 9380, 9448, 9443, 9450, 10253, 9445, 9442, 9446, 10004, 10252, 9376, 9444};
        else if (group >= 5 && group < 8) //S80-Grade rewards
            items = new int[]{10226, 10217, 10224, 10215, 10225, 10223, 10220, 10415, 10216, 10221, 10219, 10218, 10222};
        else if (group == 8) //Low S84-Grade rewards
            items = new int[]{13467, 13462, 13464, 13461, 13465, 13468, 13463, 13470, 13460, 52, 13466, 13459, 13457, 13469, 13458};

        Functions.addItem(player, items[Rnd.get(items.length)], 1);
    }

    // Golden Spice Crate
    private void use15482(Player player, boolean ctrl) {
        if (Rnd.chance(10)) {
            Functions.addItem(player, 15474, 40);
            if (Rnd.chance(50))
                Functions.addItem(player, 15476, 5);
            else
                Functions.addItem(player, 15478, 5);
        } else
            Functions.addItem(player, 15474, 50);
    }

    // Crystal Spice Crate
    private void use15483(Player player, boolean ctrl) {
        if (Rnd.chance(10)) {
            Functions.addItem(player, 15475, 40);
            if (Rnd.chance(50))
                Functions.addItem(player, 15477, 5);
            else
                Functions.addItem(player, 15479, 5);
        } else
            Functions.addItem(player, 15475, 50);
    }

    // Gold Maned Lion Mounting Bracelet 7 Day Pack
    private void use14231(Player player, boolean ctrl) {
        Functions.addItem(player, 14053, 1);
    }

    // Steam Beatle Mounting Bracelet 7 Day Pack
    private void use14232(Player player, boolean ctrl) {
        Functions.addItem(player, 14054, 1);
    }

    // Olympiad Treasure Chest
    private void use17169(Player player, boolean ctrl) {
        int[][] items = new int[][]{{13750, 1}, {13751, 1}, {13754, 1}, {13753, 1}, {13752, 1}, {6622, 1}};
        double[] chances = new double[]{34.7, 12.3, 2.65, 1.2, 1.98, 46.5, 5.4};
        if (Rnd.chance(60))
            extractRandomOneItem(player, items, chances);
        int[] counts = {100, 150, 200, 250, 300, 350};
        Functions.addItem(player, 13722, counts[Rnd.get(counts.length)]);
    }

    // Pablo's Box
    private void use21753(Player player, boolean ctrl) {
        int category = Rnd.get(7);
        switch (category) {
            case 0:
                Functions.addItem(player, 21122, 1);
                break;
            case 1:
                Functions.addItem(player, 21118, 1);
                break;
            case 2:
                Functions.addItem(player, 21116, 1);
                break;
            case 3:
                Functions.addItem(player, 21114, 1);
                break;
            case 4:
                Functions.addItem(player, 21112, 1);
                break;
            case 5:
                Functions.addItem(player, 21120, 1);
                break;
            case 6:
                Functions.addItem(player, 21126, 1);
                break;
        }
    }

    // Rune Jewelry Box - Talisman
    private void use21752(Player player, boolean ctrl) {
        final List<Integer> talismans = new ArrayList<Integer>();

        //9914-9965
        for (int i = 9914; i <= 9965; i++)
            if (i != 9923)
                talismans.add(i);
        //10416-10424
        for (int i = 10416; i <= 10424; i++)
            talismans.add(i);
        //10518-10519
        for (int i = 10518; i <= 10519; i++)
            talismans.add(i);
        //10533-10543
        for (int i = 10533; i <= 10543; i++)
            talismans.add(i);

        Functions.addItem(player, talismans.get(Rnd.get(talismans.size())), 1);
    }

    private static void extract_item(int[] list, int[] counts, Player player) {
        int index = Rnd.get(list.length);
        int id = list[index];
        int count = counts[index];
        Functions.addItem(player, id, count);
    }

    private static List<int[]> mass_extract_item(long source_count, int[] list, int[] counts, Player player) {
        List<int[]> result = new ArrayList<int[]>((int) Math.min(list.length, source_count));

        for (int n = 1; n <= source_count; n++) {
            int index = Rnd.get(list.length);
            int item = list[index];
            int count = counts[index];

            int[] old = null;
            for (int[] res : result)
                if (res[0] == item)
                    old = res;

            if (old == null)
                result.add(new int[]{item, count});
            else
                old[1] += count;
        }

        return result;
    }

    private static void extract_item_r(int[] list, int[] count_min, int[] count_max, int[] chances, Player player) {
        int[] counts = count_min;
        for (int i = 0; i < count_min.length; i++)
            counts[i] = Rnd.get(count_min[i], count_max[i]);
        extract_item_r(list, counts, chances, player);
    }

    private static void extract_item_r(int[] list, int[] counts, int[] chances, Player player) {
        int sum = 0;

        for (int i = 0; i < list.length; i++)
            sum += chances[i];

        int[] table = new int[sum];
        int k = 0;

        for (int i = 0; i < list.length; i++)
            for (int j = 0; j < chances[i]; j++) {
                table[k] = i;
                k++;
            }

        int i = table[Rnd.get(table.length)];
        int item = list[i];
        int count = counts[i];

        Functions.addItem(player, item, count);
    }

    private static List<int[]> mass_extract_item_r(long source_count, int[] list, int[] count_min, int[] count_max, int[] chances, Player player) {
        int[] counts = count_min;
        for (int i = 0; i < count_min.length; i++)
            counts[i] = Rnd.get(count_min[i], count_max[i]);
        return mass_extract_item_r(source_count, list, counts, chances, player);
    }

    private static List<int[]> mass_extract_item_r(long source_count, int[] list, int[] counts, int[] chances, Player player) {
        List<int[]> result = new ArrayList<int[]>((int) Math.min(list.length, source_count));

        int sum = 0;
        for (int i = 0; i < list.length; i++)
            sum += chances[i];

        int[] table = new int[sum];
        int k = 0;

        for (int i = 0; i < list.length; i++)
            for (int j = 0; j < chances[i]; j++) {
                table[k] = i;
                k++;
            }

        for (int n = 1; n <= source_count; n++) {
            int i = table[Rnd.get(table.length)];
            int item = list[i];
            int count = counts[i];

            int[] old = null;
            for (int[] res : result)
                if (res[0] == item)
                    old = res;

            if (old == null)
                result.add(new int[]{item, count});
            else
                old[1] += count;
        }

        return result;
    }

    private static boolean canBeExtracted(Player player, ItemInstance item) {
        if (player.getWeightPenalty() >= 3 || player.getInventory().getSize() > player.getInventoryLimit() - 10) {
            player.sendPacket(Msg.YOUR_INVENTORY_IS_FULL, new SystemMessage(SystemMessage.S1_CANNOT_BE_USED_DUE_TO_UNSUITABLE_TERMS).addItemName(item.getItemId()));
            return false;
        }
        return true;
    }

    private static boolean extractRandomOneItem(Player player, int[][] items, double[] chances) {
        if (items.length != chances.length)
            return false;

        double extractChance = 0;
        for (double c : chances)
            extractChance += c;

        if (Rnd.chance(extractChance)) {
            int[] successfulItems = new int[0];
            while (successfulItems.length == 0)
                for (int i = 0; i < items.length; i++)
                    if (Rnd.chance(chances[i]))
                        successfulItems = ArrayUtils.add(successfulItems, i);
            int[] item = items[successfulItems[Rnd.get(successfulItems.length)]];
            if (item.length < 2)
                return false;

            Functions.addItem(player, item[0], item[1]);
        }
        return true;
    }

    //Агатионы start
    private void use53(Player player, boolean ctrl) {        //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Гнева
        Functions.addItem(player, 13024, 1);
    }

    private void use54(Player player, boolean ctrl) {        //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости.
        Functions.addItem(player, 13025, 1);
    }

    private void use55(Player player, boolean ctrl) {        //Витаминная упаковка\\nКоробка, содержащая Браслет Призыва Агатиона Радости (7 дней)
        Functions.addItem(player, 14102, 1);
    }

    private void use56(Player player, boolean ctrl) {
        Functions.addItem(player, 14103, 1);
    }

    private void use136(Player player, boolean ctrl) {
        Functions.addItem(player, 14075, 1);
    }

    private void use137(Player player, boolean ctrl) {
        Functions.addItem(player, 14076, 1);
    }

    private void use138(Player player, boolean ctrl) {
        Functions.addItem(player, 14077, 1);
    }

    private void use139(Player player, boolean ctrl) {
        Functions.addItem(player, 14093, 1);
    }

    private void use140(Player player, boolean ctrl) {
        Functions.addItem(player, 14094, 1);
    }

    private void use141(Player player, boolean ctrl) {
        Functions.addItem(player, 14095, 1);
    }

    private void use163(Player player, boolean ctrl) {
        Functions.addItem(player, 13026, 1);
    }

    private void use170(Player player, boolean ctrl) {
        Functions.addItem(player, 14101, 1);
    }

    //Агатионы end
    private void use5906(Player player, boolean ctrl) {    //Красный Кристалл Души: Уровень 11
        Functions.addItem(player, 13420, 10);
        Functions.addItem(player, 13419, 1);
    }

    private void use5907(Player player, boolean ctrl) {    //Красный Кристалл Души: Уровень 11
        Functions.addItem(player, 13420, 10);
        Functions.addItem(player, 13419, 1);
    }

    private void use5909(Player player, boolean ctrl) {    //Красный Кристалл Души: Уровень 11
        Functions.addItem(player, 13420, 8);
        Functions.addItem(player, 13419, 1);
    }

    private void use5910(Player player, boolean ctrl) {    //Красный Кристалл Души: Уровень 11
        Functions.addItem(player, 13420, 7);
        Functions.addItem(player, 13419, 1);
    }

    private void use5912(Player player, boolean ctrl) {    //Красный Кристалл Души: Уровень 11
        Functions.addItem(player, 13420, 6);
        Functions.addItem(player, 13419, 1);
    }

    private void use5913(Player player, boolean ctrl) {    //Синий Кристалл Души: Уровень 12
        Functions.addItem(player, 13421, 3);
        Functions.addItem(player, 13419, 1);
    }

    private void use13079(Player player, boolean ctrl) {    //Упаковка: Книга Телепорта к Флагу (1 шт.)
        Functions.addItem(player, 13015, 1);
    }

    private void use13080(Player player, boolean ctrl) {    //Упаковка: Книга Телепорта к Флагу (30 шт.)
        Functions.addItem(player, 13016, 30);
    }

    private void use13082(Player player, boolean ctrl) {    //Упаковка: Благословенные Перья (3 шт.)
        Functions.addItem(player, 10649, 3);
    }

    private void use13083(Player player, boolean ctrl) {    //Упаковка: Агатион Любви (30 дней)
        Functions.addItem(player, 13023, 1);
    }

    private void use13084(Player player, boolean ctrl) {    //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
        Functions.addItem(player, 12800, 1);
    }

    private void use13085(Player player, boolean ctrl) {    //Упаковка: Билет в Камалоку (3 шт.)
        Functions.addItem(player, 13010, 5);
        Functions.addItem(player, 13011, 5);
        Functions.addItem(player, 13012, 5);
    }

    private void use13086(Player player, boolean ctrl) {    //Упаковка: Шляпа Кошки Кэт (30 дней)
        Functions.addItem(player, 12782, 1);
    }

    private void use13087(Player player, boolean ctrl) {    //Упаковка: Шляпа Королевы Кошек (30 дней)
        Functions.addItem(player, 12783, 1);
    }

    private void use13088(Player player, boolean ctrl) {    //Упаковка: Шляпа Монстроглаза (30 дней)
        Functions.addItem(player, 12786, 1);
    }

    private void use13089(Player player, boolean ctrl) {    //Упаковка: Шляпа Бурого Медведя (30 дней)
        Functions.addItem(player, 12787, 1);
    }

    private void use13090(Player player, boolean ctrl) {    //Упаковка: Шляпа Горного Гриба (30 дней)
        Functions.addItem(player, 12788, 1);
    }

    private void use13091(Player player, boolean ctrl) {    //Упаковка: Маска Черепа (30 дней)
        Functions.addItem(player, 12789, 1);
    }

    private void use13092(Player player, boolean ctrl) {    //Упаковка: Шляпа Орнитомима (30 дней)
        Functions.addItem(player, 12790, 1);
    }

    private void use13093(Player player, boolean ctrl) {    //Упаковка: Шляпа Короля Кошек (30 дней)
        Functions.addItem(player, 12791, 1);
    }

    private void use13094(Player player, boolean ctrl) {    //Упаковка: Шляпа Кота Кая (30 дней)
        Functions.addItem(player, 12792, 1);
    }

    private void use13095(Player player, boolean ctrl) {    //Упаковка: Крестик/Нолик (30 дней)
        Functions.addItem(player, 12793, 1);
        Functions.addItem(player, 12794, 1);
    }

    private void use13096(Player player, boolean ctrl) {    //Упаковка: Камень/Ножницы/Бумага (30 дней)
        Functions.addItem(player, 12795, 1);
        Functions.addItem(player, 12796, 1);
        Functions.addItem(player, 12797, 1);
    }

    private void use13097(Player player, boolean ctrl) {    //Упаковка: Браслет Сиреневого Коня
        Functions.addItem(player, 13022, 1);
    }

    private void use13098(Player player, boolean ctrl) {    //Упаковка: Изменение Цвета Титула (3 шт.)
        Functions.addItem(player, 13021, 3);
    }

    private void use13103(Player player, boolean ctrl) {    //Упаковка: Книга Телепорта к Флагу (1 шт.)
        Functions.addItem(player, 13015, 1);
    }

    private void use13105(Player player, boolean ctrl) {    //Упаковка: Билет в Камалоку (3 шт.)
        Functions.addItem(player, 13010, 5);
        Functions.addItem(player, 13011, 5);
        Functions.addItem(player, 13012, 5);
    }

    private void use13104(Player player, boolean ctrl) {    //Упаковка: Свиток Телепорта к Флагу (30 шт.)
        Functions.addItem(player, 13016, 30);
    }

    private void use13106(Player player, boolean ctrl) {    //Упаковка: Благословенные Перья (3 шт.)
        Functions.addItem(player, 10649, 3);
    }

    private void use13107(Player player, boolean ctrl) {    //Упаковка: Агатион Любви (30 дней)
        Functions.addItem(player, 13023, 3);
    }

    private void use13108(Player player, boolean ctrl) {    //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дней)
        Functions.addItem(player, 12800, 1);
    }

    private void use13109(Player player, boolean ctrl) {    //Упаковка: Билет в Камалоку (3 шт.)
        Functions.addItem(player, 13010, 5);
        Functions.addItem(player, 13011, 5);
        Functions.addItem(player, 13012, 5);
    }

    private void use13110(Player player, boolean ctrl) {    //Упаковка: Шляпа Кошки Кэт (30 дней)
        Functions.addItem(player, 12782, 1);
    }

    private void use13111(Player player, boolean ctrl) {    //Упаковка: Шляпа Королевы Кошек (30 дней)
        Functions.addItem(player, 12783, 1);
    }

    private void use13112(Player player, boolean ctrl) {    //Упаковка: Шляпа Монстроглаза (30 дней)
        Functions.addItem(player, 12786, 1);
    }

    private void use13113(Player player, boolean ctrl) {    //Упаковка: Шляпа Бурого Медведя (30 дней)
        Functions.addItem(player, 12787, 1);
    }

    private void use13114(Player player, boolean ctrl) {    //Упаковка: Шляпа Горного Гриба (30 дней)
        Functions.addItem(player, 12788, 1);
    }

    private void use13115(Player player, boolean ctrl) {
        Functions.addItem(player, 12789, 1);
    }

    private void use13116(Player player, boolean ctrl) {     //Упаковка: Шляпа Орнитомима (30 дней)">

        Functions.addItem(player, 12790, 1);
    }

    private void use13117(Player player, boolean ctrl) {     //Упаковка: Шляпа Короля Кошек (30 дней)">

        Functions.addItem(player, 12791, 1);
    }

    private void use13118(Player player, boolean ctrl) {     //Упаковка: Шляпа Кота Кая (30 дней)">

        Functions.addItem(player, 12792, 1);
    }

    private void use13119(Player player, boolean ctrl) {     //Упаковка: Крестик/Нолик (30 дней)">

        Functions.addItem(player, 12793, 1);
        Functions.addItem(player, 12794, 1);
    }

    private void use13120(Player player, boolean ctrl) {     //Упаковка: Камень/Ножницы/Бумага (30 дней)">

        Functions.addItem(player, 12795, 1);
        Functions.addItem(player, 12796, 1);
        Functions.addItem(player, 12797, 1);
    }

    private void use13121(Player player, boolean ctrl) {     //Упаковка: Браслет Сиреневого Коня (7 дней)">

        Functions.addItem(player, 13022, 1);
    }

    private void use13122(Player player, boolean ctrl) {     //Упаковка: Изменение Цвета Титула (3 шт.)">

        Functions.addItem(player, 13021, 3);
    }

    private void use13124(Player player, boolean ctrl) {     //Упаковка: Изменение Цвета Титула (1 шт.)">

        Functions.addItem(player, 13021, 1);
    }

    private void use13125(Player player, boolean ctrl) {     //Упаковка: Свиток Телепорта к Флагу (10 шт.)">

        Functions.addItem(player, 13016, 10);
    }

    private void use13126(Player player, boolean ctrl) {     //Упаковка: Витамин - Ивент">

        Functions.addItem(player, 13307, 1);
        Functions.addItem(player, 13302, 10);
        Functions.addItem(player, 13301, 1);
    }

    private void use13225(Player player, boolean ctrl) {     //Коробка: Билет в Камалоку (Зал Бездны) 15 шт.">

        Functions.addItem(player, 13010, 15);
    }

    private void use13226(Player player, boolean ctrl) {     //Коробка: Билет в Земли Камалоки 15 шт.">

        Functions.addItem(player, 13011, 15);
    }

    private void use13227(Player player, boolean ctrl) {     //Коробка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">

        Functions.addItem(player, 13012, 15);
    }

    private void use13228(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт.">

        Functions.addItem(player, 13010, 15);
    }

    private void use13229(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 15 шт.">

        Functions.addItem(player, 13011, 15);
    }

    private void use13230(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт.">

        Functions.addItem(player, 13012, 15);
    }

    private void use13231(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">

        Functions.addItem(player, 13010, 5);
    }

    private void use13232(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 5 шт.">

        Functions.addItem(player, 13011, 5);
    }

    private void use13233(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">

        Functions.addItem(player, 13012, 5);
    }

    private void use13256(Player player, boolean ctrl) {     //Упаковка: Подарок Гран Каина">

        Functions.addItem(player, 13027, 1);
    }

    private void use13257(Player player, boolean ctrl) {     //Упаковка: Подарок Гран Каина - Ивент">

        Functions.addItem(player, 13382, 1);
    }

    private void use13275(Player player, boolean ctrl) {     //Упаковка: Купон на Ожерелье Питомца (3 шт.)">

        Functions.addItem(player, 13273, 3);
    }

    private void use13276(Player player, boolean ctrl) {     //Упаковка: Купон на Ожерелье Питомца (1 шт.)">

        Functions.addItem(player, 13273, 1);
    }

    private void use13279(Player player, boolean ctrl) {     //Упаковка: Благословенное Перо (1 шт.)">

        Functions.addItem(player, 10649, 1);
    }

    private void use13291(Player player, boolean ctrl) {     //Упаковка: Крестик/Нолик (7 дней)">

        Functions.addItem(player, 13248, 1);
        Functions.addItem(player, 13249, 1);
    }

    private void use13292(Player player, boolean ctrl) {     //Упаковка: Камень/Ножницы/Бумага (7 дней)">

        Functions.addItem(player, 13250, 1);
        Functions.addItem(player, 13251, 1);
        Functions.addItem(player, 13252, 1);
    }

    private void use13341(Player player, boolean ctrl) {     //Упаковка: Книга Телепорта к Флагу (1 шт.) - Ивент">

        Functions.addItem(player, 13301, 1);
    }

    private void use13342(Player player, boolean ctrl) {     //Упаковка: Свиток Телепорта к Флагу (30 шт.) - Ивент">

        Functions.addItem(player, 13302, 30);
    }

    private void use13343(Player player, boolean ctrl) {     //Упаковка: Благословенное Перо (3 шт.) - Ивент">

        Functions.addItem(player, 13300, 3);
    }

    private void use13344(Player player, boolean ctrl) {     //Упаковка: Агатион Любви (30 дней) - Ивент">

        Functions.addItem(player, 13309, 1);
    }

    private void use13345(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Праздничную Тыкву (30 дн.) - Ивент">

        Functions.addItem(player, 13324, 1);
    }

    private void use13346(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (3 шт.) - Ивент">

        Functions.addItem(player, 13297, 5);
        Functions.addItem(player, 13298, 5);
        Functions.addItem(player, 13299, 5);
    }

    private void use13347(Player player, boolean ctrl) {     //Упаковка: Шляпа Кошки Кэт (30 дней) - Ивент">

        Functions.addItem(player, 13310, 1);
    }

    private void use13348(Player player, boolean ctrl) {     //Упаковка: Шляпа Королевы Кошек (30 дней) - Ивент">

        Functions.addItem(player, 13311, 1);
    }

    private void use13349(Player player, boolean ctrl) {     //Упаковка: Шляпа Монстроглаза (30 дней) - Ивент">

        Functions.addItem(player, 13312, 1);
    }

    private void use13350(Player player, boolean ctrl) {     //Упаковка: Шляпа Бурого Медведя (30 дней) - Ивент">

        Functions.addItem(player, 13313, 1);
    }

    private void use13351(Player player, boolean ctrl) {     //Упаковка: Шляпа Горного Гриба (30 дней) - Ивент">

        Functions.addItem(player, 13314, 1);
    }

    private void use13352(Player player, boolean ctrl) {     //Упаковка: Маска Черепа (30 дней) - Ивент">

        Functions.addItem(player, 13315, 1);
    }

    private void use13353(Player player, boolean ctrl) {     //Упаковка: Шляпа Орнитомима (30 дней) - Ивент">

        Functions.addItem(player, 13316, 1);
    }

    private void use13354(Player player, boolean ctrl) {     //Упаковка: Шляпа Короля Кошек (30 дней) - Ивент">

        Functions.addItem(player, 13317, 1);
    }

    private void use13355(Player player, boolean ctrl) {     //Упаковка: Шляпа Кота Кая (30 дней) - Ивент">

        Functions.addItem(player, 13318, 1);
    }

    private void use13356(Player player, boolean ctrl) {     //Упаковка: Крестик/Нолик (30 дней) - Ивент">

        Functions.addItem(player, 13319, 1);
        Functions.addItem(player, 13320, 1);
    }

    private void use13357(Player player, boolean ctrl) {     //Упаковка: Камень/Ножницы/Бумага (30 дней) - Ивент">

        Functions.addItem(player, 13321, 1);
        Functions.addItem(player, 13322, 1);
        Functions.addItem(player, 13323, 1);
    }

    private void use13358(Player player, boolean ctrl) {     //Упаковка: Сиреневый Конь (30 дней) - Ивент">

        Functions.addItem(player, 13308, 1);
    }

    private void use13359(Player player, boolean ctrl) {     //Упаковка: Изменение Цвета Титула (3 шт.) - Ивент">

        Functions.addItem(player, 13307, 3);
    }

    private void use13360(Player player, boolean ctrl) {     //Упаковка: Изменение Цвета Титула (1 шт.) - Ивент">

        Functions.addItem(player, 13307, 1);
    }

    private void use13361(Player player, boolean ctrl) {     //Упаковка: Свиток Телепорта к Флагу (10 шт.) - Ивент">

        Functions.addItem(player, 13016, 10);
    }

    private void use13362(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 15 шт. - Ивент">

        Functions.addItem(player, 13297, 15);
    }

    private void use13363(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 15 шт. - Ивент">

        Functions.addItem(player, 13298, 15);
    }

    private void use13364(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 15 шт. - Ивент">

        Functions.addItem(player, 13299, 15);
    }

    private void use13365(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт. - Ивент">

        Functions.addItem(player, 13297, 5);
    }

    private void use13366(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 5 шт. - Ивент">

        Functions.addItem(player, 13298, 5);
    }

    private void use13367(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт. - Ивент">

        Functions.addItem(player, 13299, 5);
    }

    private void use13368(Player player, boolean ctrl) {     //Упаковка: Благословенное Перо (1 шт.) - Ивент">

        Functions.addItem(player, 13300, 1);
    }

    private void use13369(Player player, boolean ctrl) {     //Упаковка: Агатион Любви (7 дней) - Ивент">

        Functions.addItem(player, 13340, 1);
    }

    private void use13370(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Праздничную Тыкву (7 дн.) - Ивент">

        Functions.addItem(player, 13339, 1);
    }

    private void use13371(Player player, boolean ctrl) {     //Упаковка: Шляпа Кошки Кэт (7 дней) - Ивент">

        Functions.addItem(player, 13325, 1);
    }

    private void use13372(Player player, boolean ctrl) {     //Упаковка: Шляпа Королевы Кошек (7 дней) - Ивент">

        Functions.addItem(player, 13326, 1);
    }

    private void use13373(Player player, boolean ctrl) {     //Упаковка: Шляпа Монстроглаза (7 дней) - Ивент">

        Functions.addItem(player, 13327, 1);
    }

    private void use13374(Player player, boolean ctrl) {     //Упаковка: Шляпа Бурого Медведя (7 дней) - Ивент">

        Functions.addItem(player, 13328, 1);
    }

    private void use13375(Player player, boolean ctrl) {     //Упаковка: Шляпа Горного Гриба (7 дней) - Ивент">

        Functions.addItem(player, 13329, 1);
    }

    private void use13376(Player player, boolean ctrl) {     //Упаковка: Маска Черепа (7 дней) - Ивент">

        Functions.addItem(player, 13330, 1);
    }

    private void use13377(Player player, boolean ctrl) {     //Упаковка: Шляпа Орнитомима (7 дней) - Ивент">

        Functions.addItem(player, 13331, 1);
    }

    private void use13378(Player player, boolean ctrl) {     //Упаковка: Шляпа Короля Кошек (7 дней) - Ивент">

        Functions.addItem(player, 13332, 1);
    }

    private void use13379(Player player, boolean ctrl) {     //Упаковка: Шляпа Кота Кая (7 дней) - Ивент">

        Functions.addItem(player, 13333, 1);
    }

    private void use13380(Player player, boolean ctrl) {     //Упаковка: Крестик, Нолик (7 дней) - Ивент">

        Functions.addItem(player, 13334, 1);
        Functions.addItem(player, 13335, 1);
    }

    private void use13381(Player player, boolean ctrl) {     //Упаковка: Камень/Ножницы/Бумага (7 дней) - Ивент">

        Functions.addItem(player, 13336, 1);
        Functions.addItem(player, 13337, 1);
        Functions.addItem(player, 13338, 1);
    }

    private void use13384(Player player, boolean ctrl) {     //Упаковка: Купон на Ожерелье Питомца (3 шт.) - Ивент">

        Functions.addItem(player, 13383, 3);
    }

    private void use13385(Player player, boolean ctrl) {     //Упаковка: Купон на Ожерелье Питомца (1 шт.) - Ивент">

        Functions.addItem(player, 13383, 1);
    }

    private void use13799(Player player, boolean ctrl) {     //Мешок Древних Ценностей

        int[] list = new int[]{9628, 9629, 9630};
        int[] count_min = new int[]{1, 1, 1};
        int[] count_max = new int[]{2, 2, 1};
        int[] chances = new int[]{60, 30, 35};

        if (ctrl) {
            long item_count = 1 + Functions.removeItem(player, 13799, Functions.getItemCount(player, 13799));
            for (int[] res : mass_extract_item_r(item_count, list, count_min, count_max, chances, player))
                Functions.addItem(player, res[0], res[1]);
        } else
            extract_item_r(list, count_min, count_max, chances, player);
    }

    private void use14228(Player player, boolean ctrl) {     //Упаковка: Агатион Гнева (30 дней)">

        Functions.addItem(player, 13024, 1);
    }

    private void use14229(Player player, boolean ctrl) {     //Упаковка: Агатион Радости (30 дней)">

        Functions.addItem(player, 13025, 1);
    }

    private void use14230(Player player, boolean ctrl) {     //Упаковка: Агатион Печали (30 дней)">

        Functions.addItem(player, 13026, 1);
    }

    private void use14233(Player player, boolean ctrl) {     //Упаковка: Напиток Всплеска Энергии">

        Functions.addItem(player, 14055, 1);
    }

    private void use14234(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Снеговика (30 дней)">

        Functions.addItem(player, 14056, 1);
    }

    private void use14235(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Пугало (30 дней)">

        Functions.addItem(player, 14057, 1);
    }

    private void use14236(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней)">

        Functions.addItem(player, 14058, 1);
    }

    private void use14237(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней)">

        Functions.addItem(player, 14059, 1);
    }

    private void use14238(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней)">

        Functions.addItem(player, 14060, 1);
    }

    private void use14239(Player player, boolean ctrl) {     //Упаковка: Купоны Обмена на Особого Питомца (2 шт.)">

        Functions.addItem(player, 14065, 2);
    }

    private void use14240(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва (7 дней) - Ивент">

        Functions.addItem(player, 14066, 1);
    }

    private void use14241(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука (7 дней) - Ивент">

        Functions.addItem(player, 14067, 1);
    }

    private void use14242(Player player, boolean ctrl) {     //Упаковка: Напиток Всплеска Энергии - Ивент">

        Functions.addItem(player, 14068, 1);
    }

    private void use14243(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Снеговика (30 дней) - Ивент">

        Functions.addItem(player, 14069, 1);
    }

    private void use14244(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Пугало (30 дней) - Ивент">

        Functions.addItem(player, 14070, 1);
    }

    private void use14245(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Жестяного Голема (30 дней) - Ивент">

        Functions.addItem(player, 14071, 1);
    }

    private void use14246(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медвежонок (30 дней) - Ивент">

        Functions.addItem(player, 14072, 1);
    }

    private void use14247(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медведица (30 дней) - Ивент">

        Functions.addItem(player, 14073, 1);
    }

    private void use14248(Player player, boolean ctrl) {     //Упаковка: Купон Обмена на Особого Питомца">

        Functions.addItem(player, 14065, 1);
    }

    private void use14249(Player player, boolean ctrl) {     //Упаковка: Агатион Гнева (30 дней) - Ивент">

        Functions.addItem(player, 14075, 1);
    }

    private void use14250(Player player, boolean ctrl) {     //Упаковка: Агатион Радости (30 дней) - Ивент">

        Functions.addItem(player, 14076, 1);
    }

    private void use14251(Player player, boolean ctrl) {     //Упаковка: Агатион Печали (30 дней) - Ивент">

        Functions.addItem(player, 14077, 1);
    }

    private void use14252(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (D) - Ивент">

        Functions.addItem(player, 14078, 1);
    }

    private void use14253(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (С) - Ивент">

        Functions.addItem(player, 14079, 1);
    }

    private void use14254(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (В) - Ивент">

        Functions.addItem(player, 14080, 1);
    }

    private void use14255(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (А) - Ивент">

        Functions.addItem(player, 14081, 1);
    }

    private void use14256(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (S) - Ивент">

        Functions.addItem(player, 14082, 1);
    }

    private void use14257(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (D) - Ивент">

        Functions.addItem(player, 14083, 1);
    }

    private void use14258(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (С) - Ивент">

        Functions.addItem(player, 14084, 1);
    }

    private void use14259(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (В) - Ивент">

        Functions.addItem(player, 14085, 1);
    }

    private void use14260(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (А) - Ивент">

        Functions.addItem(player, 14086, 1);
    }

    private void use14261(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (S) - Ивент">

        Functions.addItem(player, 14087, 1);
    }

    private void use14262(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Снеговика (7 дней)">

        Functions.addItem(player, 14088, 1);
    }

    private void use14263(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Пугало (7 дней)">

        Functions.addItem(player, 14089, 1);
    }

    private void use14264(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней)">

        Functions.addItem(player, 14090, 1);
    }

    private void use14265(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней)">

        Functions.addItem(player, 14091, 1);
    }

    private void use14266(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней)">

        Functions.addItem(player, 14092, 1);
    }

    private void use14270(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Снеговика (7 дней) - Ивент">

        Functions.addItem(player, 14096, 1);
    }

    private void use14271(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Пугало (7 дней) - Ивент">

        Functions.addItem(player, 14097, 1);
    }

    private void use14272(Player player, boolean ctrl) {     //Упаковка: Жезл Трансформации в Жестяного Голема (7 дней) - Ивент">

        Functions.addItem(player, 14098, 1);
    }

    private void use14273(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медвежонок (7 дней) - Ивент">

        Functions.addItem(player, 14099, 1);
    }

    private void use14274(Player player, boolean ctrl) {     //Упаковка: Браслет Призыва Агатиона: Медведица (7 дней) - Ивент">

        Functions.addItem(player, 14100, 1);
    }

    private void use14275(Player player, boolean ctrl) {     //Упаковка: Агатион Гнева (7 дней) - Ивент">

        Functions.addItem(player, 14101, 1);
    }

    private void use14276(Player player, boolean ctrl) {     //Упаковка: Агатион Радости (7 дней) - Ивент">

        Functions.addItem(player, 14102, 1);
    }

    private void use14277(Player player, boolean ctrl) {     //Упаковка: Агатион Печали (7 дней) - Ивент">

        Functions.addItem(player, 14103, 1);
    }

    private void use14278(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (D)">

        Functions.addItem(player, 12362, 1);
    }

    private void use14279(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (С)">

        Functions.addItem(player, 12363, 1);
    }

    private void use14280(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (В)">

        Functions.addItem(player, 12364, 1);
    }

    private void use14281(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (А)">

        Functions.addItem(player, 12365, 1);
    }

    private void use14282(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (S)">

        Functions.addItem(player, 12366, 1);
    }

    private void use14283(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (D)">

        Functions.addItem(player, 12367, 1);
    }

    private void use14284(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (С)">

        Functions.addItem(player, 12368, 1);
    }

    private void use14285(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (В)">

        Functions.addItem(player, 12369, 1);
    }

    private void use14286(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (А)">

        Functions.addItem(player, 12370, 1);
    }

    private void use14287(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (S)">

        Functions.addItem(player, 12371, 1);
    }

    private void use14288(Player player, boolean ctrl) {     //Упаковка: Напиток Всплеска Энергии (3 шт.)">

        Functions.addItem(player, 14055, 3);
    }

    private void use14289(Player player, boolean ctrl) {     //Упаковка: Напиток Всплеска Энергии (3 шт.) - Ивент">

        Functions.addItem(player, 14068, 3);
    }

    private void use14290(Player player, boolean ctrl) {     //Упаковка: Купоны Обмена на Особого Питомца (2 шт.) - Ивент">

        Functions.addItem(player, 14074, 2);
    }

    private void use14291(Player player, boolean ctrl) {     //Упаковка: Купон Обмена на Особого Питомца - Ивент">

        Functions.addItem(player, 14074, 1);
    }

    private void use14530(Player player, boolean ctrl) {     //Упаковка: Максвелл Хаус

        Functions.addItem(player, 13300, 3);
        Functions.addItem(player, 13383, 3);
        Functions.addItem(player, 13308, 1);
        Functions.addItem(player, 13316, 1);
    }

    private void use14639(Player player, boolean ctrl) {     //Ивент - Клеймор

        Functions.addItem(player, 70, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14640(Player player, boolean ctrl) {     //Ивент - Костолом

        Functions.addItem(player, 159, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14641(Player player, boolean ctrl) {     //Ивент - Молот Атубы

        Functions.addItem(player, 187, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14642(Player player, boolean ctrl) {     //Ивент - Посох Призрака

        Functions.addItem(player, 188, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14643(Player player, boolean ctrl) {     //Ивент - Посох Жизни

        Functions.addItem(player, 189, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14644(Player player, boolean ctrl) {     //Ивент - Булава Атубы

        Functions.addItem(player, 190, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14645(Player player, boolean ctrl) {     //Ивент - Мифриловый Кинжал

        Functions.addItem(player, 225, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14646(Player player, boolean ctrl) {     //Ивент - Шипованный Джамадхар

        Functions.addItem(player, 262, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14647(Player player, boolean ctrl) {     //Ивент - Легкий Лук

        Functions.addItem(player, 280, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14648(Player player, boolean ctrl) {     //Ивент - Глефа

        Functions.addItem(player, 297, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14649(Player player, boolean ctrl) {     //Ивент - Длинный Меч Эльфов

        Functions.addItem(player, 2499, 1);
        Functions.addItem(player, 13421, 5);
    }

    private void use14650(Player player, boolean ctrl) {     //Ивент - Длинный Меч Самурая

        Functions.addItem(player, 135, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14651(Player player, boolean ctrl) {     //Ивент - Посох Мертвеца

        Functions.addItem(player, 204, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14652(Player player, boolean ctrl) {     //Ивент - Посох Вурдалака

        Functions.addItem(player, 205, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14653(Player player, boolean ctrl) {     //Ивент - Посох Демона

        Functions.addItem(player, 206, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14654(Player player, boolean ctrl) {     //Ивент - Кристальный Кинжал

        Functions.addItem(player, 228, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14655(Player player, boolean ctrl) {     //Ивент - Большая Пата

        Functions.addItem(player, 266, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14656(Player player, boolean ctrl) {     //Ивент - Лук Превосходства

        Functions.addItem(player, 286, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14657(Player player, boolean ctrl) {     //Ивент - Секира Орков

        Functions.addItem(player, 299, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14658(Player player, boolean ctrl) {     //Ивент - Булава Якса

        Functions.addItem(player, 2503, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14659(Player player, boolean ctrl) {     //Ивент - Клинок Берсерка

        Functions.addItem(player, 5286, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14660(Player player, boolean ctrl) {     //Ивент - Меч Затмения

        Functions.addItem(player, 7888, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14661(Player player, boolean ctrl) {     //Ивент - Топор Затмения

        Functions.addItem(player, 7891, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14662(Player player, boolean ctrl) {     //Ивент - Молот Гномов

        Functions.addItem(player, 7897, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14663(Player player, boolean ctrl) {     //Ивент - Катана*Катана

        Functions.addItem(player, 2582, 1);
        Functions.addItem(player, 13421, 3);
    }

    private void use14719(Player player, boolean ctrl) {     //Упаковка Энергии - Ивент

        Functions.addItem(player, 14675, 1);
    }

    private void use14740(Player player, boolean ctrl) {     //Ивент - Упаковка Сохранения Коровы

        Functions.addItem(player, 14722, 60);
        Functions.addItem(player, 14723, 15);
        Functions.addItem(player, 14724, 1);
        Functions.addItem(player, 14725, 1);
    }

    private void use14768(Player player, boolean ctrl) {     //Подарочный Пакет для Одиноких

        Functions.addItem(player, 14770, 1);
        Functions.addItem(player, 14774, 1);
    }

    private void use15194(Player player, boolean ctrl) {     //Комплект Снаряжения Рыцаря - 10 дней

        Functions.addItem(player, 15222, 1);
        Functions.addItem(player, 15223, 1);
        Functions.addItem(player, 15224, 1);
        Functions.addItem(player, 15225, 1);
        Functions.addItem(player, 15237, 1);
        Functions.addItem(player, 15238, 1);
        Functions.addItem(player, 15241, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15195(Player player, boolean ctrl) {     //Комплект Снаряжения Мага - 10 дней

        Functions.addItem(player, 15230, 1);
        Functions.addItem(player, 15231, 1);
        Functions.addItem(player, 15232, 1);
        Functions.addItem(player, 15233, 1);
        Functions.addItem(player, 15234, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15196(Player player, boolean ctrl) {     //Комплект Снаряжения Воина - 10 дней

        Functions.addItem(player, 15222, 1);
        Functions.addItem(player, 15223, 1);
        Functions.addItem(player, 15224, 1);
        Functions.addItem(player, 15225, 1);
        Functions.addItem(player, 15237, 1);
        Functions.addItem(player, 15241, 1);
        Functions.addItem(player, 15242, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15197(Player player, boolean ctrl) {     //Комплект Снаряжения Разбойника - 10 дней

        Functions.addItem(player, 15226, 1);
        Functions.addItem(player, 15227, 1);
        Functions.addItem(player, 15228, 1);
        Functions.addItem(player, 15229, 1);
        Functions.addItem(player, 15235, 1);
        Functions.addItem(player, 15236, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15198(Player player, boolean ctrl) {     //Комплект Снаряжения Камаэль - 10 дней

        Functions.addItem(player, 15226, 1);
        Functions.addItem(player, 15227, 1);
        Functions.addItem(player, 15228, 1);
        Functions.addItem(player, 15229, 1);
        Functions.addItem(player, 15243, 1);
        Functions.addItem(player, 15244, 1);
        Functions.addItem(player, 15245, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15199(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Воина - 10 дней

        Functions.addItem(player, 15222, 1);
        Functions.addItem(player, 15223, 1);
        Functions.addItem(player, 15224, 1);
        Functions.addItem(player, 15225, 1);
        Functions.addItem(player, 15226, 1);
        Functions.addItem(player, 15227, 1);
        Functions.addItem(player, 15228, 1);
        Functions.addItem(player, 15229, 1);
        Functions.addItem(player, 15239, 1);
        Functions.addItem(player, 15240, 1);
        Functions.addItem(player, 15242, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15200(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Шамана - 10 дней

        Functions.addItem(player, 15222, 1);
        Functions.addItem(player, 15223, 1);
        Functions.addItem(player, 15224, 1);
        Functions.addItem(player, 15225, 1);
        Functions.addItem(player, 15230, 1);
        Functions.addItem(player, 15231, 1);
        Functions.addItem(player, 15232, 1);
        Functions.addItem(player, 15233, 1);
        Functions.addItem(player, 15234, 1);
        Functions.addItem(player, 15237, 1);
        Functions.addItem(player, 15270, 1);
        Functions.addItem(player, 15271, 1);
        Functions.addItem(player, 15272, 1);
        Functions.addItem(player, 15273, 1);
    }

    private void use15201(Player player, boolean ctrl) {     //Комплект Снаряжения Рыцаря - 30 дней
        //Комплект предметов для Рыцарей, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15246, 1);
        Functions.addItem(player, 15247, 1);
        Functions.addItem(player, 15248, 1);
        Functions.addItem(player, 15249, 1);
        Functions.addItem(player, 15261, 1);
        Functions.addItem(player, 15262, 1);
        Functions.addItem(player, 15265, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15202(Player player, boolean ctrl) {     //Комплект Снаряжения Мага - 30 дней
        //Комплект предметов для Магов, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15254, 1);
        Functions.addItem(player, 15255, 1);
        Functions.addItem(player, 15256, 1);
        Functions.addItem(player, 15257, 1);
        Functions.addItem(player, 15258, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15203(Player player, boolean ctrl) {     //Комплект Снаряжения Воина - 30 дней
        //Комплект предметов для Воинов, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15246, 1);
        Functions.addItem(player, 15247, 1);
        Functions.addItem(player, 15248, 1);
        Functions.addItem(player, 15249, 1);
        Functions.addItem(player, 15261, 1);
        Functions.addItem(player, 15265, 1);
        Functions.addItem(player, 15266, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15204(Player player, boolean ctrl) {     //Комплект Снаряжения Разбойника - 30 дней
        //Комплект предметов для Разбойников, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15250, 1);
        Functions.addItem(player, 15251, 1);
        Functions.addItem(player, 15252, 1);
        Functions.addItem(player, 15253, 1);
        Functions.addItem(player, 15259, 1);
        Functions.addItem(player, 15260, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15205(Player player, boolean ctrl) {     //Комплект Снаряжения Камаэль - 30 дней
        //Комплект предметов для Камаэль, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15250, 1);
        Functions.addItem(player, 15251, 1);
        Functions.addItem(player, 15252, 1);
        Functions.addItem(player, 15253, 1);
        Functions.addItem(player, 15267, 1);
        Functions.addItem(player, 15268, 1);
        Functions.addItem(player, 15269, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15206(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Воина - 30 дней
        //Комплект предметов для Орков Воинов, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15246, 1);
        Functions.addItem(player, 15247, 1);
        Functions.addItem(player, 15248, 1);
        Functions.addItem(player, 15249, 1);
        Functions.addItem(player, 15250, 1);
        Functions.addItem(player, 15251, 1);
        Functions.addItem(player, 15252, 1);
        Functions.addItem(player, 15253, 1);
        Functions.addItem(player, 15263, 1);
        Functions.addItem(player, 15264, 1);
        Functions.addItem(player, 15266, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15207(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Шамана - 30 дней
        //Комплект предметов для Орков Шаманов, участвующих в программе "Пригласи друга". Если не использовать в течение 10 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15246, 1);
        Functions.addItem(player, 15247, 1);
        Functions.addItem(player, 15248, 1);
        Functions.addItem(player, 15249, 1);
        Functions.addItem(player, 15254, 1);
        Functions.addItem(player, 15255, 1);
        Functions.addItem(player, 15256, 1);
        Functions.addItem(player, 15257, 1);
        Functions.addItem(player, 15258, 1);
        Functions.addItem(player, 15261, 1);
        Functions.addItem(player, 15274, 1);
        Functions.addItem(player, 15275, 1);
        Functions.addItem(player, 15276, 1);
        Functions.addItem(player, 15277, 1);
    }

    private void use15209(Player player, boolean ctrl) {     //Купон на Комплект Снаряжения (10 дн.)
        //Использовав талон, можно превратить комплект предметов в упаковку (10 дн.). -->

        Functions.addItem(player, 15210, 1);
    }

    private void use15212(Player player, boolean ctrl) {     //Купон на 1-ю Награду за Приглашение Друзей - Рекомендатель
        //Если использовать этот талон, он превратиться в 1-ю награду за приглашение друзей в игру. -->

        Functions.addItem(player, 15213, 1);
    }

    private void use15213(Player player, boolean ctrl) {     //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
        //Упаковка с наградами, с помощью которой можно получить Браслет Дружбы, головной убор и купон на Питомца. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15208, 1);
        Functions.addItem(player, 15221, 1);
        Functions.addItem(player, 13273, 1);
    }

    private void use15214(Player player, boolean ctrl) {     //Купон на 2-ю Награда за Приглашение Друзей - Рекомендатель
        //Если использовать этот талон, он превратиться во 2-ю награду за приглашение друзей в игру. -->

        Functions.addItem(player, 15215, 1);
    }

    private void use15215(Player player, boolean ctrl) {     //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
        //Упаковка с наградами, с помощью которой можно получить Браслет Дружбы, Браслет Печати Агатиона - Хрю-хрю, купон на Особого Питомца и рекомендацию друга. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15208, 1);
        Functions.addItem(player, 15220, 1);
        Functions.addItem(player, 14065, 1);
        Functions.addItem(player, 15279, 10);
    }

    private void use15216(Player player, boolean ctrl) {     //Купон на 1-ю Награду за Приглашение Друзей - Новичок
        //Если использовать этот талон, он превратиться в 1-ю награду за приглашение друзей в игру. -->

        Functions.addItem(player, 15217, 1);
    }

    private void use15217(Player player, boolean ctrl) {     //Упаковка: 1-я Награда за Приглашение Друзей - 30 дней
        //Упаковка с наградами, с помощью которой можно получить Браслет Дружбы, головной убор и купон на Питомца. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15208, 1);
        Functions.addItem(player, 15221, 1);
        Functions.addItem(player, 13273, 1);
        Functions.addItem(player, 15211, 1);
    }

    private void use15218(Player player, boolean ctrl) {     //Купон на 2-ю Награду за Приглашение Друзей - Новичок
        //Если использовать этот талон, он превратиться во 2-ю награду за приглашение друзей в игру. -->

        Functions.addItem(player, 15219, 1);
    }

    private void use15219(Player player, boolean ctrl) {     //Упаковка: 2-я Награда за Приглашение Друзей - 30 дней
        //Упаковка с наградами, с помощью которой можно получить Браслет Дружбы, Браслет Печати Агатиона - Хрю-хрю, купон на Особого Питомца и рекомендацию друга. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15208, 1);
        Functions.addItem(player, 15220, 1);
        Functions.addItem(player, 14065, 1);
        Functions.addItem(player, 15211, 1);
        Functions.addItem(player, 15279, 10);
    }

    private void use15222(Player player, boolean ctrl) {     //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Тяжелый Комплект Кошмаров - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15141, 1);
        Functions.addItem(player, 15142, 1);
        Functions.addItem(player, 15143, 1);
        Functions.addItem(player, 15144, 1);
        Functions.addItem(player, 15145, 1);
    }

    private void use15223(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Латных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15115, 1);
        Functions.addItem(player, 15116, 1);
        Functions.addItem(player, 15118, 1);
        Functions.addItem(player, 15120, 1);
        Functions.addItem(player, 15121, 1);
    }

    private void use15224(Player player, boolean ctrl) {     //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Полных Латных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15126, 1);
        Functions.addItem(player, 15127, 1);
        Functions.addItem(player, 15128, 1);
        Functions.addItem(player, 15129, 1);
        Functions.addItem(player, 15130, 1);
    }

    private void use15225(Player player, boolean ctrl) {     //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Панцирных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15135, 1);
        Functions.addItem(player, 15136, 1);
        Functions.addItem(player, 15137, 1);
        Functions.addItem(player, 15138, 1);
        Functions.addItem(player, 15139, 1);
        Functions.addItem(player, 15140, 1);
    }

    private void use15226(Player player, boolean ctrl) {     //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Легкий Комплект Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15110, 1);
        Functions.addItem(player, 15111, 1);
        Functions.addItem(player, 15112, 1);
        Functions.addItem(player, 15113, 1);
        Functions.addItem(player, 15093, 1);
    }

    private void use15227(Player player, boolean ctrl) {     //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Кожаных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15114, 1);
        Functions.addItem(player, 15115, 1);
        Functions.addItem(player, 15117, 1);
        Functions.addItem(player, 15119, 1);
    }

    private void use15228(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Латных Кожаных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15122, 1);
        Functions.addItem(player, 15123, 1);
        Functions.addItem(player, 15124, 1);
        Functions.addItem(player, 15125, 1);
        Functions.addItem(player, 15126, 1);
    }

    private void use15229(Player player, boolean ctrl) {     //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Доспехов из Шкуры Мантикоры- Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15131, 1);
        Functions.addItem(player, 15132, 1);
        Functions.addItem(player, 15133, 1);
        Functions.addItem(player, 15134, 1);
        Functions.addItem(player, 15137, 1);
    }

    private void use15230(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15092, 1);
        Functions.addItem(player, 15093, 1);
        Functions.addItem(player, 15094, 1);
        Functions.addItem(player, 15095, 1);
        Functions.addItem(player, 15096, 1);
    }

    private void use15231(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Авадона - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15097, 1);
        Functions.addItem(player, 15098, 1);
        Functions.addItem(player, 15099, 1);
        Functions.addItem(player, 15100, 1);
        Functions.addItem(player, 15101, 1);
    }

    private void use15232(Player player, boolean ctrl) {     //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Туники Кармиана - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15102, 1);
        Functions.addItem(player, 15103, 1);
        Functions.addItem(player, 15104, 1);
        Functions.addItem(player, 15105, 1);
        Functions.addItem(player, 15126, 1);
    }

    private void use15233(Player player, boolean ctrl) {     //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить Комплект Мифриловой Туники - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15106, 1);
        Functions.addItem(player, 15107, 1);
        Functions.addItem(player, 15108, 1);
        Functions.addItem(player, 15109, 1);
        Functions.addItem(player, 15137, 1);
    }

    private void use15234(Player player, boolean ctrl) {     //Комплект Магического Оружия - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида магического оружия рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15146, 1);
        Functions.addItem(player, 15147, 1);
        Functions.addItem(player, 15148, 1);
        Functions.addItem(player, 15149, 1);
    }

    private void use15235(Player player, boolean ctrl) {     //Комплект Кинжалов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида кинжалов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15150, 1);
        Functions.addItem(player, 15151, 1);
        Functions.addItem(player, 15152, 1);
        Functions.addItem(player, 15153, 1);
    }

    private void use15236(Player player, boolean ctrl) {     //Комплект Луков - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида луков рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15154, 1);
        Functions.addItem(player, 15155, 1);
        Functions.addItem(player, 15156, 1);
        Functions.addItem(player, 15157, 1);
    }

    private void use15237(Player player, boolean ctrl) {     //Комплект Булав - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида булав рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15158, 1);
        Functions.addItem(player, 15159, 1);
        Functions.addItem(player, 15160, 1);
        Functions.addItem(player, 15161, 1);
    }

    private void use15238(Player player, boolean ctrl) {     //Комплект Одноручными Мечами - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида одноручных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15162, 1);
        Functions.addItem(player, 15163, 1);
        Functions.addItem(player, 15164, 1);
        Functions.addItem(player, 15165, 1);
    }

    private void use15239(Player player, boolean ctrl) {     //Комплект Двуручных Мечей - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида двуручных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15166, 1);
        Functions.addItem(player, 15167, 1);
        Functions.addItem(player, 15168, 1);
        Functions.addItem(player, 15169, 1);
    }

    private void use15240(Player player, boolean ctrl) {     //Комплект Кастетов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида кастетов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15170, 1);
        Functions.addItem(player, 15171, 1);
        Functions.addItem(player, 15172, 1);
        Functions.addItem(player, 15173, 1);
    }

    private void use15241(Player player, boolean ctrl) {     //Комплект Парных Мечей - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида парных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15174, 1);
        Functions.addItem(player, 15175, 1);
        Functions.addItem(player, 15176, 1);
        Functions.addItem(player, 15177, 1);
    }

    private void use15242(Player player, boolean ctrl) {     //Комплект Копий - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида копий рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15178, 1);
        Functions.addItem(player, 15179, 1);
        Functions.addItem(player, 15180, 1);
        Functions.addItem(player, 15181, 1);
    }

    private void use15243(Player player, boolean ctrl) {     //Комплект Древних Мечей - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида древних мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15182, 1);
        Functions.addItem(player, 15183, 1);
        Functions.addItem(player, 15184, 1);
        Functions.addItem(player, 15185, 1);
    }

    private void use15244(Player player, boolean ctrl) {     //Комплект Рапир - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида рапир рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15186, 1);
        Functions.addItem(player, 15187, 1);
        Functions.addItem(player, 15188, 1);
        Functions.addItem(player, 15189, 1);
    }

    private void use15245(Player player, boolean ctrl) {     //Комплект Арбалетов - Артефакт Дружбы - 10 дней
        //Открыв эту упаковку, можно получить 4 вида арбалетов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15190, 1);
        Functions.addItem(player, 15191, 1);
        Functions.addItem(player, 15192, 1);
        Functions.addItem(player, 15193, 1);
    }

    private void use15246(Player player, boolean ctrl) {     //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15027, 1);
        Functions.addItem(player, 15028, 1);
        Functions.addItem(player, 15029, 1);
        Functions.addItem(player, 15030, 1);
        Functions.addItem(player, 15031, 1);
    }

    private void use15247(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Доспехов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Латных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15001, 1);
        Functions.addItem(player, 15002, 1);
        Functions.addItem(player, 15004, 1);
        Functions.addItem(player, 15006, 1);
        Functions.addItem(player, 15007, 1);
    }

    private void use15248(Player player, boolean ctrl) {     //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Полных Латных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15012, 1);
        Functions.addItem(player, 15013, 1);
        Functions.addItem(player, 15014, 1);
        Functions.addItem(player, 15015, 1);
        Functions.addItem(player, 15016, 1);
    }

    private void use15249(Player player, boolean ctrl) {     //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Панцирных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15021, 1);
        Functions.addItem(player, 15022, 1);
        Functions.addItem(player, 15023, 1);
        Functions.addItem(player, 15024, 1);
        Functions.addItem(player, 15025, 1);
        Functions.addItem(player, 15026, 1);
    }

    private void use15250(Player player, boolean ctrl) {     //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Легкий Комплект Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14996, 1);
        Functions.addItem(player, 14997, 1);
        Functions.addItem(player, 14998, 1);
        Functions.addItem(player, 14999, 1);
        Functions.addItem(player, 14979, 1);
    }

    private void use15251(Player player, boolean ctrl) {     //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Кожаных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15000, 1);
        Functions.addItem(player, 15001, 1);
        Functions.addItem(player, 15003, 1);
        Functions.addItem(player, 15005, 1);
    }

    private void use15252(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Латных Кожаных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15008, 1);
        Functions.addItem(player, 15009, 1);
        Functions.addItem(player, 15010, 1);
        Functions.addItem(player, 15011, 1);
        Functions.addItem(player, 15012, 1);
    }

    private void use15253(Player player, boolean ctrl) {     //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Доспехов из Шкуры Мантикоры- Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15017, 1);
        Functions.addItem(player, 15018, 1);
        Functions.addItem(player, 15019, 1);
        Functions.addItem(player, 15020, 1);
        Functions.addItem(player, 15023, 1);
    }

    private void use15254(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14978, 1);
        Functions.addItem(player, 14979, 1);
        Functions.addItem(player, 14980, 1);
        Functions.addItem(player, 14981, 1);
        Functions.addItem(player, 14982, 1);
    }

    private void use15255(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Авадона - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14983, 1);
        Functions.addItem(player, 14984, 1);
        Functions.addItem(player, 14985, 1);
        Functions.addItem(player, 14986, 1);
        Functions.addItem(player, 14987, 1);
    }

    private void use15256(Player player, boolean ctrl) {     //Упаковка: Комплект Туники Кармиана - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Туники Кармиана - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14988, 1);
        Functions.addItem(player, 14989, 1);
        Functions.addItem(player, 14990, 1);
        Functions.addItem(player, 14991, 1);
        Functions.addItem(player, 15012, 1);
    }

    private void use15257(Player player, boolean ctrl) {     //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить Комплект Мифриловой Туники - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14992, 1);
        Functions.addItem(player, 14993, 1);
        Functions.addItem(player, 14994, 1);
        Functions.addItem(player, 14995, 1);
        Functions.addItem(player, 15023, 1);
    }

    private void use15258(Player player, boolean ctrl) {     //Комплект Магического Оружия - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида магического оружия рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15032, 1);
        Functions.addItem(player, 15033, 1);
        Functions.addItem(player, 15034, 1);
        Functions.addItem(player, 15035, 1);
    }

    private void use15259(Player player, boolean ctrl) {     //Комплект Кинжалов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида кинжалов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15036, 1);
        Functions.addItem(player, 15037, 1);
        Functions.addItem(player, 15038, 1);
        Functions.addItem(player, 15039, 1);
    }

    private void use15260(Player player, boolean ctrl) {     //Комплект Луков - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида луков рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15040, 1);
        Functions.addItem(player, 15041, 1);
        Functions.addItem(player, 15042, 1);
        Functions.addItem(player, 15043, 1);
    }

    private void use15261(Player player, boolean ctrl) {     //Комплект Булав - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида булав рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15044, 1);
        Functions.addItem(player, 15045, 1);
        Functions.addItem(player, 15046, 1);
        Functions.addItem(player, 15047, 1);
    }

    private void use15262(Player player, boolean ctrl) {     //Комплект Одноручных Мечей - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида одноручных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15048, 1);
        Functions.addItem(player, 15049, 1);
        Functions.addItem(player, 15050, 1);
        Functions.addItem(player, 15051, 1);
    }

    private void use15263(Player player, boolean ctrl) {     //Комплект Двуручных Мечей - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида двуручных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15052, 1);
        Functions.addItem(player, 15053, 1);
        Functions.addItem(player, 15054, 1);
        Functions.addItem(player, 15055, 1);
    }

    private void use15264(Player player, boolean ctrl) {     //Комплект Кастетов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида кастетов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15056, 1);
        Functions.addItem(player, 15057, 1);
        Functions.addItem(player, 15058, 1);
        Functions.addItem(player, 15059, 1);
    }

    private void use15265(Player player, boolean ctrl) {     //Комплект Парных Мечей - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида парных мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15060, 1);
        Functions.addItem(player, 15061, 1);
        Functions.addItem(player, 15062, 1);
        Functions.addItem(player, 15063, 1);
    }

    private void use15266(Player player, boolean ctrl) {     //Комплект Копий - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида копий рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15064, 1);
        Functions.addItem(player, 15065, 1);
        Functions.addItem(player, 15066, 1);
        Functions.addItem(player, 15067, 1);
    }

    private void use15267(Player player, boolean ctrl) {     //Комплект Древних Мечей - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида древних мечей рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15068, 1);
        Functions.addItem(player, 15069, 1);
        Functions.addItem(player, 15070, 1);
        Functions.addItem(player, 15071, 1);
    }

    private void use15268(Player player, boolean ctrl) {     //Комплект Рапир - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида рапир рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15072, 1);
        Functions.addItem(player, 15073, 1);
        Functions.addItem(player, 15074, 1);
        Functions.addItem(player, 15075, 1);
    }

    private void use15269(Player player, boolean ctrl) {     //Комплект Арбалетов - Артефакт Дружбы - 30 дней
        //Открыв эту упаковку, можно получить 4 вида арбалетов рангов A-D. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15076, 1);
        Functions.addItem(player, 15077, 1);
        Functions.addItem(player, 15078, 1);
        Functions.addItem(player, 15079, 1);
    }

    private void use15270(Player player, boolean ctrl) {     //Комплект Величия - Артефакт Дружбы - 10 дней
        //Позволяет получить Комплект Величия - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15080, 2);
        Functions.addItem(player, 15081, 1);
        Functions.addItem(player, 15082, 2);
    }

    private void use15271(Player player, boolean ctrl) {     //Комплект Черного Снаряжения - Артефакт Дружбы - 10 дней
        //Позволяет получить Комплект Черного Снаряжения - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15084, 1);
        Functions.addItem(player, 15083, 2);
        Functions.addItem(player, 15085, 2);
    }

    private void use15272(Player player, boolean ctrl) {     //Комплект Печати - Артефакт Дружбы - 10 дней
        //Позволяет получить Снаряжение Печати - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15087, 1);
        Functions.addItem(player, 15086, 2);
        Functions.addItem(player, 15088, 2);
    }

    private void use15273(Player player, boolean ctrl) {     //Комплект Эльфов - Артефакт Дружбы - 10 дней
        //Позволяет получить Снаряжение Эльфов - Артефакт Дружбы. Исчезнет, если не использовать в течение 10 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 15090, 1);
        Functions.addItem(player, 15089, 2);
        Functions.addItem(player, 15091, 2);
    }

    private void use15274(Player player, boolean ctrl) {     //Комплект Величия - Артефакт Дружбы - 30 дней
        //Позволяет получить Комплект Величия - Артефакт Дружбы. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14966, 2);
        Functions.addItem(player, 14967, 1);
        Functions.addItem(player, 14968, 2);
    }

    private void use15275(Player player, boolean ctrl) {     //Комплект Черного Снаряжения - Артефакт Дружбы - 30 дней
        //Позволяет получить Комплект Черного Снаряжения - Артефакт Дружбы. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14970, 1);
        Functions.addItem(player, 14969, 2);
        Functions.addItem(player, 14971, 2);
    }

    private void use15276(Player player, boolean ctrl) {     //Комплект Печати - Артефакт Дружбы - 30 дней
        //Позволяет получить Снаряжение Печати - Артефакт Дружбы. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14973, 1);
        Functions.addItem(player, 14972, 2);
        Functions.addItem(player, 14974, 2);
    }

    private void use15277(Player player, boolean ctrl) {     //Комплект Эльфов - Артефакт Дружбы - 30 дней
        //Позволяет получить Снаряжение Эльфов - Артефакт Дружбы. Исчезнет, если не использовать в течение 30 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 14976, 1);
        Functions.addItem(player, 14975, 2);
        Functions.addItem(player, 14977, 2);
    }

    private void use15278(Player player, boolean ctrl) {     //Подарок Менеджера Витаминов
        //Особый подарок, полученный у Менеджера Витаминов. При использовании можно получить Парное Молоко, Свиток Благ. Телепорта, Свиток Благ. Воскрешения и Камень: Модифицировать Оружие.  -->

        Functions.addItem(player, 14739, 1);
        Functions.addItem(player, 9156, 1);
        Functions.addItem(player, 9157, 1);
        Functions.addItem(player, 14705, 1);
        Functions.addItem(player, 14706, 1);
    }

    private void use15343(Player player, boolean ctrl) {     //Упаковка: Арфа перевоплощения в Морского Эльфа (60 Дн.)
        //Витаминная упаковка\\nУпаковка с Арфой (60 дн.), превращающей в Морского Эльфа. Действует в течение 60 дней. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 15342, 1);
    }

    private void use15345(Player player, boolean ctrl) {     //Упаковка: Арфа Перевоплощения в Морского Эльфа (60 Дн.) - Ивент
        //Витаминная упаковка\\nУпаковка с Арфой (60 дн.), превращающей в Морского Эльфа. Действует в течение 60 дней. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 15344, 1);
    }

    private void use15370(Player player, boolean ctrl) {     //Особый Подарочный Пакет на Праздник Ткачихи
        //Внутри лежит Особый Подарочный Пакет на Праздник Ткачихи. Нельзя выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15372, 1);
    }

    private void use15371(Player player, boolean ctrl) {     //Подарочный Пакет на Праздник Ткачихи
        //Внутри лежит Подарочная Упаковка на Праздник Ткачихи. Нельзя выбросить, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15373, 1);
    }

    private void use15373(Player player, boolean ctrl) {     //Подарочный Сверток на Праздник Ткачихи
        //Внутри лежит 1 Рисовый Хлебец. Нельзя выбросить, уничтожить и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15379, 1);
    }

    private void use15374(Player player, boolean ctrl) {     //Особый Подарочный Пакет на Праздник Ткачихи - Ивент
        //Внутри лежит Особый Подарочный Пакет на Праздник Ткачихи. Нельзя выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15376, 1);
    }

    private void use15375(Player player, boolean ctrl) {     //Подарочный Пакет на Праздник Ткачихи - Ивент
        //Внутри лежит Подарочный Пакет на Праздник Ткачихи. Нельзя выбросить, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15377, 1);
    }

    private void use15377(Player player, boolean ctrl) {     //Подарочный Сверток на Праздник Ткачихи - Ивент
        //Внутри лежит 1 Рисовый Хлебец. Нельзя выбросить, уничтожить и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15380, 1);
    }

    private void use15378(Player player, boolean ctrl) {     //Подарочная Коробка на Праздник Ткачихи
        //Внутри лежит Радужное Одеяние Веги (7 дн.). Нельзя выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 15383, 1);
    }

    private void use15404(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2003) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 30 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->
        Functions.addItem(player, 15418, 1);
    }

    private void use15405(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2004) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 25 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->
        Functions.addItem(player, 15419, 1);
    }

    private void use15406(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2005) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 20 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->
        Functions.addItem(player, 15420, 1);
    }

    private void use15407(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2006) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 15 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->
        Functions.addItem(player, 15421, 1);
    }

    private void use15408(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2007) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 10 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15422, 1);
    }

    private void use15409(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2008) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 5 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15423, 1);
    }

    private void use15410(Player player, boolean ctrl) {     //Подарочная Коробка Вечеринки Шестилетнего Юбилея (2009) - Ивент
        //Внутри находится Праздничный Куб Шестилетнего Юбилея - 3 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15424, 1);
    }

    private void use15411(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2003) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 30 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15418, 1);
    }

    private void use15412(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2004) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 25 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15419, 1);
    }

    private void use15413(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2005) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 20 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15420, 1);
    }

    private void use15414(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2006) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 15 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15421, 1);
    }

    private void use15415(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2007) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 10 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15422, 1);
    }

    private void use15416(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2008) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 5 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15423, 1);
    }

    private void use15417(Player player, boolean ctrl) {     //Подарочный Комплект Вечеринки Шестилетнего Юбилея (2009) - Ивент
        //Сундук с Сокровищами Героя. Внутри находится Праздничный Куб Шестилетнего Юбилея - 3 дн. Исчезает по окончании ивента. Нельзя обменять, выбросить. -->

        Functions.addItem(player, 15425, 1);
        Functions.addItem(player, 15424, 1);
    }

    private void use15425(Player player, boolean ctrl) {     //Сундук Сокровищ Героя - Ивент
        //Упаковка: Комплект снаряжения - 30 дн. Внутри находятся предметы: Купон на Ожерелье Питомца и Точка Возвращения Героя. Нельзя обменять/выбросить/уничтожить. -->

        Functions.addItem(player, 15211, 1);
        Functions.addItem(player, 13273, 1);
        Functions.addItem(player, 15426, 1);
    }

    private void use15454(Player player, boolean ctrl) {     //Упаковка: Блестящая Маска Инопланетянина X235 - Ивент
        //Внутри находится Блестящая Маска Инопланетянина X235. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15449, 1);
    }

    private void use15455(Player player, boolean ctrl) {     //Упаковка: Блестящая Маска Гиганта - Ивент
        //Внутри находится Блестящая Маска Гиганта. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15450, 1);
    }

    private void use15456(Player player, boolean ctrl) {     //Упаковка: Блестящая Маска Беззвучного Крика - Ивент
        //Внутри находится Блестящая Маска Беззвучного Крика. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15451, 1);
    }

    private void use15457(Player player, boolean ctrl) {     //Упаковка: Блестящая Маска Разгневанного Духа - Ивент
        //Внутри находится Блестящая Маска Разгневанного Духа. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15452, 1);
    }

    private void use15458(Player player, boolean ctrl) {     //Упаковка: Блестящая Маска Нетленного Трупа - Ивент
        //Внутри находится Блестящая Маска Нетленного Трупа. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15453, 1);
    }

    private void use15459(Player player, boolean ctrl) {     //Упаковка: Медовая Тыква Хэллоуина - Ивент
        //В упаковке находится Медовая Тыква Хэллоуина. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15461, 1);
    }

    private void use15460(Player player, boolean ctrl) {     //Упаковка: Большая Тыква Хэллоуина - Ивент
        //В упаковке находится Большая Тыква Хэллоуина. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15462, 1);
    }

    private void use15462(Player player, boolean ctrl) {     //Большая Тыква Хэллоуина - Ивент
        //Большая Тыква Хэллоуина. Внутри находятся предметы: Медовая Тыква Хэллоуина - 6 шт. и Золотая Маска Джека О'Лантерна (7 дн.). Можно обменять, но нельзя выбросить и продать в личной торговой лавке. -->

        Functions.addItem(player, 15461, 6);
        Functions.addItem(player, 15464, 1);
    }

    private void use15465(Player player, boolean ctrl) {     //Упаковка: Медовая Тыква Хэллоуина - Ивент - Ивент
        //В упаковке находится Медовая Тыква Хэллоуина. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15461, 1);
    }

    private void use15466(Player player, boolean ctrl) {     //Упаковка: Большая Тыква Хэллоуина - Ивент - Ивент
        //В упаковке находится Большая Тыква Хэллоуина. Нельзя обменять/выбросить/продать в личной торговой лавке. -->

        Functions.addItem(player, 15462, 1);
    }

    private void use15468(Player player, boolean ctrl) {     //Большая Тыква Хэллоуина - Ивент - Ивент
        //Большая Тыква Хэллоуина. Внутри находятся предметы: Медовая Тыква Хэллоуина - 6 шт. и Золотая Маска Джека О'Лантерна (7 дн.). Можно обменять, но нельзя выбросить и продать в личной торговой лавке. -->

        Functions.addItem(player, 15461, 6);
        Functions.addItem(player, 15464, 1);
    }

    private void use16383(Player player, boolean ctrl) {     //Упаковка: Новогодний Торт
        //Внутри находится Коробка с Новогодним Тортом. Нельзя обменять, выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 16391, 1);
    }

    private void use16384(Player player, boolean ctrl) {     //Упаковка: Большой Новогодний Торт
        //Внутри находится Коробка с Большим Новогодним Тортом. Нельзя обменять, выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 16392, 1);
    }

    private void use16385(Player player, boolean ctrl) {     //Упаковка: Подарочная Коробка Плюшевого Медведя
        //Внутри находится Коробка с Плюшевым Медведем. Нельзя обменять, выбросить. Можно положить в личное хранилище. -->

        Functions.addItem(player, 16395, 1);
    }

    private void use16386(Player player, boolean ctrl) {     //Упаковка: Подарочная Коробка Плюшевой Медведицы
        //Внутри находится Коробка с Плюшевой Медведицей. Нельзя обменять, выбросить. Можно положить в личное хранилище. -->

        Functions.addItem(player, 16396, 1);
    }

    private void use16387(Player player, boolean ctrl) {     //Упаковка: Новогодний Торт - Ивент
        //Внутри находится Коробка с Новогодним Тортом. Нельзя обменять, выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 16393, 1);
    }

    private void use16388(Player player, boolean ctrl) {     //Упаковка: Большой Новогодний Торт - Ивент
        //Внутри находится Коробка с Большим Новогодним Тортом. Нельзя обменять, выбросить, продать, отправить по почте и выставить на продажу в личной торговой лавке. -->

        Functions.addItem(player, 16394, 1);
    }

    private void use16389(Player player, boolean ctrl) {     //Упаковка: Подарочная Коробка Плюшевого Медведя - Ивент
        //Внутри находится Коробка с Плюшевым Медведем. Нельзя обменять, выбросить. Можно положить в личное хранилище. -->

        Functions.addItem(player, 16397, 1);
    }

    private void use16390(Player player, boolean ctrl) {     //Упаковка: Подарочная Коробка Плюшевой Медведицы - Ивент
        //Внутри находится Коробка с Плюшевой Медведицей. Нельзя обменять, выбросить. Можно положить в личное хранилище. -->

        Functions.addItem(player, 16398, 1);
    }

    private void use16391(Player player, boolean ctrl) {     //Коробка с Новогодним Тортом
        //Коробка с Новогодним Тортом. Внутри находится Новогодний Торт и Белая Новогодняя Свеча. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16403, 1);
        Functions.addItem(player, 16404, 1);
    }

    private void use16392(Player player, boolean ctrl) {     //Коробка с Большим Новогодним Тортом
        //Коробка с Большим Новогодним Тортом. Внутри находится 5 Коробок с Новогодними Тортами и Носок для Подарков. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16391, 5);
        Functions.addItem(player, 16407, 1);
    }

    private void use16393(Player player, boolean ctrl) {     //Коробка с Новогодним Тортом - Ивент
        //Коробка с Новогодним Тортом. Внутри находится Новогодний Торт и Белая Новогодняя Свеча. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16405, 1);
        Functions.addItem(player, 16406, 1);
    }

    private void use16394(Player player, boolean ctrl) {     //Коробка с Большим Новогодним Тортом - Ивент
        //Коробка с Большим Новогодним Тортом. Внутри находится 5 Коробок с Новогодними Тортами и Носок для Подарков. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16393, 5);
        Functions.addItem(player, 16407, 1);
    }

    private void use16395(Player player, boolean ctrl) {     //Подарочная Коробка Плюшевого Медведя
        //Коробка с Плюшевым Медведем. Внутри находится Браслет Призыва Плюшевого Медведя и 3 Белых Новогодних Свечки. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16399, 1);
        Functions.addItem(player, 16404, 3);
    }

    private void use16396(Player player, boolean ctrl) {     //Подарочная Коробка Плюшевой Медведицы
        //Коробка с Плюшевой Медведицей. Внутри находится Браслет Призыва Плюшевой Медведицы и 3 Белых Новогодних Свечки. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16400, 1);
        Functions.addItem(player, 16404, 3);
    }

    private void use16397(Player player, boolean ctrl) {     //Подарочная Коробка Плюшевого Медведя - Ивент
        //Коробка с Плюшевым Медведем. Внутри находится Браслет Призыва Плюшевого Медведя и 3 Белых Новогодних Свечки. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16401, 1);
        Functions.addItem(player, 16406, 3);
    }

    private void use16398(Player player, boolean ctrl) {     //Подарочная Коробка Плюшевой Медведицы - Ивент
        //Коробка с Плюшевой Медведицей. Внутри находится Браслет Призыва Плюшевой Медведицы и 3 Белых Новогодних Свечки. Можно обменять. Нельзя выкинуть, уничтожить, продать и положить в личное хранилище. -->

        Functions.addItem(player, 16402, 1);
        Functions.addItem(player, 16406, 3);
    }

    private void use16852(Player player, boolean ctrl) {     //Коробка Сокровищ Героя
        //Внутри находится Упаковка: Комплект Снаряжения 90 дн. Нельзя обменять или выбросить и уничтожить , но можно положить в хранилище. -->

        Functions.addItem(player, 16853, 1);
        Functions.addItem(player, 13273, 1);
        Functions.addItem(player, 15426, 1);
    }

    private void use16968(Player player, boolean ctrl) {     //Комплект Снаряжения Рыцаря - 90 дней
        //Комплект предметов для Рыцарей. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16975, 1);
        Functions.addItem(player, 16976, 1);
        Functions.addItem(player, 16977, 1);
        Functions.addItem(player, 16978, 1);
        Functions.addItem(player, 16990, 1);
        Functions.addItem(player, 16991, 1);
        Functions.addItem(player, 16994, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16969(Player player, boolean ctrl) {     //Комплект Снаряжения Мага - 90 дней
        //Комплект предметов для Магов. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16983, 1);
        Functions.addItem(player, 16984, 1);
        Functions.addItem(player, 16985, 1);
        Functions.addItem(player, 16986, 1);
        Functions.addItem(player, 16987, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16970(Player player, boolean ctrl) {     //Комплект Снаряжения Воина - 90 дней
        //Комплект предметов для Воинов. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16975, 1);
        Functions.addItem(player, 16976, 1);
        Functions.addItem(player, 16977, 1);
        Functions.addItem(player, 16978, 1);
        Functions.addItem(player, 16990, 1);
        Functions.addItem(player, 16994, 1);
        Functions.addItem(player, 16995, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16971(Player player, boolean ctrl) {     //Комплект Снаряжения Разбойника - 90 дней
        //Комплект предметов для Разбойников. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16979, 1);
        Functions.addItem(player, 16980, 1);
        Functions.addItem(player, 16981, 1);
        Functions.addItem(player, 16982, 1);
        Functions.addItem(player, 16988, 1);
        Functions.addItem(player, 16989, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16972(Player player, boolean ctrl) {     //Комплект Снаряжения Камаэль - 90 дней
        //Комплект предметов для Камаэль. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16979, 1);
        Functions.addItem(player, 16980, 1);
        Functions.addItem(player, 16981, 1);
        Functions.addItem(player, 16982, 1);
        Functions.addItem(player, 16996, 1);
        Functions.addItem(player, 16997, 1);
        Functions.addItem(player, 16998, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16973(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Воина - 90 дней
        //Комплект предметов для Орков Воинов. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16975, 1);
        Functions.addItem(player, 16976, 1);
        Functions.addItem(player, 16977, 1);
        Functions.addItem(player, 16978, 1);
        Functions.addItem(player, 16979, 1);
        Functions.addItem(player, 16980, 1);
        Functions.addItem(player, 16981, 1);
        Functions.addItem(player, 16982, 1);
        Functions.addItem(player, 16992, 1);
        Functions.addItem(player, 16993, 1);
        Functions.addItem(player, 16995, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16974(Player player, boolean ctrl) {     //Комплект Снаряжения Орка Шамана - 90 дней
        //Комплект предметов для Орков Шаманов. Если не использовать в течение 90 дней, исчезнет. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16975, 1);
        Functions.addItem(player, 16976, 1);
        Functions.addItem(player, 16977, 1);
        Functions.addItem(player, 16978, 1);
        Functions.addItem(player, 16983, 1);
        Functions.addItem(player, 16984, 1);
        Functions.addItem(player, 16985, 1);
        Functions.addItem(player, 16986, 1);
        Functions.addItem(player, 16987, 1);
        Functions.addItem(player, 16990, 1);
        Functions.addItem(player, 16999, 1);
        Functions.addItem(player, 17000, 1);
        Functions.addItem(player, 17001, 1);
        Functions.addItem(player, 17002, 1);
    }

    private void use16975(Player player, boolean ctrl) {     //Упаковка: Комплект Тяжелых Доспехов Кошмаров - Артефакт Дружбы(Ранг A) - 90 дней
        //Открыв эту упаковку, можно получить Тяжелый Комплект Кошмаров - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16915, 1);
        Functions.addItem(player, 16916, 1);
        Functions.addItem(player, 16917, 1);
        Functions.addItem(player, 16918, 1);
        Functions.addItem(player, 16919, 1);
    }

    private void use16976(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Латных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16889, 1);
        Functions.addItem(player, 16890, 1);
        Functions.addItem(player, 16892, 1);
        Functions.addItem(player, 16894, 1);
        Functions.addItem(player, 16895, 1);
    }

    private void use16977(Player player, boolean ctrl) {     //Упаковка: Комплект Полных Латных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Полных Латных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16900, 1);
        Functions.addItem(player, 16901, 1);
        Functions.addItem(player, 16902, 1);
        Functions.addItem(player, 16903, 1);
        Functions.addItem(player, 16904, 1);
    }

    private void use16978(Player player, boolean ctrl) {     //Упаковка: Комплект Панцирных Доспехов - Артефакт Дружбы(Ранг D) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Панцирных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16909, 1);
        Functions.addItem(player, 16910, 1);
        Functions.addItem(player, 16911, 1);
        Functions.addItem(player, 16912, 1);
        Functions.addItem(player, 16913, 1);
        Functions.addItem(player, 16914, 1);
    }

    private void use16979(Player player, boolean ctrl) {     //Упаковка: Комплект Легких Доспехов Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
        //Открыв эту упаковку, можно получить Легкий Комплект Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16884, 1);
        Functions.addItem(player, 16885, 1);
        Functions.addItem(player, 16886, 1);
        Functions.addItem(player, 16887, 1);
        Functions.addItem(player, 16867, 1);
    }

    private void use16980(Player player, boolean ctrl) {     //Упаковка: Комплект Кожаных Доспехов Рока - Артефакт Дружбы(Ранг B) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Кожаных Доспехов Рока - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16888, 1);
        Functions.addItem(player, 16889, 1);
        Functions.addItem(player, 16891, 1);
        Functions.addItem(player, 16893, 1);
    }

    private void use16981(Player player, boolean ctrl) {     //Упаковка: Комплект Латных Кожаных Доспехов - Артефакт Дружбы(Ранг C) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Латных Кожаных Доспехов - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16896, 1);
        Functions.addItem(player, 16897, 1);
        Functions.addItem(player, 16898, 1);
        Functions.addItem(player, 16899, 1);
        Functions.addItem(player, 16900, 1);
    }

    private void use16982(Player player, boolean ctrl) {     //Упаковка: Комплект Доспехов из Шкуры Мантикоры - Артефакт Дружбы(Ранг D) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Доспехов из Шкуры Мантикоры- Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16905, 1);
        Functions.addItem(player, 16906, 1);
        Functions.addItem(player, 16907, 1);
        Functions.addItem(player, 16908, 1);
        Functions.addItem(player, 16911, 1);
    }

    private void use16983(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Кристалла Тьмы - Артефакт Дружбы(Ранг A) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Кристалла Тьмы - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16866, 1);
        Functions.addItem(player, 16867, 1);
        Functions.addItem(player, 16868, 1);
        Functions.addItem(player, 16869, 1);
        Functions.addItem(player, 16870, 1);
    }

    private void use16984(Player player, boolean ctrl) {     //Упаковка: Комплект Мантии Авадона - Артефакт Дружбы(Ранг B) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Мантии Авадона - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16871, 1);
        Functions.addItem(player, 16872, 1);
        Functions.addItem(player, 16873, 1);
        Functions.addItem(player, 16874, 1);
        Functions.addItem(player, 16875, 1);
    }

    private void use16985(Player player, boolean ctrl) {     //Упаковка: Комплект Туники Кармиана (Ранг C) - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить Комплект Туники Кармиана - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16876, 1);
        Functions.addItem(player, 16877, 1);
        Functions.addItem(player, 16878, 1);
        Functions.addItem(player, 16879, 1);
        Functions.addItem(player, 16900, 1);
    }

    private void use16986(Player player, boolean ctrl) {     //Упаковка: Комплект Мифриловой Туники - Артефакт Дружбы(Ранг D) - 90 дней
        //Открыв эту упаковку, можно получить Комплект Мифриловой Туники - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16880, 1);
        Functions.addItem(player, 16881, 1);
        Functions.addItem(player, 16882, 1);
        Functions.addItem(player, 16883, 1);
        Functions.addItem(player, 16911, 1);
    }

    private void use16987(Player player, boolean ctrl) {     //Упаковка с Магическим Оружием - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов магического оружия Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16920, 1);
        Functions.addItem(player, 16921, 1);
        Functions.addItem(player, 16922, 1);
        Functions.addItem(player, 16923, 1);
    }

    private void use16988(Player player, boolean ctrl) {     //Упаковка с Кинжалом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов кинжалов Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16924, 1);
        Functions.addItem(player, 16925, 1);
        Functions.addItem(player, 16926, 1);
        Functions.addItem(player, 16927, 1);
    }

    private void use16989(Player player, boolean ctrl) {     //Упаковка с Луком - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов луков Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16928, 1);
        Functions.addItem(player, 16929, 1);
        Functions.addItem(player, 16930, 1);
        Functions.addItem(player, 16931, 1);
    }

    private void use16990(Player player, boolean ctrl) {     //Упаковка с Булавой - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов булав Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16932, 1);
        Functions.addItem(player, 16933, 1);
        Functions.addItem(player, 16934, 1);
        Functions.addItem(player, 16935, 1);
    }

    private void use16991(Player player, boolean ctrl) {     //Упаковка с Одноручным Мечом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов одноручных мечей Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16936, 1);
        Functions.addItem(player, 16937, 1);
        Functions.addItem(player, 16938, 1);
        Functions.addItem(player, 16939, 1);
    }

    private void use16992(Player player, boolean ctrl) {     //Упаковка с Двуручным Мечом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов двуручных мечей Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16940, 1);
        Functions.addItem(player, 16941, 1);
        Functions.addItem(player, 16942, 1);
        Functions.addItem(player, 16943, 1);
    }

    private void use16993(Player player, boolean ctrl) {     //Упаковка с Кастетом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов кастетов Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16944, 1);
        Functions.addItem(player, 16945, 1);
        Functions.addItem(player, 16946, 1);
        Functions.addItem(player, 16947, 1);
    }

    private void use16994(Player player, boolean ctrl) {     //Упаковка с Парными Мечами - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов парных мечей Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16948, 1);
        Functions.addItem(player, 16949, 1);
        Functions.addItem(player, 16950, 1);
        Functions.addItem(player, 16951, 1);
    }

    private void use16995(Player player, boolean ctrl) {     //Упаковка с Копьем - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов копий Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16952, 1);
        Functions.addItem(player, 16953, 1);
        Functions.addItem(player, 16954, 1);
        Functions.addItem(player, 16955, 1);
    }

    private void use16996(Player player, boolean ctrl) {     //Упаковка с Древним Мечом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов древних мечей Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16956, 1);
        Functions.addItem(player, 16957, 1);
        Functions.addItem(player, 16958, 1);
        Functions.addItem(player, 16959, 1);
    }

    private void use16997(Player player, boolean ctrl) {     //Упаковка с Рапирой - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов рапир Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16960, 1);
        Functions.addItem(player, 16961, 1);
        Functions.addItem(player, 16962, 1);
        Functions.addItem(player, 16963, 1);
    }

    private void use16998(Player player, boolean ctrl) {     //Упаковка с Арбалетом - Артефакт Дружбы - 90 дней
        //Открыв эту упаковку, можно получить 6 видов арбалетов Рангов S – D. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16964, 1);
        Functions.addItem(player, 16965, 1);
        Functions.addItem(player, 16966, 1);
        Functions.addItem(player, 16967, 1);
    }

    private void use16999(Player player, boolean ctrl) {     //Комплект Величия (Ранг A) - Артефакт Дружбы - 90 дней
        //Позволяет получить Комплект Величия - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16854, 2);
        Functions.addItem(player, 16855, 1);
        Functions.addItem(player, 16856, 2);
    }

    private void use17000(Player player, boolean ctrl) {     //Комплект Черного Снаряжения (Ранг B) - Артефакт Дружбы - 90 дней
        //Позволяет получить Комплект Черного Снаряжения - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16858, 1);
        Functions.addItem(player, 16857, 2);
        Functions.addItem(player, 16859, 2);
    }

    private void use17001(Player player, boolean ctrl) {     //Комплект Печати (Ранг C) - Артефакт Дружбы - 90 дней
        //Позволяет получить Запечатанное Снаряжение - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16861, 1);
        Functions.addItem(player, 16860, 2);
        Functions.addItem(player, 16862, 2);
    }

    private void use17002(Player player, boolean ctrl) {     //Комплект Эльфов (Ранг D) - Артефакт Дружбы - 90 дней
        //Позволяет получить Снаряжение Эльфов - Артефакт Дружбы. Исчезнет, если не использовать в течение 90 дн. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 16864, 1);
        Functions.addItem(player, 16863, 2);
        Functions.addItem(player, 16865, 2);
    }

    private void use17019(Player player, boolean ctrl) {     //Упаковк: Браслеты Ездовых Питомцев 3 шт.
        //Витаминная упаковка\\nВнутри находится Браслет Златогривого Льва (7 дн.), Браслет Сиреневого Коня (7 дн.) и Браслет Парового Жука (7 дн.). Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 13121, 1);
        Functions.addItem(player, 14231, 1);
        Functions.addItem(player, 14232, 1);
    }

    private void use17020(Player player, boolean ctrl) {     //Упаковка: Парное Молоко - Ивент
        //Витаминная упаковка\\nВнутри находится Парное Молоко - Ивент. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 14739, 1);
    }

    private void use17021(Player player, boolean ctrl) {     //Упаковка: Опыт Витаминов 30 - Ивент
        //Витаминная упаковка\\nВнутри находится Упаковка: Купон Обмена Особого Питомца (2 шт.), Благословенное Перо (3 шт.) и Билет в Камалоку (3 шт.). Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 14239, 1);
        Functions.addItem(player, 13082, 1);
        Functions.addItem(player, 13085, 1);
    }

    private void use17022(Player player, boolean ctrl) {     //Упаковка: Знак Варка - Ивент
        //Витаминная упаковка\\nВнутри находится Знак Варка (Для Фавнов Варка). Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 13234, 1);
    }

    private void use17023(Player player, boolean ctrl) {     //Упаковка: Знак Кетра - Ивент
        //Витаминная упаковка\\nВнутри находится Знак Кетра (Для Орков Кетра). Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 13235, 1);
    }

    private void use17024(Player player, boolean ctrl) {     //Упаковка: Зелье Поддержания Энергии - Ивент
        //Витаминная упаковка\\nВнутри находится Зелье Поддержания Энергии на 30 минут (5 шт.). Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 15440, 5);
    }

    private void use17025(Player player, boolean ctrl) {     //Упаковка: Очки ПА (7000) - Ивент
        //Витаминная упаковка\\nВнутри находится 7000 очков ПА. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 14559, 1);
    }

    private void use17026(Player player, boolean ctrl) {     //Упаковка: Шляпа Старшего Помощника - Ивент
        //Витаминная упаковка\\nВнутри находится Шляпа Старшего Помощника - Ивент. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 8919, 1);
    }

    private void use17027(Player player, boolean ctrl) {     //Упаковка: Соломенная Шляпа - Ивент
        //Витаминная упаковка\\nВнутри находится Соломенная Шляпа - Ивент. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 10616, 1);
    }

    private void use17028(Player player, boolean ctrl) {     //Упаковка: Маска Фантома - Ивент
        //Витаминная упаковка\\nВнутри находится Маска Фантома - Ивент. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 9208, 1);
    }

    private void use17029(Player player, boolean ctrl) {     //Упаковка: Черная Маска Фантома - Ивент
        //Витаминная упаковка\\nВнутри находится Черная Маска Фантома - Ивент. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 9409, 1);
    }

    private void use17031(Player player, boolean ctrl) {     //Упаковка: Белая Фрея
        //Содержит Напиток Всплеска Энергии (3 шт.)\\nКристаллы ветра, огня, воды, земли, святости, тьмы.\\nВенец льда. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 17033, 1);
        Functions.addItem(player, 9552, 1);
        Functions.addItem(player, 9553, 1);
        Functions.addItem(player, 9554, 1);
        Functions.addItem(player, 9555, 1);
        Functions.addItem(player, 9556, 1);
        Functions.addItem(player, 9557, 1);
        Functions.addItem(player, 14055, 3);
    }

    private void use17032(Player player, boolean ctrl) {     //Упаковка: Сундук с Сокровищами Героя
        //Содержит сундук с Сокровищами Героя. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 16852, 1);
    }

    private void use17040(Player player, boolean ctrl) {     //Упаковка: Сундук Любви
        //Упаковка, в которой находится Сундук Любви. Нельзя обменять, выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7 июля. -->

        Functions.addItem(player, 17044, 1);
    }

    private void use17041(Player player, boolean ctrl) {     //Упаковка: Сундук Сердцебиения
        //Упаковка, в которой находится Сундук Сердцебиения. Нельзя обменять, выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7 июля. -->

        Functions.addItem(player, 17045, 1);
    }

    private void use17042(Player player, boolean ctrl) {     //Упаковка: Сундук Признания
        //Упаковка, в которой находится Сундук Признания. Нельзя обменять, выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7 июля. -->

        Functions.addItem(player, 17046, 1);
    }

    private void use17043(Player player, boolean ctrl) {     //Упаковка: Сундук Радости
        //Упаковка, в которой находится Сундук Радости. Нельзя обменять, выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7 июля. -->

        Functions.addItem(player, 17047, 1);
    }

    private void use17044(Player player, boolean ctrl) {     //Сундук Любви
        //Талисманы СИЛ, ЛВК, ВЫН. Нельзя уничтожить или выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7-го июля. -->

        Functions.addItem(player, 17051, 1);
        Functions.addItem(player, 17052, 1);
        Functions.addItem(player, 17053, 1);
    }

    private void use17045(Player player, boolean ctrl) {     //Сундук Сердцебиения
        //Талисманы МДР, ДУХ, ИНТ. Нельзя уничтожить или выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7-го июля. -->

        Functions.addItem(player, 17054, 1);
        Functions.addItem(player, 17055, 1);
        Functions.addItem(player, 17056, 1);
    }

    private void use17046(Player player, boolean ctrl) {     //Сундук Признания
        //Талисманы, дающие сопротивление оглушению, усыплению, удерживанию, параличу. Нельзя уничтожить или выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7-го июля. -->

        Functions.addItem(player, 17057, 1);
        Functions.addItem(player, 17058, 1);
        Functions.addItem(player, 17059, 1);
        Functions.addItem(player, 17060, 1);
    }

    private void use17047(Player player, boolean ctrl) {     //Сундук Радости
        //Содержит Сундуки Любви, Сердцебиения, Признания. Нельзя уничтожить или выбросить, можно положить в личное хранилище. \\n Этот предмет исчезнет после проверки 7-го июля. -->

        Functions.addItem(player, 17044, 1);
        Functions.addItem(player, 17045, 1);
        Functions.addItem(player, 17046, 1);
        Functions.addItem(player, 17050, 1);
        Functions.addItem(player, 17061, 1);
    }

    private void use17048(Player player, boolean ctrl) {     //Упаковка: Блестящий Браслет
        //Упаковка, в которой находится блестящий браслет. \\n Этот предмет исчезнет после проверки 7 июля. -->

        Functions.addItem(player, 17049, 1);
    }

    private void use17066(Player player, boolean ctrl) {     //Ивент - Упаковка: Спаси Белого Тигра
        //Ивентовая упаковка, которую можно получить один раз в 12 часов с одного аккаунта. Используйте, чтобы получить необходимые для ивента предметы : Свиток Призыва Белого Тигренка, Лекарство Купидона. Нельзя обменять. -->

        Functions.addItem(player, 17067, 60);
        Functions.addItem(player, 17068, 15);
        Functions.addItem(player, 17062, 1);
        Functions.addItem(player, 17064, 1);
    }

    private void use17082(Player player, boolean ctrl) {     //Упаковка: Книга Трансформации в Анаким
        //Упаковка, в которой находится Книга Трансформации в Анаким. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 10296, 1);
    }

    private void use17083(Player player, boolean ctrl) {     //Упаковка: Птичье Гнездо - Ивент
        //Упаковка , в которой находится Птичье Гнездо. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 10613, 1);
    }

    private void use17084(Player player, boolean ctrl) {     //Упаковка: Теневой Предмет - Шляпа Чародея - Телепорт
        //Упаковка , в которой находится Теневой Предмет - Шляпа Чародея. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 9187, 1);
    }

    private void use17085(Player player, boolean ctrl) {     //Упаковка: Теневой Предмет - Шляпа Чародея - Большая Голова
        //Упаковка , в которой находится Теневой Предмет - Шляпа Чародея. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 9194, 1);
    }

    private void use17086(Player player, boolean ctrl) {     //Упаковка: Теневой Предмет - Шляпа Чародея - Фейерверк
        //Упаковка , в которой находится Теневой Предмет - Шляпа Чародея. Нельзя обменять, выбросить, можно положить в личное хранилище. -->

        Functions.addItem(player, 9201, 1);
    }

    private void use17164(Player player, boolean ctrl) {     //Ивент - Упаковка: Энергия Ростка
        //Ивентовая упаковка, содержащая Энергию Ростка (3 штуки); нельзя обменять, выбросить, уничтожить. -->

        Functions.addItem(player, 17163, 3);
    }

    private void use17165(Player player, boolean ctrl) {     //Ивент - Упаковка: Настойка Всплеска Энергии: 30 минут
        //Ивентовая упаковка, содержащая 5 Настоек Всплеска Энергии: 30 минут; нельзя обменять, выбросить, уничтожить. -->

        Functions.addItem(player, 14744, 5);
    }

    private void use17166(Player player, boolean ctrl) {     //Упаковка: Усиливающий Камень Венеры (10 штук)
        //Упаковка, содержащая 10 Усиливающих Камней Венеры. -->

        Functions.addItem(player, 14052, 10);
    }

    private void use17167(Player player, boolean ctrl) {     //Упаковка: Свиток: Модифицировать Оружие (S)
        //Упаковка, содержащая 1 Свиток: Модифицировать Оружие (S). -->

        Functions.addItem(player, 959, 1);
    }

    private void use17168(Player player, boolean ctrl) {     //Упаковка: Кодекс Гигантов - Мастерство
        //Упаковка, содержащая 1 Кодекс Гигантов - Мастерство -->

        Functions.addItem(player, 9627, 1);
    }

    private void use17232(Player player, boolean ctrl) {     //Упаковка: Гасион с Мячом
        //Упаковка с Браслетом Гасиона с Мячом. Нельзя обменять, выбросить, продать. Можно положить в Личное Хранилище. -->

        Functions.addItem(player, 17203, 1);
    }

    private void use17233(Player player, boolean ctrl) {     //Упаковка: Родриэль с Мячом
        //Упаковка с Браслетом Родриэля с Мячом. Нельзя обменять, выбросить, продать. Можно положить в Личное Хранилище. -->

        Functions.addItem(player, 17204, 1);
    }

    private void use17234(Player player, boolean ctrl) {     //Упаковка: Пенальти
        //Упаковка с Браслетом Пенальти. Нельзя обменять, выбросить, продать. Можно положить в Личное Хранилище. -->

        Functions.addItem(player, 17205, 1);
    }

    private void use17272(Player player, boolean ctrl) {     //Упаковка: Агатион Антарас
        //Особый подарок в ознаменование завоевания Долины Драконов. При использовании можно получить Браслет Печати Агатиона Антараса -->

        Functions.addItem(player, 17269, 1);
    }

    private void use17273(Player player, boolean ctrl) {     //Упаковка: Агатион Герольд Невитта Канна
        //Особый подарок в ознаменование завершения квеста Семи Печатей. При использовании можно получить Браслет Печати Агатиона Герольда Невитта Канны. -->

        Functions.addItem(player, 17270, 1);
    }

    private void use17274(Player player, boolean ctrl) {     //Упаковка: Агатион Хранитель Рассвета Калесин
        //Особый подарок в ознаменование завершения квеста Семи Печатей. При использовании можно получить Браслет Печати Агатиона Хранителя Рассвета Калесина. -->

        Functions.addItem(player, 17271, 1);
    }

    private void use20045(Player player, boolean ctrl) {     //Упаковка: Очки в Роговой Оправе - Проворство
        //Внутри находятся очки в роговой оправе. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20016, 1);
    }

    private void use20046(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик
        //Коробка, в которой находится афроамериканский парик. -->

        Functions.addItem(player, 20017, 1);
    }

    private void use20047(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик - Большая Голова, Фейерверк
        //Коробка, в которой находится афроамериканский парик. -->

        Functions.addItem(player, 20018, 1);
    }

    private void use20048(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик - Легкая походка
        //Коробка, в которой находится афроамериканский парик. -->

        Functions.addItem(player, 20019, 1);
    }

    private void use20049(Player player, boolean ctrl) {     //Упаковка: Форменнй Головной Убор
        //Упаковка с форменным головным убором. -->

        Functions.addItem(player, 20020, 1);
    }

    private void use20050(Player player, boolean ctrl) {     //Упаковка: Бамбуковая Шляпа
        //Коробка с бамбуковой шляпой. -->

        Functions.addItem(player, 20021, 1);
    }

    private void use20051(Player player, boolean ctrl) {     //Упаковка: Маска Мародеров
        //Коробка, в которой находится маска мародеров. -->

        Functions.addItem(player, 20022, 1);
    }

    private void use20052(Player player, boolean ctrl) {     //Упаковка: Бантик
        //Внутри находится бантик. Только для персонажей женского пола. -->

        Functions.addItem(player, 20023, 1);
    }

    private void use20053(Player player, boolean ctrl) {     //Упаковка: Визоры
        //Внутри находятся визоры. Для мужчин. -->

        Functions.addItem(player, 20024, 1);
    }

    private void use20054(Player player, boolean ctrl) {     //Упаковка: Свиток Возвращения к Флагу
        //Внутри находится свиток для перемещения к флагу. -->

        Functions.addItem(player, 20025, 1);
    }

    private void use20055(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 1 шт.
        //Упаковка с Билетом в Камалоку (Зал Бездны). -->

        Functions.addItem(player, 20026, 1);
    }

    private void use20056(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 1 шт.
        //Упаковка с Билетом в Земли Камалоки -->

        Functions.addItem(player, 20027, 1);
    }

    private void use20057(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 1 шт.
        //Упаковка с Билетом в Камалоку (Лабиринт Бездны) -->

        Functions.addItem(player, 20028, 1);
    }

    private void use20058(Player player, boolean ctrl) {     //Упаковка: Браслет Сиреневого Коня
        //Упаковка с Браслетом Сиреневого Коня.  Нельзя обменять/выбросить/продать. -->

        Functions.addItem(player, 20029, 1);
    }

    private void use20062(Player player, boolean ctrl) {     //Упаковка: Флаг
        //Внутри находится флаг. -->

        Functions.addItem(player, 20033, 1);
    }

    private void use20079(Player player, boolean ctrl) {     //Упаковка: Мешки Удачи
        //Упаковка с Мешками Удачи. Нельзя обменять/выбросить/продать. Можно передавать между персонажами на одном аккаунте с помощью Менеджера Витаминов. -->

        Functions.addItem(player, 20081, 1);
    }

    private void use20080(Player player, boolean ctrl) {     //Упаковка: Четырехлистный Клевер
        //Упаковка с четырехлистными клеверами. Нельзя обменять/выбросить/продать. -->

        Functions.addItem(player, 20082, 1);
    }

    private void use20092(Player player, boolean ctrl) {     //Упаковка: Рождественские Чудеса
        //Упаковка с рождественскими чудесами. Нельзя обменять/выбросить/продать. -->

        Functions.addItem(player, 20093, 1);
    }

    private void use20096(Player player, boolean ctrl) {     //Упаковка: Волшебные Одеяния - Ивент
        //Упаковка, в которой находятся волшебные одеяния. Нельзя обменять/выбросить/продать. -->

        Functions.addItem(player, 20097, 1);
    }

    private void use20179(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 5 шт.">
        //Упаковка с Билетами в Земли Камалоки. -->

        Functions.addItem(player, 20027, 5);
    }

    private void use20180(Player player, boolean ctrl) {     //Упаковка: Билет в Земли Камалоки 10 шт.">
        //Упаковка с Билетами в Земли Камалоки. -->

        Functions.addItem(player, 20027, 10);
    }

    private void use20181(Player player, boolean ctrl) {     //Упаковка: Свитки Возвращения к Флагу 5 шт.">
        //Упаковка со Свитком Возвращения к Флагу. -->

        Functions.addItem(player, 20025, 5);
    }

    private void use20182(Player player, boolean ctrl) {     //Упаковка: Свитки Возвращения к Флагу 10ед.">
        //Упаковка со Свитком Возвращения к Флагу. -->

        Functions.addItem(player, 20025, 10);
    }

    private void use20183(Player player, boolean ctrl) {     //Упаковка: Флаги 5ед.">
        //Упаковка с Флагами. -->

        Functions.addItem(player, 20033, 5);
    }

    private void use20184(Player player, boolean ctrl) {     //Упаковка: Флаги 10ед.">
        //Упаковка с Флагами. -->

        Functions.addItem(player, 20033, 10);
    }

    private void use20185(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 5 шт.">
        //Упаковка с Билетами в Камалоку (Зал Бездны). -->

        Functions.addItem(player, 20026, 5);
    }

    private void use20186(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 5 шт.">
        //Упаковка с Билетами в Камалоку (Лабиринт Бездны). -->

        Functions.addItem(player, 20028, 5);
    }

    private void use20187(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Зал Бездны) 10 шт.">
        //Упаковка с Билетами в Камалоку (Зал Бездны). -->

        Functions.addItem(player, 20026, 10);
    }

    private void use20188(Player player, boolean ctrl) {     //Упаковка: Билет в Камалоку (Лабиринт Бездны) 10 шт.">
        //Упаковка с Билетами в Камалоку (Лабиринт Бездны). -->

        Functions.addItem(player, 20028, 10);
    }

    private void use20189(Player player, boolean ctrl) {     //Упаковка: Декорации Валентина - Премиум">
        //Упаковка с Декорацией Валентина.  Нельзя обменять/выбросить/продать. -->

        Functions.addItem(player, 20190, 1);
    }

    private void use20280(Player player, boolean ctrl) {     //Упаковка: Агатион Красный Сумоист">
        //Упаковка, в которой находится Агатион Красный Сумоист. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20297, 1);
    }

    private void use20281(Player player, boolean ctrl) {     //Упаковка: Агатион Красный Сумоист (7дн.) - Шепот Смерти">
        //Упаковка, в которой находится Агатион Красный Сумоист(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20298, 1);
    }

    private void use20282(Player player, boolean ctrl) {     //Упаковка: Агатион Синий Сумоист">
        //Упаковка, в которой находится Агатион Синий Сумоист. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20299, 1);
    }

    private void use20283(Player player, boolean ctrl) {     //Упаковка: Агатион Синий Сумоист (7дн.) - Дикая Магия">
        //Упаковка, в которой находится Агатион Синий Сумоист(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20300, 1);
    }

    private void use20284(Player player, boolean ctrl) {     //Упаковка: Агатион Сумоист Чемпион">
        //Упаковка, в которой находится Агатион Сумоист Чемпион. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20301, 1);
    }

    private void use20285(Player player, boolean ctrl) {     //Упаковка: Агатион Сумоист Чемпион (7дн.) - Большая Голова/Фейерверк">
        //Упаковка, в которой находится Агатион Сумоист Чемпион(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20302, 1);
    }

    private void use20286(Player player, boolean ctrl) {     //Упаковка: Агатион Плюшевый Медведь">
        //Упаковка, в которой находится Агатион Плюшевый Медведь. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20303, 1);
    }

    private void use20287(Player player, boolean ctrl) {     //Упаковка: Агатион Плюшевый Медведь (7 дн.) - Телепорт">
        //Упаковка, в которой находится Агатион Плюшевый Медведь(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20304, 1);
    }

    private void use20288(Player player, boolean ctrl) {     //Упаковка: Агатион Плюшевый Медведь (7дн.) - Воскрешение">
        //Упаковка, в которой находится Агатион Плюшевый Медведь(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20305, 1);
    }

    private void use20289(Player player, boolean ctrl) {     //Упаковка: Агатион Плюшевый Медведь (7дн.) - Энергия">
        //Упаковка, в которой находится Агатион Плюшевый Медведь(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20306, 1);
    }

    private void use20290(Player player, boolean ctrl) {     //Упаковка: Агатион Бог Богатства">
        //Упаковка, в которой находится Агатион Бог Богатств. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20307, 1);
    }

    private void use20291(Player player, boolean ctrl) {     //Упаковка: Агатион Бог Богатства (7дн.) - Бог Богатства">
        //Упаковка, в которой находится Агатион Бог Богатств(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20308, 1);
    }

    private void use20292(Player player, boolean ctrl) {     //Упаковка: Агатион Дриада">
        //Упаковка, в которой находится Агатион Дриада. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20309, 1);
    }

    private void use20293(Player player, boolean ctrl) {     //Упаковка: Агатион Священная Корова">
        //Упаковка, в которой находится Агатион Священная Корова. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20310, 1);
    }

    private void use20294(Player player, boolean ctrl) {     //Упаковка: Агатион Священная Корова (7дн.) - Священная Корова">
        //Упаковка, в которой находится Агатион Священная Корова(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20311, 1);
    }

    private void use20295(Player player, boolean ctrl) {     //Упаковка: Агатион Счастливая Корова">
        //Упаковка, в которой находится Агатион Счастливая Корова. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20312, 1);
    }

    private void use20296(Player player, boolean ctrl) {     //Упаковка: Агатион Счастливая Корова (7дн.) - Счастливая Корова">
        //Упаковка, в которой находится Агатион Счастливая Корова(7дн.). Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20313, 1);
    }

    private void use20314(Player player, boolean ctrl) {     //Упаковка: Праздничный Торт - Энергия">
        //Упаковка с Праздничным Тортом. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20320, 1);
    }

    private void use20315(Player player, boolean ctrl) {     //Упаковка: Очки">
        //Упаковка с Очками. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20321, 1);
    }

    private void use20316(Player player, boolean ctrl) {     //Упаковка: Шляпа Наполеона">
        //Упаковка со Шляпой Наполеона. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20322, 1);
    }

    private void use20317(Player player, boolean ctrl) {     //Упаковка: Рожки">
        //Упаковка с Рожками. Только для персонажей женского пола. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20323, 1);
    }

    private void use20318(Player player, boolean ctrl) {     //Упаковка: Маска из Черных Камней">
        //Упаковка с Маской из Черных Камней. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20324, 1);
    }

    private void use20319(Player player, boolean ctrl) {     //Упаковка: Пластиковый Парик">
        //Упаковка с Пластиковым Париком. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20325, 1);
    }

    private void use20328(Player player, boolean ctrl) {     //Упаковка: Благословенные Заряды Духа Зверя">
        //Использовав этот предмет, Вы получите 5 тысяч Благословенных Зарядов Духа Зверя. -->

        Functions.addItem(player, 20334, 5000);
    }

    private void use20331(Player player, boolean ctrl) {     //Большая Упаковка: Благословенные Заряды Духа Зверя">
        //Использовав этот предмет, Вы получите 10 тысяч Благословенных Зарядов Духа Зверя. -->

        Functions.addItem(player, 20334, 10000);
    }

    private void use20397(Player player, boolean ctrl) {     //Упаковка Развития Новичка">
        //Использовав этот предмет, Вы получите разнообразные предметы, которые помогут в охоте. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 6354, 1);
        Functions.addItem(player, 6355, 1);
        Functions.addItem(player, 13121, 1);
        Functions.addItem(player, 1060, 20);
        Functions.addItem(player, 5789, 1000);
        Functions.addItem(player, 5790, 1000);
        Functions.addItem(player, 9191, 1);
        Functions.addItem(player, 5593, 1);
    }

    private void use20398(Player player, boolean ctrl) {     //Упаковка Быстрого Развития">
        //Использовав этот предмет, Вы получите разнообразные предметы, которые помогут в охоте. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 13421, 10);
        Functions.addItem(player, 22000, 1);
        Functions.addItem(player, 22003, 1);
        Functions.addItem(player, 10649, 3);
    }

    private void use20402(Player player, boolean ctrl) {     //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Тела">
        //Упаковка со Шляпами Лэй Фэна. (7дн.) Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20399, 1);
    }

    private void use20403(Player player, boolean ctrl) {     //Упаковка: Шляпа Лэй Фэна (7дн.) - Благословение Души">
        //Упаковка со Шляпами Лэй Фэна. (7дн.) Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20400, 1);
    }

    private void use20404(Player player, boolean ctrl) {     //Упаковка: Шляпа Лэй Фэна">
        //Упаковка со Шляпами Лэй Фэна. Нельзя обменять/выбросить. -->

        Functions.addItem(player, 20401, 1);
    }

    private void use20450(Player player, boolean ctrl) {     //Упаковка: Агатион Майо (7 дн.)">
        //Внутри находится Агатион Майо (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20405, 1);
    }

    private void use20451(Player player, boolean ctrl) {     //Упаковка: Золотой Агатион (7 дн.)">
        //Внутри находится Золотой Агатион (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20406, 1);
    }

    private void use20452(Player player, boolean ctrl) {     //Упаковка: Черный Агатион (7 дн.)">
        //Внутри находится Черный Агатион (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20407, 1);
    }

    private void use20453(Player player, boolean ctrl) {     //Упаковка: Агатион Питак (7 дн.)">
        //Внутри находится Агатион Питак (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20408, 1);
    }

    private void use20454(Player player, boolean ctrl) {     //Упаковка: Агатион Питак (7 дн.)">
        //Внутри находится Агатион Питак (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20409, 1);
    }

    private void use20455(Player player, boolean ctrl) {     //Упаковка: Агатион Питак (7 дн.)">
        //Внутри находится Агатион Питак (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20410, 1);
    }

    private void use20456(Player player, boolean ctrl) {     //Упаковка: Агатион Детеныш Панды (7дн.)">
        //Внутри находится Агатион Детеныш Панды (7дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20411, 1);
    }

    private void use20457(Player player, boolean ctrl) {     //Упаковка: Агатион Панда Папа (7дн.)">
        //Внутри находится Агатион Панда Папа (7дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20412, 1);
    }

    private void use20458(Player player, boolean ctrl) {     //Упаковка: Агатион Панда Мама (7дн.)">
        //Внутри находится Агатион Панда Мама (7дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20413, 1);
    }

    private void use20459(Player player, boolean ctrl) {     //Упаковка: Очки в Роговой Оправе (7 дн.)">
        //Внутри находятся очки в роговой оправе (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20414, 1);
    }

    private void use20460(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик (7 дн.)">
        //Коробка, в которой находится афроамериканский парик (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20415, 1);
    }

    private void use20461(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик (7 дн.)">
        //Коробка, в которой находится афроамериканский парик (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20416, 1);
    }

    private void use20462(Player player, boolean ctrl) {     //Упаковка: Форменный Головной Убор (7 дн.)">
        //Упаковка с форменным головным убором (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20417, 1);
    }

    private void use20463(Player player, boolean ctrl) {     //Упаковка: Бамбуковая Шляпа (7 дн.)">
        //Коробка с бамбуковой шляпой (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20418, 1);
    }

    private void use20464(Player player, boolean ctrl) {     //Упаковка: Маска Мародеров (7 дн.)">
        //Коробка, в которой находится маска мародеров (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20419, 1);
    }

    private void use20465(Player player, boolean ctrl) {     //Упаковка: Бантик (7 дн.)">
        //Внутри находится бантик (7 дн.). Для девушек. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20420, 1);
    }

    private void use20466(Player player, boolean ctrl) {     //Упаковка: Визоры (7 дн.)">
        //Внутри находятся визоры (7 дн.). Для мужчин. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20421, 1);
    }

    private void use20467(Player player, boolean ctrl) {     //Упаковка: Шляпа Кошки Кэт (7 дн.)">
        //Внутри находится Шляпа Кошки Кэт (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20422, 1);
    }

    private void use20468(Player player, boolean ctrl) {     //Упаковка: Маска Черепа (7 дн.)">
        //Внутри находится Маска Черепа (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20423, 1);
    }

    private void use20469(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик - Золотой (7 дн.)">
        //Упаковка с Золотыми Афроамериканскими Париками. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20424, 1);
    }

    private void use20470(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик - Розовый (7 дн.)">
        //Упаковка с Розовыми Афроамериканскими Париками. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20425, 1);
    }

    private void use20471(Player player, boolean ctrl) {     //Упаковка: Очки (7 дн.)">
        //Упаковка с Очками. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20426, 1);
    }

    private void use20472(Player player, boolean ctrl) {     //Упаковка: Шляпа Наполеона (7 дн.)">
        //Упаковка со Шляпой Наполеона. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20427, 1);
    }

    private void use20473(Player player, boolean ctrl) {     //Упаковка: Рожки (7 дн.)">
        //Упаковка с Рожками. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20428, 1);
    }

    private void use20474(Player player, boolean ctrl) {     //Упаковка: Маска из Черных Камней (7 дн.)">
        //Упаковка с Маской из Черных Камней. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20429, 1);
    }

    private void use20475(Player player, boolean ctrl) {     //Упаковка: Пластиковый Парик (7 дн.)">
        //Упаковка с Пластиковым Париком. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20430, 1);
    }

    private void use20476(Player player, boolean ctrl) {     //Упаковка: Заколка Маргаритка (7 дн.)">
        //Содержит заколку в виде маргаритки. Только для женщин. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20431, 1);
    }

    private void use20477(Player player, boolean ctrl) {     //Упаковка: Заколка Незабудка (7 дн.)">
        //Содержит заколку в виде незабудки. Только для женщин. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20432, 1);
    }

    private void use20478(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Бандита (7 дн.)">
        //Внутри находится Глазная Повязка Бандита. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20433, 1);
    }

    private void use20479(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Пирата (7 дн.)">
        //Внутри находится Глазная Повязка Пирата. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20434, 1);
    }

    private void use20480(Player player, boolean ctrl) {     //Упаковка: Монокль (7 дн.)">
        //Внутри находится монокль. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20435, 1);
    }

    private void use20481(Player player, boolean ctrl) {     //Упаковка: Маска Духов (7 дн.)">
        //Внутри находится Маска Духов. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20436, 1);
    }

    private void use20482(Player player, boolean ctrl) {     //Упаковка: Рога Демона (7 дн.)">
        //Внутри находятся Рога Демона. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20437, 1);
    }

    private void use20483(Player player, boolean ctrl) {     //Упаковка: Карнавальная Маска (7 дн.)">
        //Внутри находится Карнавальная Маска. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20438, 1);
    }

    private void use20484(Player player, boolean ctrl) {     //Упаковка: Красная Карнавальная Маска (7 дн.)">
        //Внутри находится Красная Карнавальная Маска. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20439, 1);
    }

    private void use20485(Player player, boolean ctrl) {     //Упаковка: Кошачьи Ушки (7 дн.)">
        //Внутри находятся Кошачьи Ушки. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20440, 1);
    }

    private void use20486(Player player, boolean ctrl) {     //Упаковка: Заколка Леди (7 дн.)">
        //Внутри находится Заколка Леди. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20441, 1);
    }

    private void use20487(Player player, boolean ctrl) {     //Упаковка: Ушки Енота (7 дн.)">
        //Внутри находятся Ушки Енота. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20442, 1);
    }

    private void use20488(Player player, boolean ctrl) {     //Упаковка: Ушки Кролика (7 дн.)">
        //Внутри находятся Ушки Кролика. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20443, 1);
    }

    private void use20489(Player player, boolean ctrl) {     //Упаковка: Крылышко Ангела (7 дн.)">
        //Содержит украшение для волос в виде маленького крылышка ангела. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20444, 1);
    }

    private void use20490(Player player, boolean ctrl) {     //Упаковка: Антенки Феи (7 дн.)">
        //Внутри находятся Антенки Феи. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20445, 1);
    }

    private void use20491(Player player, boolean ctrl) {     //Упаковка: Украшенная Перьями Шляпа (7 дн.)">
        //Содержит шляпу, украшенную перьями. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20446, 1);
    }

    private void use20492(Player player, boolean ctrl) {     //Упаковка: Защитные Очки Ремесленника (7 дн.)">
        //Внутри находятся Защитные Очки Ремесленника. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20447, 1);
    }

    private void use20505(Player player, boolean ctrl) {     //Упаковка: Агатион Фомона">
        //Внутри находится браслет, с помощью которого можно призывать Агатиона Фомона. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20495, 1);
    }

    private void use20506(Player player, boolean ctrl) {     //Упаковка: Агатион Фомона (7 дн.)">
        //Внутри находится браслет, с помощью которого можно призывать Агатиона Фомона. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20496, 1);
    }

    private void use20507(Player player, boolean ctrl) {     //Упаковка: Почтение к Матери (24 ч.) - Ивент">
        //Ивентовый предмет, выражающий почтение к матери. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20497, 1);
    }

    private void use20508(Player player, boolean ctrl) {     //Упаковка: Почтение к Матери (3 дн.)">
        //Выражение почтения к матери. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20498, 1);
    }

    private void use20509(Player player, boolean ctrl) {     //Упаковка: Шляпа Королевы Кошек">
        //Внутри находится Шляпа Королевы Кошек. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20499, 1);
    }

    private void use20510(Player player, boolean ctrl) {     //Упаковка: Шляпа Короля Кошек">
        //Внутри находится Шляпа Короля Кошек. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20500, 1);
    }

    private void use20511(Player player, boolean ctrl) {     //Упаковка: Шляпа Кота Кая">
        //Внутри находится Шляпа Кота Кая. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20501, 1);
    }

    private void use20512(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва">
        //Содержит Браслет, позволяющий оседлать Златогривого Льва. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20502, 1);
    }

    private void use20513(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва - 30 дней">
        //Содержит Браслет, позволяющий оседлать Златогривого Льва. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20503, 1);
    }

    private void use20514(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука - 30 дней">
        //Содержит Браслет, позволяющий призвать Парового Жука. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20504, 1);
    }

    private void use20540(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука (30дн.)">
        //Внутри находится Браслет Парового Жука. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20535, 1);
    }

    private void use20541(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва (30 дн.)">
        //Внутри находится Браслет Златогривого Льва. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20536, 1);
    }

    private void use20542(Player player, boolean ctrl) {     //Упаковка: Афроамериканский Парик (7 дн.)">
        //Коробка, в которой находится афроамериканский парик (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20537, 1);
    }

    private void use20543(Player player, boolean ctrl) {     //Упаковка: Очки в Роговой Оправе (7 дн.)">
        //Внутри находятся очки в роговой оправе (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20538, 1);
    }

    private void use20544(Player player, boolean ctrl) {     //Упаковка: Бамбуковая Шляпа (7 дн.)">
        //Коробка с бамбуковой шляпой (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20539, 1);
    }

    private void use20548(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (5 ч.)">
        //Содержит Руну Опыта 30% (5 ч.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20335, 1);
    }

    private void use20549(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (5 ч.)">
        //Содержит Руну Опыта 50% (5 ч.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20336, 1);
    }

    private void use20550(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (10 ч.)">
        //Содержит Руну Опыта 30% (10 ч.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20337, 1);
    }

    private void use20551(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (10 ч.)">
        //Содержит Руну Опыта 50% (10 ч.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20338, 1);
    }

    private void use20552(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (7 дн.)">
        //Содержит Руну Опыта 30% (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20339, 1);
    }

    private void use20553(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (7 дн.)">
        //Содержит Руну Опыта 50% (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20340, 1);
    }

    private void use20554(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (5 ч.)">
        //Содержит Руну SP 30% (5 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20341, 1);
    }

    private void use20555(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (5 ч.)">
        //Содержит Руну SP 50% (5 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20342, 1);
    }

    private void use20556(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (10 ч.)">
        //Содержит Руну SP 30% (10 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20343, 1);
    }

    private void use20557(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (10 ч.)">
        //Содержит Руну SP 50% (10 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20344, 1);
    }

    private void use20558(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (7 дн.)">
        //Содержит Руну SP 30% (7 дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20345, 1);
    }

    private void use20559(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (7 дн.)">
        //Содержит Руну SP 50% (7 дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20346, 1);
    }

    private void use20560(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
        //Содержит Руну Кристалла 3 ур. (5 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20347, 1);
    }

    private void use20561(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
        //Содержит Руну Кристалла 5 ур. (5 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20348, 1);
    }

    private void use20562(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
        //Содержит Руну Кристалла 3 ур. (10 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20349, 1);
    }

    private void use20563(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
        //Содержит Руну Кристалла 5 ур. (10 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20350, 1);
    }

    private void use20564(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
        //Содержит Руну Кристалла 3 ур. (7 дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20351, 1);
    }

    private void use20565(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
        //Содержит Руну Кристалла 5 ур. (7 дн.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20352, 1);
    }

    private void use20566(Player player, boolean ctrl) {     //Упаковка: Руна Пера (24 ч.)">
        //Содержит Руну Пера (24 ч.) Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 22066, 1);
    }

    private void use20574(Player player, boolean ctrl) {     //Свиток Мастера 2 - Ивент">
        //Ивентовый предмет. Свиток, благословленный Евой. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20341, 1);
        Functions.addItem(player, 20392, 4);
    }

    private void use20576(Player player, boolean ctrl) {     //Упаковка: Диадема Евы (3 дн.) - Ивент">
        //Ивентовый Упаковка с Диадемой Евы (3 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20567, 1);
    }

    private void use20577(Player player, boolean ctrl) {     //Упаковка: Диадема Евы (7 дн.) - Ивент">
        //Упаковка с Диадемой Евы (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20568, 1);
    }

    private void use20578(Player player, boolean ctrl) {     //Упаковка: Диадема Евы - Ивент">
        //Упаковка с Диадемой Евы. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20569, 1);
    }

    private void use20579(Player player, boolean ctrl) {     //Упаковка: Руна Евы (5 ч.) - Ивент">
        //Ивентовый Упаковка с Руной Евы (5 ч.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20570, 1);
    }

    private void use20580(Player player, boolean ctrl) {     //Упаковка: Руна Евы (3 ч.) - Ивент">
        //Ивентовый Упаковка с Руной Евы (3дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20571, 1);
    }

    private void use20581(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (3 ч.)">
        //Упаковка с Руной Опыта 30% (3 ч.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20572, 1);
    }

    private void use20587(Player player, boolean ctrl) {     //Упаковка: Агатион Вега">
        //Упаковка с Агатионом Вега. Нельзя продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20591, 1);
    }

    private void use20588(Player player, boolean ctrl) {     //Упаковка: Агатион Вега (24 ч.) - Ужасающая Мощь">
        //Упаковка с Агатионом Вега (24 ч.). Нельзя продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20592, 1);
    }

    private void use20589(Player player, boolean ctrl) {     //Упаковка: Агатион Вега (3 дн.) - Ужасающая Мощь">
        //Упаковка с Агатионом Вега (3 дн.). Нельзя продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20593, 1);
    }

    private void use20590(Player player, boolean ctrl) {     //Упаковка: Браслет Любви (24 ч.) - Ивент">
        //Упаковка с Браслетом Любви (24 ч.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20594, 1);
    }

    private void use20598(Player player, boolean ctrl) {     //Упаковка: Посох Душ (7 дн.) - Танец Тени">
        //Упаковка с посохом души (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20600, 1);
    }

    private void use20599(Player player, boolean ctrl) {     //Упаковка: Шляпа Серой Души (7 дн.) - Душа Феникса">
        //Упаковка с шляпой души(7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20601, 1);
    }

    private void use20607(Player player, boolean ctrl) {     //Упаковка: Гарнитура - Тема: Город">
        //Упаковка с Гарнитурой. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20613, 1);
    }

    private void use20608(Player player, boolean ctrl) {     //Упаковка: Гарнитура - Тема: Герой">
        //Упаковка с Гарнитурой. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20614, 1);
    }

    private void use20609(Player player, boolean ctrl) {     //Упаковка: Гарнитура - Тема: Парк">
        //Упаковка с Гарнитурой. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20615, 1);
    }

    private void use20610(Player player, boolean ctrl) {     //Упаковка: Гарнитура (7 дн.) - Тема: Город. Сила души бессмертного Путешественника">
        //Упаковка с Гарнитурой (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20616, 1);
    }

    private void use20611(Player player, boolean ctrl) {     //Упаковка: Гарнитура (7 дн.) - Тема: Герой. Сила души могучего Воина">
        //Упаковка с Гарнитурой (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20617, 1);
    }

    private void use20612(Player player, boolean ctrl) {     //Упаковка: Гарнитура (7 дн.) - Тема: Парк. Сила мудрейшего Мистика">
        //Упаковка с Гарнитурой (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20618, 1);
    }

    private void use20619(Player player, boolean ctrl) {     //Упаковка: Агатион Вега (24 ч.) - Звук Свистка">
        //Упаковка с Агатионом Вега (24 ч.). Нельзя продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20621, 1);
    }

    private void use20620(Player player, boolean ctrl) {     //Упаковка: Агатион Вега (3 дн.) - Звук Свистка">
        //Упаковка с Агатионом Вега (3 дн.). Нельзя продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20622, 1);
    }

    private void use20623(Player player, boolean ctrl) {     //Упаковка: Благодать - Благовоние">
        //Упаковка с Благовониями и Благодатью. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20602, 100);
        Functions.addItem(player, 20603, 100);
    }

    private void use20624(Player player, boolean ctrl) {     //Упаковка: Благовоние 100 ед.">
        //Упаковка с Благовониями. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20603, 100);
    }

    private void use20625(Player player, boolean ctrl) {     //Упаковка: Шляпа Серой Души (7 дн.) - Воскрешение">
        //Упаковка со Шляпой Серой Души (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20626, 1);
    }

    private void use20627(Player player, boolean ctrl) {     //Упаковка: Браслет Любви (7 дн.)">
        //Упаковка с Браслетом Любви (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20628, 1);
    }

    private void use20631(Player player, boolean ctrl) {     //Упаковка: Шляпа Арбуз (7 дн.)">
        //Упаковка с Шляпой "Арбуз"(7 Дн.). Нельзя обменять/выбросить/продать. Можно сдать в личное хранилище. -->

        Functions.addItem(player, 20633, 1);
    }

    private void use20632(Player player, boolean ctrl) {     //Упаковка: Шляпа Арбуз">
        //Упаковка с Шляпой "Арбуз". Нельзя обменять/выбросить/продать. Нельзя сдать в личное хранилище. -->

        Functions.addItem(player, 20634, 1);
    }

    private void use20635(Player player, boolean ctrl) {     //Упаковка: Снаряжение для Новичков (Без ранга)">
        //Комплект предметов для новичков Адена. В нем хранится снаряжение (без ранга) и напитки.  Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 8973, 1);
        Functions.addItem(player, 8977, 1);
        Functions.addItem(player, 9030, 1);
        Functions.addItem(player, 9031, 1);
        Functions.addItem(player, 9032, 1);
        Functions.addItem(player, 9033, 1);
        Functions.addItem(player, 9034, 1);
        Functions.addItem(player, 9035, 1);
        Functions.addItem(player, 21093, 3);
        Functions.addItem(player, 21094, 3);
    }

    private void use20636(Player player, boolean ctrl) {     //Упаковка: Снаряжение для Воинов (Ранг D)">
        //Комплект предметов для новичков Адена. В нем хранится снаряжение воина(D-ранг).  Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20639, 1);
        Functions.addItem(player, 20640, 1);
        Functions.addItem(player, 20641, 1);
        Functions.addItem(player, 20642, 1);
        Functions.addItem(player, 20643, 1);
        Functions.addItem(player, 20644, 1);
        Functions.addItem(player, 20645, 1);
        Functions.addItem(player, 20646, 1);
        Functions.addItem(player, 20647, 1);
        Functions.addItem(player, 20648, 1);
    }

    private void use20637(Player player, boolean ctrl) {     //Упаковка: Снаряжение для Магов (Ранг D)">
        //Комплект предметов для новичков Адена. В нем хранится снаряжение мага(D-ранг).  Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20649, 1);
        Functions.addItem(player, 20650, 1);
        Functions.addItem(player, 20651, 1);
        Functions.addItem(player, 20652, 1);
        Functions.addItem(player, 20653, 1);
        Functions.addItem(player, 20645, 1);
    }

    private void use20638(Player player, boolean ctrl) {     //Упаковка: Поддержка Новичков">
        //Комплект предметов для новичков Адена. В нем хранятся полезные предметы.  Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->
        Functions.addItem(player, 20415, 1);
        Functions.addItem(player, 21091, 1);
        Functions.addItem(player, 21092, 1);
    }

    private void use20680(Player player, boolean ctrl) {     //Упаковка: Агатион Чончон">
        //Упаковка с Агатионом Чончон. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20654, 1);
    }

    private void use20681(Player player, boolean ctrl) {     //Упаковка: Агатион Чончон на 7 дн. - Сила души отважного Воина">
        //Упаковка с Агатионом Чончон (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20655, 1);
    }

    private void use20682(Player player, boolean ctrl) {     //Упаковка: Агатион Бум">
        //Упаковка с Агатионом Бум. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20656, 1);
    }

    private void use20683(Player player, boolean ctrl) {     //Упаковка: Агатион Бум на 7 дн. - Сила души великого Мистика">
        //Упаковка с Агатионом Бум (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20657, 1);
    }

    private void use20684(Player player, boolean ctrl) {     //Упаковка: Агатион Танцующий ребенок">
        //Упаковка с Агатионом Танцующий ребенок. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20658, 1);
    }

    private void use20685(Player player, boolean ctrl) {     //Упаковка: Агатион Танцующий ребенок на 7 дн. - Сила души выдающегося Путешественника">
        //Упаковка с Агатионом Танцующий ребенок (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20659, 1);
    }

    private void use20686(Player player, boolean ctrl) {     //Упаковка: Агатион Древнего Героя">
        //Упаковка с Агатионом Древнего Героя. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20660, 1);
    }

    private void use20687(Player player, boolean ctrl) {     //Упаковка: Агатион Древнего Героя на 7 дн. - Сила души великого Мистика">
        //Упаковка с Агатионом Древнего Героя (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20661, 1);
    }

    private void use20688(Player player, boolean ctrl) {     //Упаковка: Агатион Утанка ">
        //Упаковка с Агатионом Утанка. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20662, 1);
    }

    private void use20689(Player player, boolean ctrl) {     //Упаковка: Агатион Утанка на 7 дн. - Сила души отважного Воина">
        //Упаковка с Агатионом Утанка (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20663, 1);
    }

    private void use20690(Player player, boolean ctrl) {     //Упаковка: Агатион Бонус В">
        //Упаковка с Агатионом Бонус В. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20664, 1);
    }

    private void use20691(Player player, boolean ctrl) {     //Упаковка: Агатион Бонус В на 7 дн. - Сила души выдающегося Путешественника">
        //Упаковка с Агатионом Бонус В (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20665, 1);
    }

    private void use20692(Player player, boolean ctrl) {     //Упаковка: Головной Убор Валькирии ">
        //Упаковка с Головным убором Валькирии. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20666, 1);
    }

    private void use20693(Player player, boolean ctrl) {     //Упаковка: Головной Убор Валькирии 7 дн. - Сила души выдающегося Путешественника">
        //Упаковка с Агатионом  Головным убором Валькирии. (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20667, 1);
    }

    private void use20694(Player player, boolean ctrl) {     //Упаковка: Маска Тигра">
        //Упаковка с Маской Тигра. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20668, 1);
    }

    private void use20695(Player player, boolean ctrl) {     //Упаковка: Маска Тигра 7 дн. - Сила души отважного Воина">
        //Упаковка с Маской Тигра (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20669, 1);
    }

    private void use20696(Player player, boolean ctrl) {     //Упаковка: Ободок">
        //Упаковка с Ободком. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20670, 1);
    }

    private void use20697(Player player, boolean ctrl) {     //Упаковка: Ободок на 7 дн. - Сила души великого Мистика">
        //Упаковка с Ободком (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20671, 1);
    }

    private void use20698(Player player, boolean ctrl) {     //Упаковка: Шапка Детеныша Панды ">
        //Упаковка с Шапкой Детеныша Панды. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20672, 1);
    }

    private void use20699(Player player, boolean ctrl) {     //Упаковка: Шапка Детеныша Панды 7 дн. - Благ. Телепорт">
        //Упаковка с Шапкой Детеныша Панды (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20673, 1);
    }

    private void use20700(Player player, boolean ctrl) {     //Упаковка: Шапка Панды Папы ">
        //Упаковка с Шапкой Панды Папы. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20674, 1);
    }

    private void use20701(Player player, boolean ctrl) {     //Упаковка: Шапка Панды Папы 7дн. - Сила души выдающегося Путешественника">
        //Упаковка с Шапкой Панды Папы (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20675, 1);
    }

    private void use20702(Player player, boolean ctrl) {     //Упаковка: Шапка Панды Мамы ">
        //Упаковка с Шапкой Панды Мамы. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20676, 1);
    }

    private void use20703(Player player, boolean ctrl) {     //Упаковка: Шапка Панды Мамы 7 дн. - Благ. Воскрешение">
        //Упаковка с Шапкой Панды Мамы (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20677, 1);
    }

    private void use20704(Player player, boolean ctrl) {     //Упаковка: Головной Убор Стражника">
        //Упаковка с Головным убором Стражника. Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20678, 1);
    }

    private void use20705(Player player, boolean ctrl) {     //Упаковка: Головной Убор Стражника 7 дн. - Инстинкт разрушения">
        //Упаковка с Головным убором Стражника (7 дн.). Нельзя обменять/выбросить/продать. Можно положить в личное хранилище. -->

        Functions.addItem(player, 20679, 1);
    }

    private void use20734(Player player, boolean ctrl) {     //Golden Jack O'Lantern Mask 7-Day Pack - Authority of Golden Jack O'Lantern Mask.">

        Functions.addItem(player, 20724, 1);
    }

    private void use20735(Player player, boolean ctrl) {     //Упаковка: Агатион Мертвец">
        //Упаковка: Агатион Мертвецом. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20726, 1);
    }

    private void use20736(Player player, boolean ctrl) {     //Упаковка: Агатион Мертвец (7 дн.) - Риск для Жизни">
        //Упаковка: Агатион Мертвецом (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20727, 1);
    }

    private void use20737(Player player, boolean ctrl) {     //Упаковка: Агатион Синяя Птица">
        //Упаковка: Агатион Синяя Птица. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20732, 1);
    }

    private void use20738(Player player, boolean ctrl) {     //Упаковка: Агатион Птица">
        //Упаковка: Агатион Птица. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20733, 1);
    }

    private void use20740(Player player, boolean ctrl) {     //Упаковка: Коктейли">
        //Упаковка с Коктейлями из Сладких и Свежих Фруктов. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20393, 1);
        Functions.addItem(player, 20394, 1);
    }

    private void use20753(Player player, boolean ctrl) {     //Коробка с Подарками Седобородого Деда Мороза">
        //Коробка с новогодними подарками Седобородого Деда Мороза. Получив этот подарок, Вы сможете проводить старый год с хорошим настроением. Нельзя обменять/выкинуть/продать, но можно поместить в личное хранилище. -->


        Functions.addItem(player, 20756, 1);
        Functions.addItem(player, 20758, 1);
        Functions.addItem(player, 5561, 1);
    }

    private void use20754(Player player, boolean ctrl) {     //Коробка с Подарками Седобородого Деда Мороза - Большая">
        //Коробка с новогодними подарками Седобородого Деда Мороза. Получив этот подарок, Вы сможете проводить старый год с хорошим настроением. Нельзя обменять/выкинуть/продать, но можно поместить в личное хранилище. -->


        Functions.addItem(player, 20756, 1);
        Functions.addItem(player, 20757, 1);
        Functions.addItem(player, 5561, 1);
    }

    private void use20773(Player player, boolean ctrl) {     //Подарок Рудольфа">
        //Подарок Рудольфа, приносящий удачу в новом году. Туда входит Купон на Питомца Рудольфа, Звездные Конфеты Энергии 4 шт., Мистический Корм и Коробка со Свитками Перевоплощения. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20762, 1);
        Functions.addItem(player, 20739, 1);
        Functions.addItem(player, 20764, 1);
        Functions.addItem(player, 20765, 1);
        Functions.addItem(player, 20766, 1);
        Functions.addItem(player, 20767, 1);
        Functions.addItem(player, 20768, 1);
    }

    private void use20796(Player player, boolean ctrl) {     //Упаковка: Агатион Бог Войны (7 дн.) - Аура гнева">
        //Упаковка: Агатион Богом Войны (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20774, 1);
    }

    private void use20797(Player player, boolean ctrl) {     //Упаковка: Агатион Богиня Милосердия (7 дн.) - Благословение Милосердия">
        //Упаковка: Агатион Богиней Милосердия (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20775, 1);
    }

    private void use20798(Player player, boolean ctrl) {     //Упаковка: Агатион Китайский Актер (7 дн.) - Меч Восстановления">
        //Упаковка: Агатион Китайский Актер (7 дн. - Меч Восстановления). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20776, 1);
    }

    private void use20799(Player player, boolean ctrl) {     //Упаковка: Агатион Китайский Актер (7 дн.) - Водяной Меч">
        //Упаковка: Агатион Китайский Актер (7 дн. - Водяной Меч). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20777, 1);
    }

    private void use20800(Player player, boolean ctrl) {     //Упаковка: Агатион Китайская Актриса (7 дн.) - Копье Пламени">
        //Упаковка: Агатион Китайская Актриса (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20778, 1);
    }

    private void use20801(Player player, boolean ctrl) {     //Упаковка: Агатион Китайские Актеры (7 дн.)">
        //Упаковка: Агатион Китайские Актеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20779, 1);
    }

    private void use20802(Player player, boolean ctrl) {     //Упаковка: Агатион Китайские Актеры (7 дн.) - Меч Жизни">
        //Упаковка: Агатион Китайские Актеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20780, 1);
    }

    private void use20803(Player player, boolean ctrl) {     //Упаковка: Агатион Чипао (7 дн.) - Легкость">
        //Упаковка: Агатион Чипао (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20781, 1);
    }

    private void use20866(Player player, boolean ctrl) {     //Комплект Духовных Аватаров">
        //Упаковка с огромным комплектом из 12 Упаковок Духовных Аватаров. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20844, 1);
        Functions.addItem(player, 20842, 1);
        Functions.addItem(player, 20852, 1);
        Functions.addItem(player, 20850, 1);
        Functions.addItem(player, 20848, 1);
        Functions.addItem(player, 20846, 1);
        Functions.addItem(player, 20856, 1);
        Functions.addItem(player, 20854, 1);
        Functions.addItem(player, 20858, 1);
        Functions.addItem(player, 20860, 1);
        Functions.addItem(player, 20864, 1);
        Functions.addItem(player, 20862, 1);
    }

    private void use20869(Player player, boolean ctrl) {     //Подарок к Новому Году">
        //В подарке находится Жезл Перевоплощения Кадомацу и 3 Котацу. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20867, 1);
        Functions.addItem(player, 20868, 3);
    }

    private void use20898(Player player, boolean ctrl) {     //Упаковка: Фиолетовая Маска (7 дн.) - Благословение Души">
        //Упаковка с маской из фиолетовой бумаги (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20897, 1);
    }

    private void use20901(Player player, boolean ctrl) {     //Комплект Седобородого Деда Мороза">
        //В упаковке находятся Шапка Седобородого Деда Мороза и Нос Рудольфа. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20900, 1);
        Functions.addItem(player, 14611, 1);
    }

    private void use20902(Player player, boolean ctrl) {     //Упаковка: Кольцо Королевы Муравьев (7 дн.)">
        //Упаковка с Кольцом Королевы Муравьев (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20205, 1);
    }

    private void use20946(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл - 7 дн.">
        //Внутри находится Реактивный Мотоцикл (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20938, 1);
    }

    private void use20947(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл - 30 дн.">
        //Внутри находится Реактивный Мотоцикл (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20939, 1);
    }

    private void use20948(Player player, boolean ctrl) {     //Упаковка: Агатион Феникс - 7 дн. - Нирвана">
        //Внутри находится Агатион Феникс (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->


        Functions.addItem(player, 20940, 1);
    }

    private void use20949(Player player, boolean ctrl) {     //Упаковка: Агатион Феникс - 7 дн. - Очищение Феникса">
        //Внутри находится Агатион Феникс (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->


        Functions.addItem(player, 20941, 1);
    }

    private void use20950(Player player, boolean ctrl) {     //Упаковка: Маска Лисы">
        //Внутри находится Маска Лисы. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20942, 1);
    }

    private void use20951(Player player, boolean ctrl) {     //Упаковка: Маска Лисы - 7 дн. - Тихие Шаги">
        //Внутри находится Маска Лисы (30 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20943, 1);
    }

    private void use20952(Player player, boolean ctrl) {     //Упаковка: Шляпа Пайван">
        //Внутри находится Шляпа Пайван. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20944, 1);
    }

    private void use20953(Player player, boolean ctrl) {     //Упаковка: Шляпа Пайван - 7 дн. - Сила Богов">
        //Внутри находится Шляпа Пайван (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20945, 1);
    }

    private void use20957(Player player, boolean ctrl) {     //Упаковка: Агатион Мертвец - 7 дн. - Прозрачность Души">
        //Внутри находится Агатион Мертвец (7 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20956, 1);
    }

    private void use20959(Player player, boolean ctrl) {     //Упаковка: Королевская Корона Венеры">
        //Содержит Королевскую Корону Венеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20929, 1);
    }

    private void use20960(Player player, boolean ctrl) {     //Упаковка: Королевская Диадема Венеры">
        //Содержит Королевскую Диадему Венеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20930, 1);
    }

    private void use20961(Player player, boolean ctrl) {     //Упаковка: Диадема Дворянина">
        //Содержит Королевскую Диадему Дворянина. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20931, 1);
    }

    private void use20962(Player player, boolean ctrl) {     //Упаковка: Королевская Корона Венеры (30 дн.)">
        //Содержит Королевскую Королевскую Корону Венеры (30 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20932, 1);
    }

    private void use20963(Player player, boolean ctrl) {     //Упаковка: Королевская Диадема Венеры (30 дн.)">
        //Содержит Королевскую Королевскую Диадему Венеры (30 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20933, 1);
    }

    private void use20964(Player player, boolean ctrl) {     //Упаковка: Диадема Дворянина (30 дн.)">
        //Содержит Королевскую Диадему Дворянина (30 дн.). Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20934, 1);
    }

    private void use20965(Player player, boolean ctrl) {     //Упаковка: Королевская Корона Венеры">
        //Содержит Королевскую Корону Венеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20935, 1);
    }

    private void use20966(Player player, boolean ctrl) {     //Упаковка: Королевская Диадема Венеры">
        //Содержит Королевскую Диадему Венеры. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20936, 1);
    }

    private void use20967(Player player, boolean ctrl) {     //Упаковка с Диадемой Дворянина">
        //Содержит Королевскую Диадему Дворянина. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище. -->

        Functions.addItem(player, 20937, 1);
    }

    private void use20969(Player player, boolean ctrl) {     //Упаковка: Агатион Бог Войны">
        //Упаковка: Агатион-Богом Войны. Нельзя обменять/выбросить/продать, но можно поместить в личное хранилище.  -->

        Functions.addItem(player, 20968, 1);
    }

    private void use20994(Player player, boolean ctrl) {     //Упаковка: Агатион Трехглавый Дракон - Легкая Походка">
        //Упаковка: Агатион Трехглавый Дракон. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->


        Functions.addItem(player, 20970, 1);
    }

    private void use20995(Player player, boolean ctrl) {     //Упаковка: Маска Пекинской Оперы (Юэ Фэй) - Эффект Добродетели, Дух Трех Государств">
        //Упаковка с Маской Пекинской Оперы (Юэ Фэй). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20973, 1);
    }

    private void use20996(Player player, boolean ctrl) {     //Упаковка: Маска Пекинской Оперы (Гуань Юй) - Безмолвие Преданности, Дух Трех Государств">
        //Упаковка с Маской Пекинской Оперы (Гуань Юй). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20974, 1);
    }

    private void use20997(Player player, boolean ctrl) {     //Упаковка: Маска Пекинской Оперы (Джань Фэй) - Энергия Алмаза, Дух Трех Государств">
        //Упаковка с Маской Пекинской Оперы (Джань Фэй). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20975, 1);
    }

    private void use20998(Player player, boolean ctrl) {     //Упаковка: Шапка Дракона">
        //Упаковка с Шапкой Дракона. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20981, 1);
    }

    private void use20999(Player player, boolean ctrl) {     //Упаковка: Шапка Дракона (7 дн.) - Ускорение">
        //Упаковка с Шапкой Дракона (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->
        Functions.addItem(player, 20982, 1);
    }

    private void use21000(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Гносиан">
        //Упаковка: Агатион Ловец Мячей Гносиан. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20983, 1);
    }

    private void use21001(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Ородриэль">
        //Упаковка: Агатион Ловец Мячей Ородриэль. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20984, 1);
    }

    private void use21002(Player player, boolean ctrl) {     //Упаковка: Агатион Штрафной Удар">
        //Упаковка: Агатион Штрафной Удар. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20985, 1);
    }

    private void use21003(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Гносиан">
        //Упаковка: Агатион Ловец Мячей Гносиан. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20986, 1);
    }

    private void use21004(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Ородриэль">
        //Упаковка: Агатион Ловец Мячей Ородриэль. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20987, 1);
    }

    private void use21005(Player player, boolean ctrl) {     //Упаковка: Агатион Штрафной Удар">
        //Упаковка: Агатион Штрафной Удар. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20988, 1);
    }

    private void use21006(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Гносиан">
        //Упаковка: Агатион Ловец Мячей Гносиан. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20989, 1);
    }

    private void use21007(Player player, boolean ctrl) {     //Упаковка: Агатион Ловец Мячей Ородриэль">
        //Упаковка: Агатион Ловец Мячей Ородриэль. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20990, 1);
    }

    private void use21008(Player player, boolean ctrl) {     //Упаковка: Агатион Штрафной Удар">
        //Упаковка: Агатион Штрафной Удар. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20991, 1);
    }

    private void use21024(Player player, boolean ctrl) {     //Упаковка: Африканский Парик-Мяч (Белый)">
        //Содержит африканский парик-мяч (белый). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21009, 1);
    }

    private void use21025(Player player, boolean ctrl) {     //Упаковка: Африканский Парик-Мяч (Синий)">
        //Содержит африканский парик-мяч (синий). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21010, 1);
    }

    private void use21026(Player player, boolean ctrl) {     //Упаковка: Африканский Парик-Мяч (Красный) - Благословение Победы">
        //Содержит африканский парик-мяч (красный). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21011, 1);
    }

    private void use21027(Player player, boolean ctrl) {     //Упаковка: Марка Победы (Корея)">
        //Содержит марку победы(Корея). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21012, 1);
    }

    private void use21028(Player player, boolean ctrl) {     //Упаковка: Марка Победы (Япония)">
        //Содержит марку победы(Япония). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21013, 1);
    }

    private void use21029(Player player, boolean ctrl) {     //Упаковка: Марка Поддержки">
        //Содержит марку поддержки. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21014, 1);
    }

    private void use21063(Player player, boolean ctrl) {     //Упаковка: Национальная Шляпа (7 дн.)">
        //Упаковка с Национальной Шляпой (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21042, 1);
    }

    private void use21064(Player player, boolean ctrl) {     //Упаковка: Национальная Шляпа">
        //Упаковка с Национальной Шляпой. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21043, 1);
    }

    private void use21065(Player player, boolean ctrl) {     //Упаковка: Шапка Тигрицы-Старушки">
        //Упаковка с Шапкой Тигрицы-Старушки. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21044, 1);
    }

    private void use21066(Player player, boolean ctrl) {     //Упаковка: Шапка Пчелы-Труженицы">
        //Упаковка с Шапкой Пчелы-Труженицы. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21045, 1);
    }

    private void use21067(Player player, boolean ctrl) {     //Упаковка: Агатион Тигрица-Старушка (7 дн.)">
        //Упаковка с Браслетом Агатиона Тигрица-Старушка (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21046, 1);
    }

    private void use21068(Player player, boolean ctrl) {     //Упаковка: Агатион Тигрица-Старушка">
        //Упаковка с Браслетом Агатиона Тигрица-Старушка. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21047, 1);
    }

    private void use21069(Player player, boolean ctrl) {     //Упаковка: Агатион Фея Цветов">
        //Упаковка с Браслетом Агатиона Фея Цветов. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21048, 1);
    }

    private void use21070(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Ородриэль (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Ородриэль (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21049, 1);
    }

    private void use21071(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Ородриэль">
        //Упаковка с Браслетом Агатиона Болельщица Ородриэль. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21050, 1);
    }

    private void use21072(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Лана (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Лана (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21051, 1);
    }

    private void use21073(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Лана">
        //Упаковка с Браслетом Агатиона Болельщица Лана. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21052, 1);
    }

    private void use21074(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Наонин (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Наонин (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21053, 1);
    }

    private void use21075(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Наонин">
        //Упаковка с Браслетом Агатиона Болельщица Наонин. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21054, 1);
    }

    private void use21076(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Мортия (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Мортия (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21055, 1);
    }

    private void use21077(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Мортия">
        //Упаковка с Браслетом Агатиона Болельщица Мортия. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21056, 1);
    }

    private void use21078(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Каурин (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Каурин (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21057, 1);
    }

    private void use21079(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Каурин">
        //Упаковка с Браслетом Агатиона Болельщица Каурин. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21058, 1);
    }

    private void use21080(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Мерурил (7 дн.)">
        //Упаковка с Браслетом Агатиона Болельщица Мерурил (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21059, 1);
    }

    private void use21081(Player player, boolean ctrl) {     //Упаковка: Агатион Болельщица Мерурил">
        //Упаковка с Браслетом Агатиона Болельщица Мерурил. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21060, 1);
    }

    private void use21082(Player player, boolean ctrl) {     //Упаковка: Агатион Ханди (7 дн.)">
        //Упаковка с Браслетом Агатиона Ханди (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21061, 1);
    }

    private void use21083(Player player, boolean ctrl) {     //Упаковка: Агатион Ханди">
        //Упаковка с Браслетом Агатиона Ханди. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21062, 1);
    }

    private void use21085(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (1 ч.)">
        //Упаковка с Руной Опыта 30% (1 ч.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21084, 1);
    }

    private void use21087(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (1 ч.)">
        //Содержит Руну SP 30% (1 ч.) Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 21086, 1);
    }

    private void use21089(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл">
        //Упаковка с Реактивным Мотоциклом. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище.  -->

        Functions.addItem(player, 21088, 1);
    }

    private void use21091(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (7 дн.)">
        //Содержит Руну Опыта 50% (7 дн.). Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20340, 1);
    }

    private void use21092(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (7 дн.)">
        //Содержит Руну SP 50% (7 дн.) Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 20346, 1);
    }

    private void use21095(Player player, boolean ctrl) {     //Упаковка: Обруч Льда">
        //Содержит Обруч Льда. Нельзя обменять/выбросить/продать. Можно поместить в личное хранилище. -->

        Functions.addItem(player, 17033, 1);
    }

    private void use21169(Player player, boolean ctrl) {     //Коробка с Подарком на веселый день рождения">
        //Подарок, вручаемый Аллегрией на день рождения персонажа. При использовании можно получить 1 Порцию Энергии Радости, Торт Именинника и Колпак "С Днем Рождения!". Нельзя обменять, выбросить или продать, можно положить в личное хранилище. -->

        Functions.addItem(player, 21170, 1);
        Functions.addItem(player, 21595, 1);
        Functions.addItem(player, 21594, 1);
    }

    private void use21601(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (5 ч.)">
        //Упаковка с Руной Опыта 30%(5 ч.) -->

        Functions.addItem(player, 20335, 1);
    }

    private void use21602(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (5 ч.)">
        //Упаковка с Руной Опыта 50%(5 ч.) -->

        Functions.addItem(player, 20336, 1);
    }

    private void use21603(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (10 ч.)">
        //Упаковка с Руной Опыта 30%(10 ч.) -->

        Functions.addItem(player, 20337, 1);
    }

    private void use21604(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (10 ч.)">
        //Упаковка с Руной Опыта 50%(10 ч.) -->

        Functions.addItem(player, 20338, 1);
    }

    private void use21605(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 30% (7 дней)">
        //Упаковка с Руной Опыта 30%(7 дней) -->

        Functions.addItem(player, 20339, 1);
    }

    private void use21606(Player player, boolean ctrl) {     //Упаковка: Руна Опыта 50% (7 дней)">
        //Упаковка с Руной Опыта 50%(7 дней) -->

        Functions.addItem(player, 20340, 1);
    }

    private void use21607(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (5 ч.)">
        //Упаковка с Руной SP 30%(5 ч.) -->

        Functions.addItem(player, 20341, 1);
    }

    private void use21608(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (5 ч.)">
        //Упаковка с Руной SP 30%(5 ч.) -->

        Functions.addItem(player, 20342, 1);
    }

    private void use21609(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (10 ч.)">
        //Внутри находится Руна SP 30% (10 ч.). -->

        Functions.addItem(player, 20343, 1);
    }

    private void use21610(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (10 ч.)">
        //Внутри находится Руна SP 50% (10 ч.). -->

        Functions.addItem(player, 20344, 1);
    }

    private void use21611(Player player, boolean ctrl) {     //Упаковка: Руна SP 30% (7 дн.)">
        //Внутри находится Руна SP 30% (7 дн.). -->

        Functions.addItem(player, 20345, 1);
    }

    private void use21612(Player player, boolean ctrl) {     //Упаковка: Руна SP 50% (7 дн.)">
        //Внутри находится Руна SP 50% (7 дн.). -->

        Functions.addItem(player, 20346, 1);
    }

    private void use21613(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (5 ч.)">
        //Внутри находится Руна Кристалла 3-го уровня (5 ч.). -->

        Functions.addItem(player, 20347, 1);
    }

    private void use21614(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (5 ч.)">
        //Внутри находится Руна Кристалла 5-го уровня (5 ч.). -->

        Functions.addItem(player, 20348, 1);
    }

    private void use21615(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (10 ч.)">
        //Внутри находится Руна Кристалла 3-го уровня (10 ч.). -->

        Functions.addItem(player, 20349, 1);
    }

    private void use21616(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (10 ч.)">
        //Внутри находится Руна Кристалла 5-го уровня (10 ч.). -->

        Functions.addItem(player, 20350, 1);
    }

    private void use21617(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 3 ур. (7 дн.)">
        //Внутри находится Руна Кристалла 3-го уровня (7 дн.). -->

        Functions.addItem(player, 20351, 1);
    }

    private void use21618(Player player, boolean ctrl) {     //Упаковка: Руна Кристалла 5 ур. (7 дн.)">
        //Внутри находится Руна Кристалла 5-го уровня (7 дн.). -->

        Functions.addItem(player, 20352, 1);
    }

    private void use21619(Player player, boolean ctrl) {     //Упаковка: Руна Пера (24 ч.)">
        //Внутри находится Руна Пера (24 часа). -->

        Functions.addItem(player, 22066, 1);
    }

    private void use21620(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (D)">
        //Внутри находится Камень: Модифицировать Оружие Ранга D. -->

        Functions.addItem(player, 12362, 1);
    }

    private void use21621(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (С)">
        //Внутри находится Камень: Модифицировать Оружие Ранга С. -->

        Functions.addItem(player, 12363, 1);
    }

    private void use21622(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (В)">
        //Внутри находится Камень: Модифицировать Оружие Ранга В. -->

        Functions.addItem(player, 12364, 1);
    }

    private void use21623(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (А)">
        //Внутри находится Камень: Модифицировать Оружие Ранга А. -->

        Functions.addItem(player, 12365, 1);
    }

    private void use21624(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Оружие (S)">
        //Внутри находится Камень: Модифицировать Оружие Ранга S. -->

        Functions.addItem(player, 12366, 1);
    }

    private void use21625(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (D)">
        //Внутри находится Камень: Модифицировать Доспех Ранга D. -->

        Functions.addItem(player, 12367, 1);
    }

    private void use21626(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (С)">
        //Внутри находится Камень: Модифицировать Доспех Ранга С. -->

        Functions.addItem(player, 12368, 1);
    }

    private void use21627(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (В)">
        //Внутри находится Камень: Модифицировать Доспех Ранга В. -->

        Functions.addItem(player, 12369, 1);
    }

    private void use21628(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (А)">
        //Внутри находится Камень: Модифицировать Доспех Ранга А. -->

        Functions.addItem(player, 12370, 1);
    }

    private void use21629(Player player, boolean ctrl) {     //Упаковка: Камень: Модифицировать Доспех (S)">
        //Внутри находится Камень: Модифицировать Доспех Ранга S. -->

        Functions.addItem(player, 12371, 1);
    }

    private void use21630(Player player, boolean ctrl) {     //Упаковка: Зелье Поддержания Энергии">
        //Внутри находится Зелье Поддержания Энергии -->

        Functions.addItem(player, 20391, 1);
    }

    private void use21631(Player player, boolean ctrl) {     //Упаковка: Зелье Всплеска Энергии">
        //Внутри находится Зелье Всплеска Энергии -->

        Functions.addItem(player, 20392, 1);
    }

    private void use21632(Player player, boolean ctrl) {     //Упаковка: Коктейль из Сладких Фруктов">
        //Внутри находится Коктейль из Сладких Фруктов -->

        Functions.addItem(player, 20393, 1);
    }

    private void use21633(Player player, boolean ctrl) {     //Упаковка: Коктейль из Свежих Фруктов">
        //Внутри находится Коктейль из Свежих Фруктов -->

        Functions.addItem(player, 20394, 1);
    }

    private void use21634(Player player, boolean ctrl) {     //Упаковка: Браслет Сиреневого Коня (7 дн.)">
        //Внутри находится Браслет Сиреневого Коня (7 дн.) -->

        Functions.addItem(player, 20448, 1);
    }

    private void use21635(Player player, boolean ctrl) {     //Упаковка: Браслет Сиреневого Коня (30 дн.)">
        //Внутри находится Браслет Сиреневого Коня (30 дн.) -->

        Functions.addItem(player, 20030, 1);
    }

    private void use21636(Player player, boolean ctrl) {     //Упаковка: Браслет Сиреневого Коня">
        //Внутри находится Браслет Сиреневого Коня -->

        Functions.addItem(player, 20029, 1);
    }

    private void use21637(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука (7 дн.)">
        //Внутри находится Браслет Парового Жука (7 дн.) -->

        Functions.addItem(player, 20449, 1);
    }

    private void use21638(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука (30 дн.)">
        //Внутри находится Браслет Парового Жука (30 дн.) -->

        Functions.addItem(player, 20504, 1);
    }

    private void use21639(Player player, boolean ctrl) {     //Упаковка: Браслет Парового Жука">
        //Внутри находится Браслет Парового Жука -->

        Functions.addItem(player, 20396, 1);
    }

    private void use21640(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва (30 дн.)">
        //Внутри находится Браслет Златогривого Льва (30 дн.) -->

        Functions.addItem(player, 20503, 1);
    }

    private void use21641(Player player, boolean ctrl) {     //Упаковка: Браслет Златогривого Льва">
        //Внутри находится Браслет Златогривого Льва -->

        Functions.addItem(player, 20502, 1);
    }

    private void use21642(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл (7 дн.)">
        //Внутри находится Реактивный Мотоцикл (7 дн.) -->

        Functions.addItem(player, 20938, 1);
    }

    private void use21643(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл (30 дн.)">
        //Внутри находится Реактивный Мотоцикл (30 дн.) -->

        Functions.addItem(player, 20939, 1);
    }

    private void use21644(Player player, boolean ctrl) {     //Упаковка: Реактивный Мотоцикл">
        //Внутри находится Реактивный Мотоцикл -->

        Functions.addItem(player, 21088, 1);
    }

    private void use21645(Player player, boolean ctrl) {     //Упаковка: Шляпа Наполеона (7 дн.) - Регенерация Маны">
        //Внутри находится  Шляпа Наполеона (7 дн.) -->

        Functions.addItem(player, 20427, 1);
    }

    private void use21646(Player player, boolean ctrl) {     //Упаковка: Шляпа Наполеона">
        //Внутри находится  Шляпа Наполеона -->

        Functions.addItem(player, 20322, 1);
    }

    private void use21647(Player player, boolean ctrl) {     //Упаковка: Рожки (7 дн.) - Отражение Урона">
        //Внутри находятся Рожки (7 дн.) -->

        Functions.addItem(player, 20428, 1);
    }

    private void use21648(Player player, boolean ctrl) {     //Упаковка: Рожки">
        //Внутри находятся Рожки -->

        Functions.addItem(player, 20323, 1);
    }

    private void use21649(Player player, boolean ctrl) {     //Упаковка: Маска из Черных Камней (7 дн.) - Энергия">
        //Внутри находится Маска из Черных Камней (7 дн.) -->

        Functions.addItem(player, 20429, 1);
    }

    private void use21650(Player player, boolean ctrl) {     //Упаковка: Маска из Черных Камней">
        //Внутри находится Маска из Черных Камней -->

        Functions.addItem(player, 20324, 1);
    }

    private void use21651(Player player, boolean ctrl) {     //Упаковка: Пластиковый Парик (7 дн.) - Благ. Телепорт">
        //Внутри находится Пластиковый Парик (7 дн.) -->

        Functions.addItem(player, 20430, 1);
    }

    private void use21652(Player player, boolean ctrl) {     //Упаковка: Пластиковый Парик">
        //Внутри находится Пластиковый Парик -->

        Functions.addItem(player, 20325, 1);
    }

    private void use21653(Player player, boolean ctrl) {     //Упаковка: Заколка Маргаритка (7 дн.) - Сопротивление Тьме">
        //Внутри находится Заколка Маргаритка (7 дн.) -->

        Functions.addItem(player, 20431, 1);
    }

    private void use21654(Player player, boolean ctrl) {     //Упаковка: Заколка Маргаритка">
        //Внутри находится Заколка Маргаритка. Только для персонажей женского пола. -->

        Functions.addItem(player, 22156, 1);
    }

    private void use21655(Player player, boolean ctrl) {     //Упаковка: Заколка Незабудка (7 дн.) - Легкая Походка">
        //Внутри находится Заколка Незабудка (7 дн.) -->

        Functions.addItem(player, 20432, 1);
    }

    private void use21656(Player player, boolean ctrl) {     //Упаковка: Заколка Незабудка">
        //Внутри находится Заколка Незабудка. Только для персонажей женского пола. -->

        Functions.addItem(player, 22157, 1);
    }

    private void use21657(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Бандита (7 дн.) - Шепот Смерти">
        //Внутри находится Глазная Повязка Бандита (7 дн.) -->

        Functions.addItem(player, 20433, 1);
    }

    private void use21658(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Бандита">
        //Внутри находится Глазная Повязка Бандита -->

        Functions.addItem(player, 22158, 1);
    }

    private void use21659(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Пирата (7 дн.) - Проворство">
        //Внутри находится Глазная Повязка Пирата (7 дн.) -->

        Functions.addItem(player, 20434, 1);
    }

    private void use21660(Player player, boolean ctrl) {     //Упаковка: Глазная Повязка Пирата">
        //Внутри находится Глазная Повязка Пирата -->

        Functions.addItem(player, 22159, 1);
    }

    private void use21661(Player player, boolean ctrl) {     //Упаковка: Монокль (7 дн.) - Дикая Магия">
        //Внутри находится Монокль (7 дн.) -->

        Functions.addItem(player, 20435, 1);
    }

    private void use21662(Player player, boolean ctrl) {     //Упаковка: Монокль">
        //Внутри находится Монокль -->

        Functions.addItem(player, 22160, 1);
    }

    private void use21663(Player player, boolean ctrl) {     //Упаковка: Маска Духов (7 дн.) - Регенерация Маны">
        //Внутри находится Маска Духов (7 дн.) -->

        Functions.addItem(player, 20436, 1);
    }

    private void use21664(Player player, boolean ctrl) {     //Упаковка: Маска Духов">
        //Внутри находится Маска Духов -->

        Functions.addItem(player, 22161, 1);
    }

    private void use21665(Player player, boolean ctrl) {     //Упаковка: Рога Демона (7 дн.) - Отражение Урона">
        //Внутри находятся Рога Демона (7 дн.) -->

        Functions.addItem(player, 20437, 1);
    }

    private void use21666(Player player, boolean ctrl) {     //Упаковка: Рога Демона">
        //Внутри находятся Рога Демона -->

        Functions.addItem(player, 22162, 1);
    }

    private void use21667(Player player, boolean ctrl) {     //Упаковка: Карнавальная Маска (7 дн.) - Великое Лечение">
        //Внутри находится Карнавальная Маска (7 дн.) -->

        Functions.addItem(player, 20438, 1);
    }

    private void use21668(Player player, boolean ctrl) {     //Упаковка: Карнавальная Маска">
        //Внутри находится Карнавальная Маска -->

        Functions.addItem(player, 22163, 1);
    }

    private void use21669(Player player, boolean ctrl) {     //Упаковка: Красная Карнавальная Маска (7 дн.) - Сопротивление Тьме">
        //Внутри находится Красная Карнавальная Маска (7 дн.) -->

        Functions.addItem(player, 20439, 1);
    }

    private void use21670(Player player, boolean ctrl) {     //Упаковка: Красная Карнавальная Маска">
        //Внутри находится Красная Карнавальная Маска -->

        Functions.addItem(player, 22164, 1);
    }

    private void use21671(Player player, boolean ctrl) {     //Упаковка: Кошачьи Ушки (7 дн.) - Легкая Походка">
        //Внутри находятся Кошачьи Ушки (7 дн.) -->

        Functions.addItem(player, 20440, 1);
    }

    private void use21672(Player player, boolean ctrl) {     //Упаковка: Кошачьи Ушки">
        //Внутри находятся Кошачьи Ушки -->

        Functions.addItem(player, 22165, 1);
    }

    private void use21673(Player player, boolean ctrl) {     //Упаковка: Заколка Леди (7 дн.) - Шепот Смерти">
        //Внутри находится Заколка Леди (7 дн.) -->

        Functions.addItem(player, 20441, 1);
    }

    private void use21674(Player player, boolean ctrl) {     //Упаковка: Заколка Леди">
        //Внутри находится Заколка Леди. Только для персонажей женского пола. -->

        Functions.addItem(player, 22166, 1);
    }

    private void use21675(Player player, boolean ctrl) {     //Упаковка: Ушки Енота (7 дн.) - Проворство">
        //Внутри находятся Ушки Енота (7 дн.) -->

        Functions.addItem(player, 20442, 1);
    }

    private void use21676(Player player, boolean ctrl) {     //Упаковка: Ушки Енота">
        //Внутри находятся Ушки Енота -->

        Functions.addItem(player, 22167, 1);
    }

    private void use21677(Player player, boolean ctrl) {     //Упаковка: Ушки Кролика (7 дн.) - Дикая Магия">
        //Внутри находятся Ушки Кролика (7 дн.) -->

        Functions.addItem(player, 20443, 1);
    }

    private void use21678(Player player, boolean ctrl) {     //Упаковка: Ушки Кролика">
        //Внутри находятся Ушки Кролика -->

        Functions.addItem(player, 22168, 1);
    }

    private void use21679(Player player, boolean ctrl) {     //Упаковка: Крылышко Ангела (7 дн.) - Регенерация Маны">
        //Внутри находится Крылышко Ангела (7 дн.) -->

        Functions.addItem(player, 20444, 1);
    }

    private void use21680(Player player, boolean ctrl) {     //Упаковка: Крылышко Ангела">
        //Внутри находится Крылышко Ангела -->

        Functions.addItem(player, 22169, 1);
    }

    private void use21681(Player player, boolean ctrl) {     //Упаковка: Антенки Феи (7 дн.) - Отражение Урона">
        //Внутри находятся Антенки Феи (7 дн.) -->

        Functions.addItem(player, 20445, 1);
    }

    private void use21682(Player player, boolean ctrl) {     //Упаковка: Антенки Феи">
        //Внутри находятся Антенки Феи -->

        Functions.addItem(player, 22170, 1);
    }

    private void use21683(Player player, boolean ctrl) {     //Упаковка: Украшенная Перьями Шляпа (7 дн.) - Великое Лечение">
        //Внутри находится Украшенная Перьями Шляпа (7 дн.) -->

        Functions.addItem(player, 20446, 1);
    }

    private void use21684(Player player, boolean ctrl) {     //Упаковка: Украшенная Перьями Шляпа">
        //Внутри находится Украшенная Перьями Шляпа -->

        Functions.addItem(player, 22171, 1);
    }

    private void use21685(Player player, boolean ctrl) {     //Упаковка: Защитные Очки Ремесленника (7 дн.) - Энергия">
        //Внутри находятся Защитные Очки Ремесленника (7 дн.) -->

        Functions.addItem(player, 20447, 1);
    }

    private void use21686(Player player, boolean ctrl) {     //Упаковка: Защитные Очки Ремесленника">
        //Внутри находятся Защитные Очки Ремесленника -->

        Functions.addItem(player, 22172, 1);
    }

    private void use22187(Player player, boolean ctrl) {     //Подарочная Коробка Радости Дня Рождения">
        //Подарок, вручаемый Аллегрией на день рождения персонажа. При использовании можно получить Порцию Энергии Радости (3 шт.), Торт Именинника и Колпак "С Днем Рождения!". Нельзя обменять, выбросить или уничтожить, но можно положить в личное хранилище. -->

        Functions.addItem(player, 22188, 3);
        Functions.addItem(player, 21595, 1);
        Functions.addItem(player, 21594, 1);
    }

    private void use30280(Player player, boolean ctrl) {     //Упаковка: Благословенные Заряды Духа - Ранг R">

        Functions.addItem(player, 19442, 5000);
    }

    //30278	Упаковка: Заряды Духа - Ранг R		Можно получить 5 000 Зарядов Духа - Ранга R. -->
    private void use30278(Player player, boolean ctrl) {     //Упаковка: Заряды Духа - Ранг R">

        Functions.addItem(player, 19441, 5000);
    }

    //30277	Большая Упаковка: Заряды Души - Ранг R		Можно получить 10 000 Зарядов Души - Ранга R. -->
    private void use30277(Player player, boolean ctrl) {     //Большая Упаковка: Заряды Души - Ранг R">

        Functions.addItem(player, 17754, 10000);
    }

    //30276	Упаковка: Заряды Души - Ранг R		Можно получить 5 000 Зарядов Души - Ранга R. -->
    private void use30276(Player player, boolean ctrl) {     //Упаковка: Заряды Души - Ранг R">

        Functions.addItem(player, 17754, 5000);
    }

    private void use33468(Player player, boolean ctrl) {     //Сундук Поддержки Героя">
        //Сундук с полезными вещами для игры на тестовом сервере. Нельзя обменять, выбросить, продать в личной торговой лавке. Можно положить в хранилище. -->

        Functions.addItem(player, 57, 1300000000);
        Functions.addItem(player, 10650, 10);
        Functions.addItem(player, 6645, 5000);
        Functions.addItem(player, 7117, 10);
        Functions.addItem(player, 17526, 3);
        Functions.addItem(player, 17527, 33);
        Functions.addItem(player, 30275, 20);
        Functions.addItem(player, 30276, 1);
        Functions.addItem(player, 30280, 1);
        Functions.addItem(player, 32255, 1);
        Functions.addItem(player, 32262, 1);
        Functions.addItem(player, 32316, 50);
        Functions.addItem(player, 33493, 1);
        Functions.addItem(player, 33495, 1);
        Functions.addItem(player, 33496, 1);
        Functions.addItem(player, 33497, 1);
        Functions.addItem(player, 33498, 1);
        Functions.addItem(player, 33499, 1);
    }

    private void use33493(Player player, boolean ctrl) {     //Ящик Поддержки Усиления Стихий">
        //Ящик с Кристаллами Стихий для игры на тестовом сервере. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 33481, 12);
        Functions.addItem(player, 33482, 12);
        Functions.addItem(player, 33483, 12);
        Functions.addItem(player, 33484, 12);
        Functions.addItem(player, 33485, 12);
        Functions.addItem(player, 33486, 12);
        Functions.addItem(player, 33487, 12);
        Functions.addItem(player, 33488, 12);
        Functions.addItem(player, 33489, 12);
        Functions.addItem(player, 33490, 12);
        Functions.addItem(player, 33491, 12);
        Functions.addItem(player, 33492, 12);
    }

    private void use33495(Player player, boolean ctrl) {     //Сундук Оружия Реквиема - Обычный">
        //Позволяет получить Оружие Реквиема. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 17290, 1);
        Functions.addItem(player, 17291, 1);
        Functions.addItem(player, 17292, 1);
        Functions.addItem(player, 17293, 1);
        Functions.addItem(player, 17294, 1);
        Functions.addItem(player, 17295, 1);
        Functions.addItem(player, 17296, 1);
        Functions.addItem(player, 17297, 1);
        Functions.addItem(player, 17298, 1);
        Functions.addItem(player, 17299, 1);
        Functions.addItem(player, 17300, 1);
        Functions.addItem(player, 17301, 1);
        Functions.addItem(player, 17302, 1);
        Functions.addItem(player, 17303, 1);
    }

    private void use33496(Player player, boolean ctrl) {     //Сундук Тяжелых Доспехов Бессмертия - Обычный">
        //Позволяет получить Тяжелые Доспехи Бессмертия. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 17304, 1);
        Functions.addItem(player, 17305, 1);
        Functions.addItem(player, 17306, 1);
        Functions.addItem(player, 17307, 1);
        Functions.addItem(player, 17308, 1);
        Functions.addItem(player, 17309, 1);
    }

    private void use33497(Player player, boolean ctrl) {     //Сундук Легких Доспехов Бессмертия - Обычный">
        //Позволяет получить Легкие Доспехи Бессмертия. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 17310, 1);
        Functions.addItem(player, 17311, 1);
        Functions.addItem(player, 17312, 1);
        Functions.addItem(player, 17313, 1);
        Functions.addItem(player, 17314, 1);
    }

    private void use33498(Player player, boolean ctrl) {     //Сундук Магических Доспехов Бессмертия - Обычный">
        //Позволяет получить Магические Доспехи Бессмертия. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 17315, 1);
        Functions.addItem(player, 17316, 1);
        Functions.addItem(player, 17317, 1);
        Functions.addItem(player, 17318, 1);
        Functions.addItem(player, 17319, 1);
        Functions.addItem(player, 17320, 1);
    }

    private void use33499(Player player, boolean ctrl) {     //Сундук Аксессуаров Бессмертия - Обычный">
        //Позволяет получить Аксессуары Бессмертия. Нельзя обменять, выбросить, уничтожить или продать в личной торговой лавке. Можно положить в личное хранилище. -->

        Functions.addItem(player, 17321, 1);
        Functions.addItem(player, 17322, 1);
        Functions.addItem(player, 17322, 1);
        Functions.addItem(player, 17323, 1);
        Functions.addItem(player, 17323, 1);
    }

    private void use35728(Player player, boolean ctrl) {     //Коробка поддержки героя Таути">
        //???? ?? ???? ?? ??, ???? ?? ??, ???? ???? ??, R???? ?? ??, ?? ???? ??, ???, ???, ???? ???, SP???? ??? ? ??. -->

        Functions.addItem(player, 57, 300000000);
        Functions.addItem(player, 30275, 40);
        Functions.addItem(player, 30277, 2);
        Functions.addItem(player, 30281, 1);
        Functions.addItem(player, 35723, 1);
        Functions.addItem(player, 35724, 1);
        Functions.addItem(player, 35725, 1);
        Functions.addItem(player, 35726, 1);
        Functions.addItem(player, 35727, 1);
    }

    private void use35723(Player player, boolean ctrl) {     //Коробка оружия R95">
        //???? ???? ??? ???? ??. -->

        Functions.addItem(player, 18171, 1);
        Functions.addItem(player, 18172, 1);
        Functions.addItem(player, 18173, 1);
        Functions.addItem(player, 18174, 1);
        Functions.addItem(player, 18175, 1);
        Functions.addItem(player, 18176, 1);
        Functions.addItem(player, 18177, 1);
        Functions.addItem(player, 18178, 1);
        Functions.addItem(player, 18179, 1);
        Functions.addItem(player, 18180, 1);
        Functions.addItem(player, 18181, 1);
        Functions.addItem(player, 18182, 1);
        Functions.addItem(player, 18183, 1);
        Functions.addItem(player, 18184, 1);

    }

    private void use35724(Player player, boolean ctrl) {     //Коробка брони R95">
        //???? ???? ??? ???? ??. -->

        Functions.addItem(player, 18185, 1);
        Functions.addItem(player, 18186, 1);
        Functions.addItem(player, 18187, 1);
        Functions.addItem(player, 18188, 1);
        Functions.addItem(player, 18189, 1);
        Functions.addItem(player, 18190, 1);
        Functions.addItem(player, 18191, 1);
        Functions.addItem(player, 18192, 1);
        Functions.addItem(player, 18193, 1);
        Functions.addItem(player, 18194, 1);
        Functions.addItem(player, 18195, 1);
        Functions.addItem(player, 18196, 1);
        Functions.addItem(player, 18197, 1);
        Functions.addItem(player, 18198, 1);
        Functions.addItem(player, 18199, 1);
        Functions.addItem(player, 18200, 1);
        Functions.addItem(player, 18201, 1);
    }

    private void use35725(Player player, boolean ctrl) {     //Коробка бижи R95">
        //???? ???? ????? ???? ?? -->

        Functions.addItem(player, 18202, 1);
        Functions.addItem(player, 18203, 1);
        Functions.addItem(player, 18203, 1);
        Functions.addItem(player, 18204, 1);
        Functions.addItem(player, 18204, 1);
    }

    private void use35726(Player player, boolean ctrl) {     //Коробка R95 остальное">
        //R???? ???? ???? ?? -->

        Functions.addItem(player, 17526, 3);
        Functions.addItem(player, 17527, 33);
        Functions.addItem(player, 18554, 1);
        Functions.addItem(player, 18555, 1);
        Functions.addItem(player, 18556, 1);
        Functions.addItem(player, 18571, 5);
        Functions.addItem(player, 30306, 340);
        Functions.addItem(player, 33493, 1);
    }

    private void use35727(Player player, boolean ctrl) {     //Коробка материалов Семени Индустриализации">
        //?? ???? ??? ???? ?? -->

        Functions.addItem(player, 19477, 1);
        Functions.addItem(player, 35562, 75);
        Functions.addItem(player, 35563, 100);
    }

    private void use30279(Player player, boolean ctrl) {    // Spiritshot Large Pack (R-Grade)
        Functions.addItem(player, 19441, 10000);
    }

    // Синий Сундук Хранителя Мира
    private void use34927(Player player, boolean ctrl) {
        int[][] list = new int[][]{{19448, 1}, {19447, 1}, {18552, 1}, {18551, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {18553, 1}, {19509, 1}, {19508, 1}, {19510, 1}};
        double[] chances = new double[]{0.9666, 0.3666, 5.16666, 5.16666, 7.16666, 7.16666, 7.16666, 7.16666, 7.16666,
                7.16666, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 5.16666, 13.3443, 13.3443, 13.3443};
        extractRandomOneItem(player, list, chances);
    }

    // Красный Сундук Хранителя Мира
    private void use34928(Player player, boolean ctrl) {
        int[][] list = new int[][]{{19448, 1}, {19447, 1}, {18552, 1}, {18551, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {17527, 1}, {17526, 1}, {18553, 1}, {19509, 1}, {19508, 1}, {19510, 1}};
        double[] chances = new double[]{0.9666, 0.3666, 5.16666, 5.16666, 8.16666, 8.16666, 8.16666, 8.16666, 8.16666,
                8.16666, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 6.16666, 1.16666, 5.16666, 13.3443, 13.3443, 13.3443};
        extractRandomOneItem(player, list, chances);
    }

    // Золотистый Сундук Хранителя Мира
    private void use34929(Player player, boolean ctrl) {
        int[][] list = new int[][]{{19448, 1}, {19447, 1}, {18555, 1}, {18554, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {17527, 1}, {17526, 1}, {18556, 1}, {19512, 1}, {19511, 1}, {19513, 1}};
        double[] chances = new double[]{0.9666, 0.3666, 3.16666, 3.16666, 8.16666, 8.16666, 8.16666, 8.16666, 8.16666,
                8.16666, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 6.16666, 1.16666, 2.06666, 3.0443, 3.3443, 3.3443};
        extractRandomOneItem(player, list, chances);
    }

    // Синий Сундук Странника Мира
    private void use34930(Player player, boolean ctrl) {
        int[][] list = new int[][]{{18552, 1}, {18551, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {34651, 1}, {34650, 1}, {34652, 1}, {34649, 1},
                {34653, 1}, {34654, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {17527, 1}, {17526, 1}, {18553, 1}};
        double[] chances = new double[]{5.6666, 5.6666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 21.33333,
                21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443,
                5.33333, 1.33333, 5.33333};
        extractRandomOneItem(player, list, chances);
    }

    // Красный Сундук Странника Мира
    private void use34931(Player player, boolean ctrl) {
        int[][] list = new int[][]{{18552, 1}, {18551, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {34651, 1}, {34650, 1}, {34652, 1}, {34649, 1},
                {34653, 1}, {34654, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {17527, 1}, {17526, 1}, {18553, 1}};
        double[] chances = new double[]{5.6666, 5.6666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 21.33333,
                21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443,
                5.33333, 1.33333, 5.33333};
        extractRandomOneItem(player, list, chances);
    }

    // Золотистый Сундук Странника Мира
    private void use34932(Player player, boolean ctrl) {
        int[][] list = new int[][]{{18555, 1}, {18554, 1}, {9555, 1}, {9553, 1}, {9554, 1},
                {9552, 1}, {9557, 1}, {9556, 1}, {34651, 1}, {34650, 1}, {34652, 1}, {34649, 1},
                {34653, 1}, {34654, 1}, {9549, 1}, {9547, 1}, {9548, 1}, {9546, 1}, {9551, 1},
                {9550, 1}, {17527, 1}, {17526, 1}, {18556, 1}};
        double[] chances = new double[]{0.6666, 0.5666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 3.16666, 21.33333,
                21.33333, 21.33333, 21.33333, 21.33333, 21.33333, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443, 13.3443,
                5.33333, 1.33333, 0.63333};
        extractRandomOneItem(player, list, chances);
    }

    // Сундук Реан
    private void use34855(Player player, boolean ctrl) {
        if (Rnd.chance(15))
            Functions.addItem(player, 34742, 1); // Свиток Опыта - 500 млн
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    //######################################################

    /**
     * Мешки с ОРУЖИЕМ
     */
    //######################################################
    private void use32789(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R99-Grade)
         * @Date: 04.04.2013 21:26
         * @Correct: Mazaffaka  P.S под пивко шло збс
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18252, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18206, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18207, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18208, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18209, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18210, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18211, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18212, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18213, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18214, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18215, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18216, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18217, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18218, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18219, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18239, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18240, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18241, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18242, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18243, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18244, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18245, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18246, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18247, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18248, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18249, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18250, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18251, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32788(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R95-Grade)
         * @Date: 04.04.2013 21:31
         * @Correct: Mazaffaka  P.S под пивко шло збс
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18171, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18172, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18173, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18174, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18175, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18176, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18177, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18178, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18179, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18180, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18181, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18182, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18183, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18184, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }


    private void use32787(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R-Grade)
         * @Date: 04.04.2013 21:35
         * @Correct: Mazaffaka  P.S и тут я ахуел сколько мне еще предстоит исправить
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18103, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18104, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18105, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18106, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18107, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18108, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18109, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18110, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18111, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18112, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18113, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18114, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18115, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18116, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18137, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18138, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18139, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18140, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18141, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18142, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18143, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 1814, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18145, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18146, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18147, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18148, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18149, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18150, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32786(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (S-Grade)
         * @Date: 04.04.2013 22:58
         * @Correct: Mazaffaka  P.S тут еще нормально,вот дальше C и D Grade.........
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31609, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31667, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31772, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31821, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31886, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31870, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31945, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32026, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32111, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32115, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32129, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32785(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A-Grade)
         * @Date: 04.04.2013 23:03
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31614, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31673, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31689, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31774, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31793, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31794, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31817, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31936, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31942, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31959, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31994, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31995, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32050, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32112, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32113, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32114, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32123, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32143, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32127, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31731, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31685, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32784(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B-Grade)
         * @Date: 04.04.2013 23:10
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31602, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31619, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31674, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31700, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31708, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31723, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31752, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31848, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31849, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31857, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31889, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31906, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31940, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31976, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31982, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32011, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32132, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32144, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32163, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32164, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32189, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32092, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32783(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (C-Grade)
         * @Date: 04.04.2013 00:30
         * @Correct: Mazaffaka  P.S. ну все пиздец прплыли,этом не на час XD
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31590, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31592, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31598, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31599, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31607, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31608, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31629, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31666, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31668, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31670, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31671, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31696, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31699, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31701, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31702, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31703, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31704, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31706, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31707, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31718, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31719, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31720, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31721, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31725, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31726, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31732, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31741, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31754, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31757, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31758, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31761, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31762, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31773, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31777, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31778, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31779, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31781, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31782, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31783, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31786, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31787, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31797, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31800, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31801, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31802, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31812, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31814, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31819, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31825, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31826, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31830, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31833, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31844, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31856, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31859, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31868, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31878, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31881, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31886, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31887, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31888, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31890, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31894, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31899, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31900, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31901, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31902, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31903, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31904, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31905, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31907, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31911, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31914, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31915, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31916, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31917, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31918, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31935, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31937, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31938, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31946, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31947, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31951, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31960, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31961, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31962, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31963, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31964, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31965, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31981, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31988, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31989, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31990, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31991, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31992, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32012, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32013, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32014, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32015, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32016, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32017, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32021, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32027, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32029, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32033, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32057, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32062, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32072, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32087, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32088, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32098, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32105, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32128, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32130, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32133, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32142, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32145, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32146, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32147, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32149, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32153, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32160, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32161, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32165, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32167, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32168, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32169, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31649, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31839, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32782(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (D-Grade)
         * @Date: 04.04.2013 01:11
         * @Correct: Mazaffaka  P.S. ну все пиздец прплыли,этом не на час XD
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31585, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31586, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31591, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31600, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31603, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31605, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31606, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31610, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31611, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31615, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31616, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31617, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31618, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31620, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31625, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31626, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31627, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31628, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31633, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31634, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31635, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31636, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31669, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31672, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31675, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31678, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31679, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31680, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31697, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31698, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31705, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31709, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31710, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31711, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31716, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31717, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31722, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31744, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31751, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31764, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31765, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31775, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31780, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31784, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31785, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31798, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31803, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31804, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31813, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31822, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31823, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31824, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31827, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31828, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31829, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31832, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31846, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31850, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31851, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31879, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31880, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31882, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31891, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31892, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31893, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31895, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31896, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31897, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31898, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31910, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31912, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31913, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31939, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31941, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31943, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31944, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31948, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31949, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31950, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31952, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31953, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31954, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31955, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31956, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31957, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31958, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31967, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31968, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31973, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31974, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31975, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31979, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31980, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31985, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31986, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32009, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32010, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32018, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32019, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32020, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31753, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31763, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31760, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31759, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32120, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32156, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    //#########################################################

    /**
     * Мешки с ДОСПЕХАМИ
     */
    //##########################################################
    private void use32797(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R99-Grade)
         * @Date: 04.04.2013 23:23
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18220, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18221, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18222, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18223, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18224, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18225, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18226, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18227, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18228, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18229, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18230, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18231, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18232, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18233, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18234, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18235, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18236, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18237, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18238, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18253, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18254, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18255, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18256, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18257, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18258, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18259, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18260, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18261, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18262, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18263, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18264, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18265, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18266, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18267, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18268, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18269, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18270, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18271, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18272, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32796(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R95-Grade)
         * @Date: 04.04.2013 23:28
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18185, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18186, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18187, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18188, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18189, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18190, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18191, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18192, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18193, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18134, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18195, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18196, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18197, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18198, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18199, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18200, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18201, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18202, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18203, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18204, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32795(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R-Grade)
         * @Date: 04.04.2013 23:30
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 18117, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18118, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18119, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18120, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18121, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18122, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18123, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18124, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18125, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18126, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18127, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18128, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18129, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18130, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18131, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18132, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18133, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18134, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18135, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18136, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18151, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18152, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18153, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18154, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18155, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18156, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18157, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18158, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18159, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18160, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18161, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18162, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18163, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18164, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18165, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18166, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18167, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18168, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18169, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18170, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32794(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (S-Grade)
         * @Date: 04.04.2013 23:36
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31690, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31691, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31692, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31766, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31767, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31768, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31769, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31770, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31771, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31869, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32054, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32055, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32053, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32056, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32116, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32117, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32118, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32119, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32793(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A-Grade)
         * @Date: 04.04.2013 23:48
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31630, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31631, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31632, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31681, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31682, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31683, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31684, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31686, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31687, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31688, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31834, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31835, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31836, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31837, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31838, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31840, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31841, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32063, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32064, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32065, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32066, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32067, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32068, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32069, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32070, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32071, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32091, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32134, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32135, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32136, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32137, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32138, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32139, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32140, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32141, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32792(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B-Grade)
         * @Date: 04.04.2013 23:48
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31582, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31583, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31584, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31588, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31589, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31593, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31594, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31597, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31658, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31659, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31660, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31661, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31662, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31663, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31664, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31665, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31676, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31677, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31860, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31861, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31862, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31863, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31864, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31865, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31866, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31867, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31871, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31872, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31873, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31919, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31920, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31921, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31922, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31923, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31924, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31925, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31926, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32090, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32121, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32122, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32124, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32125, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32126, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32791(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (C-Grade)
         * @Date: 04.04.2013 00:30
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31645, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31646, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31647, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31648, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31652, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31653, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31654, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31655, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31656, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31695, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31712, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31713, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31714, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31715, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31727, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31728, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31729, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31730, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31733, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31734, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31735, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31736, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31737, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31742, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31749, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31776, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31795, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31796, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31842, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31843, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31845, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31847, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31852, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31853, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31854, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31855, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31874, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31875, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31876, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31877, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31883, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31884, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31885, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31928, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31929, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31930, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31931, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31932, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31933, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31934, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31987, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32002, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32003, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32004, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32005, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32006, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32007, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32008, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32048, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32049, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32093, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32094, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32095, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32096, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32100, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32101, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32102, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32103, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32104, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32108, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32109, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32110, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32155, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32157, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32162, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32175, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32176, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32177, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32178, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32790(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (D-Grade)
         * @Date: 04.04.2013 00:30
         * @Correct: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 31579, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31580, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31581, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31587, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31595, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31596, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31601, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31612, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31613, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31621, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31622, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31623, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31624, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31637, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31638, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31639, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31640, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31641, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31642, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31643, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31644, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31650, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31651, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31657, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31693, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31694, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31724, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31738, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31739, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31740, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31743, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31745, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31746, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31747, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31748, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31750, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31755, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31756, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31788, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31789, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31790, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31791, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31792, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31799, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31805, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31806, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31807, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31808, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31809, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31810, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31811, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31816, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31820, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31831, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31858, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31908, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31909, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31927, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31969, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31970, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31971, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31972, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31977, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31978, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31983, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31984, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31993, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31996, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31997, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31998, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 31999, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32000, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32001, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32034, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32035, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32036, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32037, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32038, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32039, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32040, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32041, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32042, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32043, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32044, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32046, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32047, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32058, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32059, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32060, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32061, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32073, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32074, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32076, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32077, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32078, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32079, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32080, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32081, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32084, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32089, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32106, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32107, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32170, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32171, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32172, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32179, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32180, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32181, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32182, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32184, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32185, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32186, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 32187, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    //######################################################

    /**
     * Мешки с Усилителем
     */
    //######################################################
    private void use32228(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (D)
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 955, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 956, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32242(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (С(46))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 952, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8723, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8733, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8743, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8753, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32229(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (С(49))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 951, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8724, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8734, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8744, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8754, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32230(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B(52))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 951, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 952, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8725, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8735, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8745, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8755, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32231(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B(55))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 947, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8726, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8736, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8746, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8756, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32232(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B(58))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 948, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8727, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8737, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8747, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8757, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32233(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (B(61))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 948, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 947, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8728, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8738, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8748, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8758, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32234(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A(64))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 730, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8729, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8739, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8749, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8759, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32235(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A(67))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 730, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8730, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8740, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8750, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8760, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32236(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A(70))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 730, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 729, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8731, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8741, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8751, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8761, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9570, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9571, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9572, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32237(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (A(75))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 960, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8732, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8742, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8752, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 8762, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9546, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9547, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9548, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9549, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9550, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9551, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32238(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (S(80))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 960, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 959, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9573, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9574, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9575, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9576, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9552, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9553, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9554, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9555, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9556, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 9557, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32239(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (S(82))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 960, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 959, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10480, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10481, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10482, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10483, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10484, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10485, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 10486, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32240(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (S(84))
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 960, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 959, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14166, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14167, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14168, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14169, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 13071, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 13072, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 13073, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15541, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15542, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15543, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15826, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15827, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 15828, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14166, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14167, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14168, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 14169, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16161, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16162, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16163, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16164, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16165, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16166, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 16167, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32779(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R)
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 17527, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18551, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18552, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18553, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18563, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18564, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18565, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18566, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18567, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19503, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19502, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19504, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32781(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R99)
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 17526, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 17527, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18573, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18574, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18575, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18576, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18557, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18558, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18559, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use32780(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka  (R95)
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 17526, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 17527, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19505, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19506, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19507, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18554, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18555, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18556, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18568, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18569, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18570, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 18571, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use34861(Player player, boolean ctrl) {
        /**
         * @Author: Mazaffaka
         */
        if (Rnd.chance(15))
            // itemId, count
            Functions.addItem(player, 17526, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 17527, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19514, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19515, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19516, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19517, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19518, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19519, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19520, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19521, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19305, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19306, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19307, 1);
        else if (Rnd.chance(15))
            Functions.addItem(player, 19308, 1);
        else
            player.sendPacket(Msg.THERE_WAS_NOTHING_FOUND_INSIDE_OF_THAT);
    }

    private void use14767(Player player, boolean ctr) {
        int[][] items = {{14769, 1, 1}, {14771, 1, 1}, {14769, 1, 1}, {14775, 1, 1}};

        double[] chances = {50.0, 50.0, 50.0, 50.0};

        capsulate(player, items, chances);
    }

    private void use14766(Player player, boolean ctr) {
        int[][] items = {{14769, 5, 5}, {14772, 1, 1}, {14769, 5, 5}, {14773, 1, 1}, {14769, 5, 5}, {14776, 1, 1}};

        double[] chances = {10.0, 10.0, 40.0, 40.0, 50.0, 50.0};

        capsulate(player, items, chances);
    }

    private void use14729(Player player, boolean ctr) {
        int[][] items = {{14733, 1, 1}, {14737, 1, 1}, {14736, 1, 1}, {14735, 1, 1}, {14734, 1, 1}, {14731, 1, 1}, {14730, 1, 1}};

        double[] chances = {35.100000000000001, 22.100000000000001, 22.100000000000001, 10.1, 6.1, 3.0, 1.5};

        capsulate(player, items, chances);
    }

    private void use20097(Player player, boolean ctr) {
        int[][] items = {{20098, 1, 1}, {20099, 1, 1}};

        double[] chances = {20.0, 80.0};

        capsulate(player, items, chances);
    }

    private void use20629(Player player, boolean ctr) {
        int[][] items = {{20590, 1, 1}, {9207, 1, 1}};

        double[] chances = {40.0, 60.0};

        capsulate(player, items, chances);
    }

    private void use14638(Player player, boolean ctr) {
        int[][] items = {{57, 697000, 697000}, {57, 418200, 418200}, {9628, 2, 2}, {9630, 2, 2}, {9629, 2, 2}};

        double[] chances = {60.0, 30.0, 30.0, 30.0, 30.0};

        capsulate(player, items, chances);
    }

    private void use14637(Player player, boolean ctr) {
        int[][] items = {{57, 626000, 626000}, {57, 438200, 438200}, {9629, 4, 4}};

        double[] chances = {70.0, 30.0, 30.0};

        capsulate(player, items, chances);
    }

    private void use14636(Player player, boolean ctr) {
        int[][] items = {{57, 605000, 605000}, {57, 484000, 484000}, {9630, 3, 3}};

        double[] chances = {80.0, 20.0, 20.0};

        capsulate(player, items, chances);
    }

    private void use14635(Player player, boolean ctr) {
        int[][] items = {{57, 583000, 583000}, {57, 524700, 524700}, {9628, 2, 2}};

        double[] chances = {90.0, 10.0, 10.0};

        capsulate(player, items, chances);
    }

    private void use14677(Player player, boolean ctr) {
        int[][] items = {{14700, 3, 3}, {14701, 3, 3}, {9625, 1, 1}, {9626, 1, 1}, {14716, 1, 1}, {14717, 1, 1}, {14718, 1, 1}, {14709, 1, 1}, {14710, 1, 1}, {14711, 1, 1}, {14704, 1, 1}, {14705, 1, 1}, {14706, 1, 1}, {14678, 1, 1}, {14679, 1, 1}, {14680, 1, 1}, {14681, 1, 1}};

        double[] chances = {40.0, 26.0, 4.0, 4.0, 6.0, 6.0, 6.0, 3.9, 1.95, 0.15, 0.65, 0.325, 0.025, 0.6, 0.26, 0.13, 0.01};

        capsulate(player, items, chances);
    }

    private void use14676(Player player, boolean ctr) {
        int[][] items = {{14700, 3, 3}, {14701, 3, 3}, {9625, 1, 1}, {9626, 1, 1}, {14716, 1, 1}, {14717, 1, 1}, {14718, 1, 1}, {14709, 1, 1}, {14710, 1, 1}, {14711, 1, 1}, {14704, 1, 1}, {14705, 1, 1}, {14706, 1, 1}, {14678, 1, 1}, {14679, 1, 1}, {14680, 1, 1}, {14681, 1, 1}};

        double[] chances = {40.0, 26.0, 4.0, 4.0, 6.0, 6.0, 6.0, 3.9, 1.95, 0.15, 0.65, 0.325, 0.025, 0.6, 0.26, 0.13, 0.01};

        capsulate(player, items, chances);
    }

    private void use20277(Player player, boolean ctr) {
        int[][] items = {{20268, 1, 1}, {20269, 1, 1}, {20267, 1, 1}};

        double[] chances = {33.0, 33.0, 34.0};

        capsulate(player, items, chances);
    }

    private void use20271(Player player, boolean ctr) {
        int[][] items = {{20255, 1, 1}, {20256, 1, 1}, {20257, 1, 1}, {20258, 1, 1}, {20259, 1, 1}, {20260, 1, 1}, {20261, 1, 1}, {20262, 1, 1}, {20263, 1, 1}, {20264, 1, 1}, {20265, 1, 1}, {20270, 1, 1}};

        double[] chances = {8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.34, 8.26};

        capsulate(player, items, chances);
    }

    private void use20739(Player player, boolean ctr) {
        int[][] items = {{20364, 1, 1}, {20365, 1, 1}, {20366, 1, 1}};

        double[] chances = {33.0, 33.0, 34.0};

        capsulate(player, items, chances);
    }

    private void use13428(Player player, boolean ctr) {
        int[][] items = {{10260, 1, 1}, {10261, 1, 1}, {10262, 1, 1}, {10263, 1, 1}, {10264, 1, 1}, {10265, 1, 1}, {10266, 1, 1}, {10267, 1, 1}, {10268, 1, 1}, {10269, 1, 1}, {10270, 1, 1}};

        double[] chances = {9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 10.0};

        capsulate(player, items, chances);
    }

    private void use13427(Player player, boolean ctr) {
        int[][] items = {{10260, 2, 2}, {10261, 2, 2}, {10262, 2, 2}, {10263, 2, 2}, {10264, 2, 2}, {10265, 2, 2}, {10266, 2, 2}, {10267, 2, 2}, {10268, 2, 2}, {10269, 2, 2}, {10270, 2, 2}};

        double[] chances = {9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 10.0};

        capsulate(player, items, chances);
    }

    private void use13426(Player player, boolean ctr) {
        int[][] items = {{9546, 1, 1}, {9547, 1, 1}, {9548, 1, 1}, {9549, 1, 1}, {9550, 1, 1}, {9551, 1, 1}};

        double[] chances = {16.600000000000001, 16.600000000000001, 16.600000000000001, 16.600000000000001, 16.600000000000001, 17.0};

        capsulate(player, items, chances);
    }

    private void use13425(Player player, boolean ctr) {
        int[][] items = {{7122, 1, 1}, {7123, 1, 1}, {7124, 1, 1}, {7125, 1, 1}, {7126, 1, 1}, {7127, 1, 1}, {7128, 1, 1}, {7129, 1, 1}, {7130, 1, 1}, {7131, 1, 1}, {7132, 1, 1}, {7133, 1, 1}, {7134, 1, 1}, {7135, 1, 1}};

        double[] chances = {7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14};

        capsulate(player, items, chances);
    }

    private void use13424(Player player, boolean ctr) {
        int[][] items = {{10260, 3, 3}, {10261, 3, 3}, {10262, 3, 3}, {10263, 3, 3}, {10264, 3, 3}, {10265, 3, 3}, {10266, 3, 3}, {10267, 3, 3}, {10268, 3, 3}, {10269, 3, 3}, {10270, 3, 3}};

        double[] chances = {9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 10.0};

        capsulate(player, items, chances);
    }

    private void use13423(Player player, boolean ctr) {
        int[][] items = {{9546, 2, 2}, {9547, 2, 2}, {9548, 2, 2}, {9549, 2, 2}, {9550, 2, 2}, {9551, 2, 2}};

        double[] chances = {2.16, 2.16, 2.16, 2.16, 2.16, 2.17};

        capsulate(player, items, chances);
    }

    private void use13422(Player player, boolean ctr) {
        int[][] items = {{7122, 2, 2}, {7123, 2, 2}, {7124, 2, 2}, {7125, 2, 2}, {7126, 2, 2}, {7127, 2, 2}, {7128, 2, 2}, {7129, 2, 2}, {7130, 2, 2}, {7131, 2, 2}, {7132, 2, 2}, {7133, 2, 2}, {7134, 2, 2}, {7135, 2, 2}};

        double[] chances = {7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14, 7.14};

        capsulate(player, items, chances);
    }

    private void use10259(Player player, boolean ctr) {
        int[][] items = {{10260, 3, 3}, {10261, 3, 3}, {10262, 3, 3}, {10263, 3, 3}, {10264, 3, 3}, {10265, 3, 3}, {10266, 3, 3}, {10267, 3, 3}, {10268, 3, 3}, {10269, 3, 3}, {10270, 3, 3}};

        double[] chances = {9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 9.0, 10.0};

        capsulate(player, items, chances);
    }

    private void use10258(Player player, boolean ctr) {
        Functions.addItem(player, 10178, 5);
        Functions.addItem(player, 10179, 5);
    }

    private void use10257(Player player, boolean ctr) {
        int[][] items = {{951, 1, 1}, {952, 1, 1}, {955, 1, 1}, {956, 1, 1}, {1538, 1, 1}, {9909, 1, 1}, {10139, 1, 1}};

        double[] chances = {3.01, 21.300000000000001, 6.41, 52.719999999999999, 2.56, 7.0, 7.0};

        capsulate(player, items, chances);
    }

    private void use10256(Player player, boolean ctr) {
        int[][] items = {{729, 1, 1}, {730, 1, 1}, {947, 1, 1}, {948, 1, 1}, {8736, 1, 1}, {8738, 1, 1}, {8741, 1, 1}, {8742, 1, 1}, {3936, 1, 1}};

        double[] chances = {0.51, 3.86, 1.85, 11.57, 32.149999999999999, 23.149999999999999, 12.859999999999999, 11.57, 2.48};

        capsulate(player, items, chances);
    }

    private void use10255(Player player, boolean ctr) {
        int[][] items = {{9625, 1, 1}, {9626, 1, 1}, {9627, 1, 1}, {9546, 1, 1}, {9547, 1, 1}, {9548, 1, 1}, {9549, 1, 1}, {9550, 1, 1}, {9551, 1, 1}, {959, 1, 1}, {960, 1, 1}};

        double[] chances = {2.2, 1.42, 0.67, 15.300000000000001, 15.300000000000001, 15.300000000000001, 15.300000000000001, 15.300000000000001, 15.300000000000001, 0.28, 3.73};

        capsulate(player, items, chances);
    }

    private void use15376(Player player, boolean ctr) {
        int[] list = {15380, 15389, 15380, 15390, 15380, 15391, 15380, 15392};
        int[] chances = {65, 65, 25, 25, 10, 10, 1, 1};
        int[] counts = {5, 1, 5, 1, 5, 1, 5, 1};
        extract_item_r(list, counts, chances, player);
    }

    private void use15372(Player player, boolean ctr) {
        int[] list = {15384, 15379, 15385, 15379, 15386, 15387};
        int[] chances = {65, 25, 25, 10, 10, 1};
        int[] counts = {1, 5, 1, 5, 1, 1};
        extract_item_r(list, counts, chances, player);
    }

    private void use8547(Player player, boolean ctr) {
        int[][] items = {{8034, 1, 3}, {2134, 1, 3}, {2133, 1, 7}};

        double[] chances = {85.0, 4.0, 11.0};

        capsulate(player, items, chances);
    }

    private void use8551(Player player, boolean ctr) {
        int[][] items = {{8552, 1, 1}, {8187, 1, 1}, {8555, 1, 5}, {6406, 1, 10}, {6407, 1, 5}, {5577, 1, 1}, {5578, 1, 1}, {5579, 1, 1}, {5580, 1, 1}, {5581, 1, 1}, {5582, 1, 1}};

        double[] chances = {25.0, 25.0, 25.0, 15.0, 9.991, 0.002, 0.002, 0.002, 0.001, 0.001, 0.001};

        capsulate(player, items, chances);
    }

    private void use8570(Player player, boolean ctr) {
        int[][] items = {{8592, 1, 1}, {1539, 1, 10}};

        double[] chances = {50.0, 50.0};

        capsulate(player, items, chances);
    }

    private void use8571(Player player, boolean ctr) {
        int[][] items = {{8592, 1, 1}, {1539, 1, 10}};

        double[] chances = {50.0, 50.0};

        capsulate(player, items, chances);
    }

    private void use8572(Player player, boolean ctr) {
        int[][] items = {{1539, 1, 20}, {952, 1, 1}, {951, 1, 1}, {1538, 1, 1}, {3936, 1, 1}, {4637, 1, 1}, {4659, 1, 10}, {4648, 1, 10}};

        double[] chances = {87.0, 7.0, 2.05, 2.0, 1.05, 0.3, 0.3, 0.3};

        capsulate(player, items, chances);
    }

    private void use8573(Player player, boolean ctr) {
        int[][] items = {{1539, 1, 20}, {948, 1, 1}, {947, 1, 1}, {1538, 1, 1}, {3936, 1, 1}, {4638, 1, 1}, {4660, 1, 1}, {4649, 1, 1}};

        double[] chances = {90.700000000000003, 1.5, 2.0, 1.05, 0.25, 0.25, 0.25};

        capsulate(player, items, chances);
    }

    private void use8574(Player player, boolean ctr) {
        int[][] items = {{1539, 1, 20}, {730, 1, 1}, {729, 1, 1}, {1538, 1, 1}, {3936, 1, 1}, {4639, 1, 1}, {4650, 1, 1}, {4661, 1, 1}};

        double[] chances = {93.0, 2.0, 0.5, 3.0, 1.41, 0.03, 0.03, 0.03};

        capsulate(player, items, chances);
    }

    private void use8575(Player player, boolean ctr) {
        int[][] items = {{1539, 1, 20}, {730, 1, 1}, {729, 1, 1}, {1538, 1, 1}, {3936, 1, 1}, {4639, 1, 1}, {4650, 1, 1}, {4661, 1, 1}};

        double[] chances = {93.0, 2.0, 0.5, 3.0, 1.41, 0.03, 0.03, 0.03};

        capsulate(player, items, chances);
    }

    private void use8966(Player player, boolean ctr) {
        int[][] items = {{1835, 1000, 1000}, {8622, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use8967(Player player, boolean ctr) {
        int[][] items = {{1463, 1000, 1000}, {8623, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use8968(Player player, boolean ctr) {
        int[][] items = {{1464, 1000, 1000}, {8624, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use8969(Player player, boolean ctr) {
        int[][] items = {{1465, 500, 500}, {8625, 7, 7}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use8970(Player player, boolean ctr) {
        int[][] items = {{1466, 300, 300}, {8626, 7, 7}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use8971(Player player, boolean ctr) {
        int[][] items = {{1466, 300, 300}, {8627, 5, 5}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9104(Player player, boolean ctr) {
        int[][] items = {{8980, 1, 1}, {17, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9105(Player player, boolean ctr) {
        int[][] items = {{8989, 1, 1}, {1341, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9106(Player player, boolean ctr) {
        int[][] items = {{8997, 1, 1}, {1342, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9107(Player player, boolean ctr) {
        int[][] items = {{9008, 1, 1}, {1343, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9108(Player player, boolean ctr) {
        int[][] items = {{9016, 1, 1}, {1344, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9109(Player player, boolean ctr) {
        int[][] items = {{9027, 1, 1}, {1344, 1000, 1000}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9110(Player player, boolean ctr) {
        int[][] items = {{9030, 1, 1}, {9031, 1, 1}, {9038, 1, 1}, {9039, 1, 1}, {9037, 1, 1}, {9036, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9111(Player player, boolean ctr) {
        int[][] items = {{9040, 1, 1}, {9041, 1, 1}, {9042, 1, 1}, {9043, 1, 1}, {9044, 1, 1}, {9053, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9112(Player player, boolean ctr) {
        int[][] items = {{9054, 1, 1}, {9055, 1, 1}, {9056, 1, 1}, {9057, 1, 1}, {9028, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9113(Player player, boolean ctr) {
        int[][] items = {{9067, 1, 1}, {9068, 1, 1}, {9069, 1, 1}, {9070, 1, 1}, {9071, 1, 1}, {9072, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9114(Player player, boolean ctr) {
        int[][] items = {{9081, 1, 1}, {9082, 1, 1}, {9083, 1, 1}, {9084, 1, 1}, {9085, 1, 1}, {9086, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9115(Player player, boolean ctr) {
        int[][] items = {{9094, 1, 1}, {9095, 1, 1}, {9096, 1, 1}, {9097, 1, 1}, {9029, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9116(Player player, boolean ctr) {
        int[][] items = {{9032, 1, 1}, {9033, 1, 1}, {9037, 1, 1}, {9038, 1, 1}, {9039, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9117(Player player, boolean ctr) {
        int[][] items = {{9045, 1, 1}, {9046, 1, 1}, {9047, 1, 1}, {9048, 1, 1}, {9053, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9118(Player player, boolean ctr) {
        int[][] items = {{9058, 1, 1}, {9059, 1, 1}, {9060, 1, 1}, {9061, 1, 1}, {9066, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9119(Player player, boolean ctr) {
        int[][] items = {{9073, 1, 1}, {9074, 1, 1}, {9075, 1, 1}, {9076, 1, 1}, {9069, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9120(Player player, boolean ctr) {
        int[][] items = {{9087, 1, 1}, {9088, 1, 1}, {9089, 1, 1}, {9090, 1, 1}, {9083, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9121(Player player, boolean ctr) {
        int[][] items = {{9098, 1, 1}, {9099, 1, 1}, {9100, 1, 1}, {9095, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9122(Player player, boolean ctr) {
        int[][] items = {{9034, 1, 1}, {9035, 1, 1}, {9037, 1, 1}, {9038, 1, 1}, {9036, 1, 1}, {9039, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9123(Player player, boolean ctr) {
        int[][] items = {{9049, 1, 1}, {9050, 1, 1}, {9051, 1, 1}, {9052, 1, 1}, {9053, 1, 1}, {9044, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9124(Player player, boolean ctr) {
        int[][] items = {{9062, 1, 1}, {9063, 1, 1}, {9064, 1, 1}, {9065, 1, 1}, {9066, 1, 1}, {9056, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9125(Player player, boolean ctr) {
        int[][] items = {{9077, 1, 1}, {9078, 1, 1}, {9079, 1, 1}, {9080, 1, 1}, {9069, 1, 1}, {9070, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9126(Player player, boolean ctr) {
        int[][] items = {{9091, 1, 1}, {9092, 1, 1}, {9093, 1, 1}, {9084, 1, 1}, {9083, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9127(Player player, boolean ctr) {
        int[][] items = {{9101, 1, 1}, {9102, 1, 1}, {9103, 1, 1}, {9095, 1, 1}, {9129, 1, 1}};

        double[] chances = {100.0, 100.0, 100.0, 100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9130(Player player, boolean ctr) {
        int[][] items = {{2509, 1000, 1000}, {8622, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9131(Player player, boolean ctr) {
        int[][] items = {{2510, 1000, 1000}, {8623, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9132(Player player, boolean ctr) {
        int[][] items = {{2511, 1000, 1000}, {8624, 10, 10}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9133(Player player, boolean ctr) {
        int[][] items = {{2512, 500, 500}, {8625, 7, 7}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9134(Player player, boolean ctr) {
        int[][] items = {{2513, 300, 300}, {8626, 7, 7}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9135(Player player, boolean ctr) {
        int[][] items = {{2513, 300, 300}, {8627, 5, 5}};

        double[] chances = {100.0, 100.0};

        capsulate(player, items, chances);
    }

    private void use9144(Player player, boolean ctr) {
        int[][] items = {{9143, 1, 1}};

        double[] chances = {50.0};

        capsulate(player, items, chances);
    }

    private void use10205(Player player, boolean ctr) {
        int[][] items = {{9597, 2, 2}};

        double[] chances = {100.0};

        capsulate(player, items, chances);
    }

    private void use10206(Player player, boolean ctr) {
        int[][] items = {{9598, 2, 2}};

        double[] chances = {100.0};

        capsulate(player, items, chances);
    }

    private void use10254(Player player, boolean ctr) {
        int[][] items = {{6373, 1, 1}, {6374, 1, 1}, {6375, 1, 1}, {6376, 1, 1}, {6377, 1, 1}, {6378, 1, 1}, {6379, 1, 1}, {6380, 1, 1}, {6381, 1, 1}, {6382, 1, 1}, {6383, 1, 1}, {6384, 1, 1}, {6385, 1, 1}, {6386, 1, 1}, {9570, 1, 1}, {9571, 1, 1}, {9572, 1, 1}, {5908, 1, 1}, {5911, 1, 1}, {5914, 1, 1}};

        double[] chances = {1.19, 1.84, 4.47, 4.47, 4.25, 3.01, 0.19, 4.47, 4.47, 3.01, 0.19, 4.47, 4.47, 3.01, 3.16, 3.16, 3.16, 15.67, 15.67, 15.67};

        capsulate(player, items, chances);
    }

    private void use21225(Player player, boolean ctr) {
        Functions.addItem(player, 10178, 3);
    }

    private void use21226(Player player, boolean ctr) {
        Functions.addItem(player, 10178, 3);
    }

    private void use21229(Player player, boolean ctr) {
        Functions.addItem(player, 10179, 3);
    }

    private void use21230(Player player, boolean ctr) {
        Functions.addItem(player, 10179, 3);
    }

    private void use21233(Player player, boolean ctr) {
        Functions.addItem(player, 14739, 3);
    }

    private void use21234(Player player, boolean ctr) {
        Functions.addItem(player, 14739, 3);
    }

    private void use21237(Player player, boolean ctr) {
        Functions.addItem(player, 21239, 3);
    }

    private void use21238(Player player, boolean ctr) {
        Functions.addItem(player, 21240, 3);
    }

    private void use21240(Player player, boolean ctr) {
        Functions.addItem(player, 21243, 3);
    }

    private void use21241(Player player, boolean ctr) {
        Functions.addItem(player, 21244, 3);
    }

    private void use15434(Player player, boolean ctr) {
        int[][] items = {{15443, 1, 1}, {15444, 1, 1}, {15445, 1, 1}, {15446, 1, 1}, {15447, 1, 1}};

        double[] chances = {20.0, 20.0, 20.0, 20.0, 20.0};

        capsulate(player, items, chances);
    }

    private void use15435(Player player, boolean ctr) {
        int[][] items = {{15450, 1, 1}, {15451, 1, 1}, {15452, 1, 1}, {15453, 1, 1}, {15449, 1, 1}};

        double[] chances = {20.0, 20.0, 20.0, 20.0, 20.0};

        capsulate(player, items, chances);
    }

    private void use15437(Player player, boolean ctr) {
        int[][] items = {{10131, 1, 1}, {10132, 1, 1}, {10133, 1, 1}};

        double[] chances = {33.0, 33.0, 34.0};

        capsulate(player, items, chances);
    }

    private void use21421(Player player, boolean ctr) {
        Functions.addItem(player, 13021, 1);
    }

    private void use21422(Player player, boolean ctr) {
        Functions.addItem(player, 13307, 1);
    }

    private static void capsulate(Player player, int[][] items, double[] chances) {
        int c = 0;
        boolean empty = true;
        for (int[] i : items) {
            if ((chances[c] > 0.0D) && (i[1] > 0) && (i[2] > 0) && (i[2] >= i[1])) {
                if (Rnd.chance(chances[c])) {
                    Functions.addItem(player, i[0], Rnd.get(i[1], i[2]));
                    empty = false;
                }
            }
        }
    }

}
